openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
 /**
 ****************************************************************************************
 *
 * Copyright (c) 2016, Dialog Semiconductor
 * All rights reserved.
 * Redistribution and use in source and binary forms, with or without modification, 
 * are permitted provided that the following conditions are met:
 * 1. Redistributions of source code must retain the above copyright notice, 
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation 
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its contributors 
 *    may be used to endorse or promote products derived from this software without 
 *    specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
 * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
 * INDIRECT, INCIDENTAL,  SPECIAL,  EXEMPLARY,  OR CONSEQUENTIAL DAMAGES (INCLUDING, 
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED 
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     DA14680BB.h
 *
 * @brief    CMSIS Cortex-M0 Peripheral Access Layer Header File for
 *           DA14680BB from Dialog.
 *
 * @version  V1.2
 * @date     14. June 2017
 *
 * @note     Generated with SVDConv V2.87l 
 *           from CMSIS SVD File 'DA14680BB.xml' Version 1.2,
 *
 *****************************************************************************************
 */



/** @addtogroup Dialog
  * @{
  */

/** @addtogroup DA14680BB
  * @{
  */

#ifndef DA14680BB_H
#define DA14680BB_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

/**
  * @brief Interrupt Number Definition
  */

typedef enum {
/* -------------------  Cortex-M0 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* --------------------  DA14680BB Specific Interrupt Numbers  -------------------- */
  BLE_WAKEUP_LP_IRQn            =   0,              /*!<   0  BLE_WAKEUP_LP                                                    */
  BLE_GEN_IRQn                  =   1,              /*!<   1  BLE_GEN                                                          */
  FTDF_WAKEUP_IRQn              =   2,              /*!<   2  FTDF_WAKEUP                                                      */
  FTDF_GEN_IRQn                 =   3,              /*!<   3  FTDF_GEN                                                         */
  RFCAL_IRQn                    =   4,              /*!<   4  RFCAL                                                            */
  COEX_IRQn                     =   5,              /*!<   5  COEX                                                             */
  CRYPTO_IRQn                   =   6,              /*!<   6  CRYPTO                                                           */
  MRM_IRQn                      =   7,              /*!<   7  MRM                                                              */
  UART_IRQn                     =   8,              /*!<   8  UART                                                             */
  UART2_IRQn                    =   9,              /*!<   9  UART2                                                            */
  I2C_IRQn                      =  10,              /*!<  10  I2C                                                              */
  I2C2_IRQn                     =  11,              /*!<  11  I2C2                                                             */
  SPI_IRQn                      =  12,              /*!<  12  SPI                                                              */
  SPI2_IRQn                     =  13,              /*!<  13  SPI2                                                             */
  ADC_IRQn                      =  14,              /*!<  14  ADC                                                              */
  KEYBRD_IRQn                   =  15,              /*!<  15  KEYBRD                                                           */
  IRGEN_IRQn                    =  16,              /*!<  16  IRGEN                                                            */
  WKUP_GPIO_IRQn                =  17,              /*!<  17  WKUP_GPIO                                                        */
  SWTIM0_IRQn                   =  18,              /*!<  18  SWTIM0                                                           */
  SWTIM1_IRQn                   =  19,              /*!<  19  SWTIM1                                                           */
  QUADEC_IRQn                   =  20,              /*!<  20  QUADEC                                                           */
  USB_IRQn                      =  21,              /*!<  21  USB                                                              */
  PCM_IRQn                      =  22,              /*!<  22  PCM                                                              */
  SRC_IN_IRQn                   =  23,              /*!<  23  SRC_IN                                                           */
  SRC_OUT_IRQn                  =  24,              /*!<  24  SRC_OUT                                                          */
  VBUS_IRQn                     =  25,              /*!<  25  VBUS                                                             */
  DMA_IRQn                      =  26,              /*!<  26  DMA                                                              */
  RF_DIAG_IRQn                  =  27,              /*!<  27  RF_DIAG                                                          */
  TRNG_IRQn                     =  28,              /*!<  28  TRNG                                                             */
  DCDC_IRQn                     =  29,              /*!<  29  DCDC                                                             */
  XTAL16RDY_IRQn                =  30,              /*!<  30  XTAL16RDY                                                        */
  PLL_LOCK_IRQn                 =  31               /*!<  31  PLL_LOCK                                                         */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS_DA14680BB
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M0 Processor and Core Peripherals---------------- */
#define __CM0_REV                 0x0100            /*!< Cortex-M0 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0.h"                               /*!< Cortex-M0 processor and core peripherals                              */
#include "system_DA14680.h"                         /*!< DA14680BB System                                                      */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers_DA14680BB
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif









/* ================================================================================ */
/* ================                    AES_HASH                    ================ */
/* ================================================================================ */


/**
  * @brief AES_HASH registers (AES_HASH)
  */

typedef struct {                                    /*!< (@ 0x40020000) AES_HASH Structure                                     */
  __IO uint32_t  CRYPTO_CTRL_REG;                   /*!< (@ 0x40020000) Crypto Control register                                */
  __IO uint32_t  CRYPTO_START_REG;                  /*!< (@ 0x40020004) Crypto Start calculation                               */
  __IO uint32_t  CRYPTO_FETCH_ADDR_REG;             /*!< (@ 0x40020008) Crypto DMA fetch register                              */
  __IO uint32_t  CRYPTO_LEN_REG;                    /*!< (@ 0x4002000C) Crypto Length of the input block in bytes              */
  __IO uint32_t  CRYPTO_DEST_ADDR_REG;              /*!< (@ 0x40020010) Crypto DMA destination memory                          */
  __IO uint32_t  CRYPTO_STATUS_REG;                 /*!< (@ 0x40020014) Crypto Status register                                 */
  __IO uint32_t  CRYPTO_CLRIRQ_REG;                 /*!< (@ 0x40020018) Crypto Clear interrupt request                         */
  __IO uint32_t  CRYPTO_MREG0_REG;                  /*!< (@ 0x4002001C) Crypto Mode depended register 0                        */
  __IO uint32_t  CRYPTO_MREG1_REG;                  /*!< (@ 0x40020020) Crypto Mode depended register 1                        */
  __IO uint32_t  CRYPTO_MREG2_REG;                  /*!< (@ 0x40020024) Crypto Mode depended register 2                        */
  __IO uint32_t  CRYPTO_MREG3_REG;                  /*!< (@ 0x40020028) Crypto Mode depended register 3                        */
  __I  uint32_t  RESERVED[53];
  __IO uint32_t  CRYPTO_KEYS_START;                 /*!< (@ 0x40020100) Crypto First position of the AES keys storage
                                                         memory                                                                */
} AES_HASH_Type;


/* ================================================================================ */
/* ================                     ANAMISC                    ================ */
/* ================================================================================ */


/**
  * @brief ANAMISC registers (ANAMISC)
  */

typedef struct {                                    /*!< (@ 0x50001B00) ANAMISC Structure                                      */
  __I  uint16_t  RESERVED;
  __IO uint16_t  ANA_TEST_REG;                      /*!< (@ 0x50001B02) Analog test registers                                  */
  __I  uint32_t  RESERVED1;
  __IO uint16_t  CHARGER_CTRL1_REG;                 /*!< (@ 0x50001B08) Charger control register 1                             */
  __IO uint16_t  CHARGER_CTRL2_REG;                 /*!< (@ 0x50001B0A) Charger control register 2                             */
  __IO uint16_t  CHARGER_STATUS_REG;                /*!< (@ 0x50001B0C) Charger status and trimming register                   */
  __I  uint16_t  RESERVED2[25];
  __IO uint16_t  SOC_CTRL1_REG;                     /*!< (@ 0x50001B40) Fuel Gauge Control register 1                          */
  __IO uint16_t  SOC_CTRL2_REG;                     /*!< (@ 0x50001B42) Fuel Gauge Control register 2                          */
  __IO uint16_t  SOC_CTRL3_REG;                     /*!< (@ 0x50001B44) Fuel Gauge Control register 3                          */
  __IO uint16_t  SOC_ADD2CH_REG;                    /*!< (@ 0x50001B46) Fuel Gauge manually add extra charge to SOC_CHARGE_CNTRx_RE
                                                         G                                                                     */
  __IO uint16_t  SOC_CHARGE_CNTR1_REG;              /*!< (@ 0x50001B48) Fuel Gauge Charge counter bits 15-0                    */
  __IO uint16_t  SOC_CHARGE_CNTR2_REG;              /*!< (@ 0x50001B4A) Fuel Gauge Charge counter bits 31-16                   */
  __IO uint16_t  SOC_CHARGE_CNTR3_REG;              /*!< (@ 0x50001B4C) Fuel Gauge Charge counter bits 39-32                   */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  SOC_CHARGE_AVG_REG;                /*!< (@ 0x50001B50) Fuel Gauge Average charge counter                      */
  __IO uint16_t  SOC_STATUS_REG;                    /*!< (@ 0x50001B52) Fuel Gauge Status register                             */
  __IO uint16_t  SOC_EXT_IN_REG;                    /*!< (@ 0x50001B54) Fuel Gauge input test register                         */
  __IO uint16_t  SOC_EXT_OUT_REG;                   /*!< (@ 0x50001B56) Fuel Gauge output test register                        */
  __I  uint32_t  RESERVED4[2];
  __IO uint16_t  CLK_REF_SEL_REG;                   /*!< (@ 0x50001B60) Select clock for oscillator calibration                */
  __IO uint16_t  CLK_REF_CNT_REG;                   /*!< (@ 0x50001B62) Count value for oscillator calibration                 */
  __IO uint16_t  CLK_REF_VAL_L_REG;                 /*!< (@ 0x50001B64) DIVN reference cycles, lower 16 bits                   */
  __IO uint16_t  CLK_REF_VAL_H_REG;                 /*!< (@ 0x50001B66) DIVN reference cycles, upper 16 bits                   */
} ANAMISC_Type;


/* ================================================================================ */
/* ================                       APU                      ================ */
/* ================================================================================ */


/**
  * @brief APU registers (APU)
  */

typedef struct {                                    /*!< (@ 0x50004000) APU Structure                                          */
  __IO uint32_t  SRC1_CTRL_REG;                     /*!< (@ 0x50004000) SRC1 control register                                  */
  __IO uint32_t  SRC1_IN_FS_REG;                    /*!< (@ 0x50004004) SRC1 Sample input rate                                 */
  __IO uint32_t  SRC1_OUT_FS_REG;                   /*!< (@ 0x50004008) SRC1 Sample output rate                                */
  __IO uint32_t  SRC1_IN1_REG;                      /*!< (@ 0x5000400C) SRC1 data in 1                                         */
  __IO uint32_t  SRC1_IN2_REG;                      /*!< (@ 0x50004010) SRC1 data in 2                                         */
  __IO uint32_t  SRC1_OUT1_REG;                     /*!< (@ 0x50004014) SRC1 data out 1                                        */
  __IO uint32_t  SRC1_OUT2_REG;                     /*!< (@ 0x50004018) SRC1 data out 2                                        */
  __IO uint32_t  APU_MUX_REG;                       /*!< (@ 0x5000401C) APU mux register                                       */
  __IO uint32_t  COEF10_SET1_REG;                   /*!< (@ 0x50004020) SRC coefficient 1,0 set 1                              */
  __IO uint32_t  COEF32_SET1_REG;                   /*!< (@ 0x50004024) SRC coefficient 3,2 set 1                              */
  __IO uint32_t  COEF54_SET1_REG;                   /*!< (@ 0x50004028) SRC coefficient 5,4 set 1                              */
  __IO uint32_t  COEF76_SET1_REG;                   /*!< (@ 0x5000402C) SRC coefficient 7,6 set 1                              */
  __IO uint32_t  COEF98_SET1_REG;                   /*!< (@ 0x50004030) SRC coefficient 9,8 set 1                              */
  __IO uint32_t  COEF0A_SET1_REG;                   /*!< (@ 0x50004034) SRC coefficient 10 set 1                               */
  __I  uint32_t  RESERVED[50];
  __IO uint32_t  PCM1_CTRL_REG;                     /*!< (@ 0x50004100) PCM1 Control register                                  */
  __IO uint32_t  PCM1_IN1_REG;                      /*!< (@ 0x50004104) PCM1 data in 1                                         */
  __IO uint32_t  PCM1_IN2_REG;                      /*!< (@ 0x50004108) PCM1 data in 2                                         */
  __IO uint32_t  PCM1_OUT1_REG;                     /*!< (@ 0x5000410C) PCM1 data out 1                                        */
  __IO uint32_t  PCM1_OUT2_REG;                     /*!< (@ 0x50004110) PCM1 data out 2                                        */
} APU_Type;


/* ================================================================================ */
/* ================                       BLE                      ================ */
/* ================================================================================ */


/**
  * @brief BLE registers (BLE)
  */

