openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
typedef struct {                                    /*!< (@ 0x40000000) BLE Structure                                          */
  __IO uint32_t  BLE_RWBLECNTL_REG;                 /*!< (@ 0x40000000) BLE Control register                                   */
  __IO uint32_t  BLE_VERSION_REG;                   /*!< (@ 0x40000004) Version register                                       */
  __IO uint32_t  BLE_RWBLECONF_REG;                 /*!< (@ 0x40000008) Configuration register                                 */
  __IO uint32_t  BLE_INTCNTL_REG;                   /*!< (@ 0x4000000C) Interrupt controller register                          */
  __IO uint32_t  BLE_INTSTAT_REG;                   /*!< (@ 0x40000010) Interrupt status register                              */
  __IO uint32_t  BLE_INTRAWSTAT_REG;                /*!< (@ 0x40000014) Interrupt raw status register                          */
  __IO uint32_t  BLE_INTACK_REG;                    /*!< (@ 0x40000018) Interrupt acknowledge register                         */
  __IO uint32_t  BLE_BASETIMECNT_REG;               /*!< (@ 0x4000001C) Base time reference counter                            */
  __IO uint32_t  BLE_FINETIMECNT_REG;               /*!< (@ 0x40000020) Fine time reference counter                            */
  __IO uint32_t  BLE_BDADDRL_REG;                   /*!< (@ 0x40000024) BLE device address LSB register                        */
  __IO uint32_t  BLE_BDADDRU_REG;                   /*!< (@ 0x40000028) BLE device address MSB register                        */
  __IO uint32_t  BLE_CURRENTRXDESCPTR_REG;          /*!< (@ 0x4000002C) Rx Descriptor Pointer for the Receive Buffer
                                                         Chained List                                                          */
  __IO uint32_t  BLE_DEEPSLCNTL_REG;                /*!< (@ 0x40000030) Deep-Sleep control register                            */
  __IO uint32_t  BLE_DEEPSLWKUP_REG;                /*!< (@ 0x40000034) Time (measured in Low Power clock cycles) in
                                                         Deep Sleep Mode before waking-up the device                           */
  __IO uint32_t  BLE_DEEPSLSTAT_REG;                /*!< (@ 0x40000038) Duration of the last deep sleep phase register         */
  __IO uint32_t  BLE_ENBPRESET_REG;                 /*!< (@ 0x4000003C) Time in low power oscillator cycles register           */
  __IO uint32_t  BLE_FINECNTCORR_REG;               /*!< (@ 0x40000040) Phase correction value register                        */
  __IO uint32_t  BLE_BASETIMECNTCORR_REG;           /*!< (@ 0x40000044) Base Time Counter                                      */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  BLE_DIAGCNTL_REG;                  /*!< (@ 0x40000050) Diagnostics Register                                   */
  __IO uint32_t  BLE_DIAGSTAT_REG;                  /*!< (@ 0x40000054) Debug use only                                         */
  __IO uint32_t  BLE_DEBUGADDMAX_REG;               /*!< (@ 0x40000058) Upper limit for the memory zone                        */
  __IO uint32_t  BLE_DEBUGADDMIN_REG;               /*!< (@ 0x4000005C) Lower limit for the memory zone                        */
  __IO uint32_t  BLE_ERRORTYPESTAT_REG;             /*!< (@ 0x40000060) Error Type Status registers                            */
  __IO uint32_t  BLE_SWPROFILING_REG;               /*!< (@ 0x40000064) Software Profiling register                            */
  __I  uint32_t  RESERVED1[2];
  __IO uint32_t  BLE_RADIOCNTL0_REG;                /*!< (@ 0x40000070) Radio interface control register                       */
  __IO uint32_t  BLE_RADIOCNTL1_REG;                /*!< (@ 0x40000074) Radio interface control register                       */
  __IO uint32_t  BLE_RADIOCNTL2_REG;                /*!< (@ 0x40000078) Radio interface control register                       */
  __IO uint32_t  BLE_RADIOCNTL3_REG;                /*!< (@ 0x4000007C) Radio interface control register                       */
  __IO uint32_t  BLE_RADIOPWRUPDN_REG;              /*!< (@ 0x40000080) RX/TX power up/down phase register                     */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  BLE_ADVCHMAP_REG;                  /*!< (@ 0x40000090) Advertising Channel Map                                */
  __I  uint32_t  RESERVED3[3];
  __IO uint32_t  BLE_ADVTIM_REG;                    /*!< (@ 0x400000A0) Advertising Packet Interval                            */
  __IO uint32_t  BLE_ACTSCANSTAT_REG;               /*!< (@ 0x400000A4) Active scan register                                   */
  __I  uint32_t  RESERVED4[2];
  __IO uint32_t  BLE_WLPUBADDPTR_REG;               /*!< (@ 0x400000B0) Start address of public devices list                   */
  __IO uint32_t  BLE_WLPRIVADDPTR_REG;              /*!< (@ 0x400000B4) Start address of private devices list                  */
  __IO uint32_t  BLE_WLNBDEV_REG;                   /*!< (@ 0x400000B8) Devices in white list                                  */
  __I  uint32_t  RESERVED5;
  __IO uint32_t  BLE_AESCNTL_REG;                   /*!< (@ 0x400000C0) Start AES register                                     */
  __IO uint32_t  BLE_AESKEY31_0_REG;                /*!< (@ 0x400000C4) AES encryption key                                     */
  __IO uint32_t  BLE_AESKEY63_32_REG;               /*!< (@ 0x400000C8) AES encryption key                                     */
  __IO uint32_t  BLE_AESKEY95_64_REG;               /*!< (@ 0x400000CC) AES encryption key                                     */
  __IO uint32_t  BLE_AESKEY127_96_REG;              /*!< (@ 0x400000D0) AES encryption key                                     */
  __IO uint32_t  BLE_AESPTR_REG;                    /*!< (@ 0x400000D4) Pointer to the block to encrypt/decrypt                */
  __IO uint32_t  BLE_TXMICVAL_REG;                  /*!< (@ 0x400000D8) AES / CCM plain MIC value                              */
  __IO uint32_t  BLE_RXMICVAL_REG;                  /*!< (@ 0x400000DC) AES / CCM plain MIC value                              */
  __IO uint32_t  BLE_RFTESTCNTL_REG;                /*!< (@ 0x400000E0) RF Testing Register                                    */
  __IO uint32_t  BLE_RFTESTTXSTAT_REG;              /*!< (@ 0x400000E4) RF Testing Register                                    */
  __IO uint32_t  BLE_RFTESTRXSTAT_REG;              /*!< (@ 0x400000E8) RF Testing Register                                    */
  __I  uint32_t  RESERVED6;
  __IO uint32_t  BLE_TIMGENCNTL_REG;                /*!< (@ 0x400000F0) Timing Generator Register                              */
  __IO uint32_t  BLE_GROSSTIMTGT_REG;               /*!< (@ 0x400000F4) Gross Timer Target value                               */
  __IO uint32_t  BLE_FINETIMTGT_REG;                /*!< (@ 0x400000F8) Fine Timer Target value                                */
  __IO uint32_t  BLE_SAMPLECLK_REG;                 /*!< (@ 0x400000FC) Samples the Base Time Counter                          */
  __IO uint32_t  BLE_COEXIFCNTL0_REG;               /*!< (@ 0x40000100) Coexistence interface Control 0 Register               */
  __IO uint32_t  BLE_COEXIFCNTL1_REG;               /*!< (@ 0x40000104) Coexistence interface Control 1 Register               */
  __IO uint32_t  BLE_BLEMPRIO0_REG;                 /*!< (@ 0x40000108) Coexistence interface Priority 0 Register              */
  __IO uint32_t  BLE_BLEMPRIO1_REG;                 /*!< (@ 0x4000010C) Coexistence interface Priority 1 Register              */
  __I  uint32_t  RESERVED7[60];
  __IO uint32_t  BLE_CNTL2_REG;                     /*!< (@ 0x40000200) BLE Control Register 2                                 */
  __I  uint32_t  RESERVED8;
  __IO uint32_t  BLE_EM_BASE_REG;                   /*!< (@ 0x40000208) Exchange Memory Base Register                          */
  __IO uint32_t  BLE_DIAGCNTL2_REG;                 /*!< (@ 0x4000020C) Debug use only                                         */
  __IO uint32_t  BLE_DIAGCNTL3_REG;                 /*!< (@ 0x40000210) Debug use only                                         */
} BLE_Type;


/* ================================================================================ */
/* ================                      CACHE                     ================ */
/* ================================================================================ */


/**
  * @brief CACHE registers (CACHE)
  */

typedef struct {                                    /*!< (@ 0x400C3000) CACHE Structure                                        */
  __IO uint32_t  CACHE_CTRL1_REG;                   /*!< (@ 0x400C3000) Cache control register 1                               */
  __IO uint32_t  CACHE_LNSIZECFG_REG;               /*!< (@ 0x400C3004) Cache line size configuration register                 */
  __IO uint32_t  CACHE_ASSOCCFG_REG;                /*!< (@ 0x400C3008) Cache associativity configuration register             */
  __I  uint32_t  RESERVED[5];
  __IO uint32_t  CACHE_CTRL2_REG;                   /*!< (@ 0x400C3020) Cache control register 2                               */
  __IO uint32_t  CACHE_CTRL3_REG;                   /*!< (@ 0x400C3024) Cache control register 3 (for the Cache Controller
                                                         configuration reset values)                                           */
  __IO uint32_t  CACHE_MRM_HITS_REG;                /*!< (@ 0x400C3028) Cache MRM (Miss Rate Monitor) HITS register            */
  __IO uint32_t  CACHE_MRM_MISSES_REG;              /*!< (@ 0x400C302C) Cache MRM (Miss Rate Monitor) MISSES register          */
  __IO uint32_t  CACHE_MRM_CTRL_REG;                /*!< (@ 0x400C3030) Cache MRM (Miss Rate Monitor) CONTROL register         */
  __IO uint32_t  CACHE_MRM_TINT_REG;                /*!< (@ 0x400C3034) Cache MRM (Miss Rate Monitor) TIME INTERVAL register   */
  __IO uint32_t  CACHE_MRM_THRES_REG;               /*!< (@ 0x400C3038) Cache MRM (Miss Rate Monitor) THRESHOLD register       */
  __I  uint32_t  RESERVED1[5];
  __IO uint32_t  SWD_RESET_REG;                     /*!< (@ 0x400C3050) SWD HW reset control register                          */
} CACHE_Type;


/* ================================================================================ */
/* ================                  CHIP_VERSION                  ================ */
/* ================================================================================ */


/**
  * @brief CHIP_VERSION registers (CHIP_VERSION)
  */

