openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
typedef struct {                                    /*!< (@ 0x50001700) IR Structure                                           */
  __IO uint16_t  IR_FREQ_CARRIER_ON_REG;            /*!< (@ 0x50001700) Defines the carrier signal high duration               */
  __IO uint16_t  IR_FREQ_CARRIER_OFF_REG;           /*!< (@ 0x50001702) Defnes the carrier signal low duration                 */
  __IO uint16_t  IR_LOGIC_ONE_TIME_REG;             /*!< (@ 0x50001704) Defines the logic one waveform                         */
  __IO uint16_t  IR_LOGIC_ZERO_TIME_REG;            /*!< (@ 0x50001706) Defines the logic zero wavefrom                        */
  __IO uint16_t  IR_CTRL_REG;                       /*!< (@ 0x50001708) IR control register                                    */
  __IO uint16_t  IR_STATUS_REG;                     /*!< (@ 0x5000170A) IR status register                                     */
  __IO uint16_t  IR_REPEAT_TIME_REG;                /*!< (@ 0x5000170C) Defines the repeat time                                */
  __IO uint16_t  IR_MAIN_FIFO_REG;                  /*!< (@ 0x5000170E) Main fifo write register                               */
  __IO uint16_t  IR_REPEAT_FIFO_REG;                /*!< (@ 0x50001710) Repeat fifo write register                             */
  __IO uint16_t  IR_IRQ_STATUS_REG;                 /*!< (@ 0x50001712) IR interrupt status register                           */
} IR_Type;


/* ================================================================================ */
/* ================                     KBSCAN                     ================ */
/* ================================================================================ */


/**
  * @brief KBSCAN registers (KBSCAN)
  */

typedef struct {                                    /*!< (@ 0x50001600) KBSCAN Structure                                       */
  __IO uint16_t  KBSCN_CTRL_REG;                    /*!< (@ 0x50001600) Keyboard scanner control register                      */
  __IO uint16_t  KBSCN_CTRL2_REG;                   /*!< (@ 0x50001602) Keyboard scanner control 2 register                    */
  __IO uint16_t  KBSCN_MATRIX_SIZE_REG;             /*!< (@ 0x50001604) Defines the number of rows and columns of the
                                                         matrix                                                                */
  __IO uint16_t  KBSCN_DEBOUNCE_REG;                /*!< (@ 0x50001606) Defines the debounce time for key press and release    */
  __IO uint16_t  KBSCN_STATUS_REG;                  /*!< (@ 0x50001608) keyboard scanner Interrupt status register             */
  __IO uint16_t  KBSCN_MESSAGE_KEY_REG;             /*!< (@ 0x5000160A) Returns a key message from the message queue           */
  __IO uint16_t  KBSCN_P00_MODE_REG;                /*!< (@ 0x5000160C) Defines the keyboard mode for P00                      */
  __IO uint16_t  KBSCN_P01_MODE_REG;                /*!< (@ 0x5000160E) Defines the keyboard mode for P01                      */
  __IO uint16_t  KBSCN_P02_MODE_REG;                /*!< (@ 0x50001610) Defines the keyboard mode for P02                      */
  __IO uint16_t  KBSCN_P03_MODE_REG;                /*!< (@ 0x50001612) Defines the keyboard mode for P03                      */
  __IO uint16_t  KBSCN_P04_MODE_REG;                /*!< (@ 0x50001614) Defines the keyboard mode for P04                      */
  __IO uint16_t  KBSCN_P05_MODE_REG;                /*!< (@ 0x50001616) Defines the keyboard mode for P05                      */
  __IO uint16_t  KBSCN_P06_MODE_REG;                /*!< (@ 0x50001618) Defines the keyboard mode for P06                      */
  __IO uint16_t  KBSCN_P07_MODE_REG;                /*!< (@ 0x5000161A) Defines the keyboard mode for P07                      */
  __IO uint16_t  KBSCN_P10_MODE_REG;                /*!< (@ 0x5000161C) Defines the keyboard mode for P10                      */
  __IO uint16_t  KBSCN_P11_MODE_REG;                /*!< (@ 0x5000161E) Defines the keyboard mode for P11                      */
  __IO uint16_t  KBSCN_P12_MODE_REG;                /*!< (@ 0x50001620) Defines the keyboard mode for P12                      */
  __IO uint16_t  KBSCN_P13_MODE_REG;                /*!< (@ 0x50001622) Defines the keyboard mode for P13                      */
  __IO uint16_t  KBSCN_P14_MODE_REG;                /*!< (@ 0x50001624) Defines the keyboard mode for P14                      */
  __IO uint16_t  KBSCN_P15_MODE_REG;                /*!< (@ 0x50001626) Defines the keyboard mode for P15                      */
  __IO uint16_t  KBSCN_P16_MODE_REG;                /*!< (@ 0x50001628) Defines the keyboard mode for P16                      */
  __IO uint16_t  KBSCN_P17_MODE_REG;                /*!< (@ 0x5000162A) Defines the keyboard mode for P17                      */
  __IO uint16_t  KBSCN_P20_MODE_REG;                /*!< (@ 0x5000162C) Defines the keyboard mode for P20                      */
  __IO uint16_t  KBSCN_P21_MODE_REG;                /*!< (@ 0x5000162E) Defines the keyboard mode for P21                      */
  __IO uint16_t  KBSCN_P22_MODE_REG;                /*!< (@ 0x50001630) Defines the keyboard mode for P22                      */
  __IO uint16_t  KBSCN_P23_MODE_REG;                /*!< (@ 0x50001632) Defines the keyboard mode for P23                      */
  __IO uint16_t  KBSCN_P24_MODE_REG;                /*!< (@ 0x50001634) Defines the keyboard mode for P24                      */
  __I  uint16_t  RESERVED[3];
  __IO uint16_t  KBSCN_P30_MODE_REG;                /*!< (@ 0x5000163C) Defines the keyboard mode for P30                      */
  __IO uint16_t  KBSCN_P31_MODE_REG;                /*!< (@ 0x5000163E) Defines the keyboard mode for P31                      */
  __IO uint16_t  KBSCN_P32_MODE_REG;                /*!< (@ 0x50001640) Defines the keyboard mode for P32                      */
  __IO uint16_t  KBSCN_P33_MODE_REG;                /*!< (@ 0x50001642) Defines the keyboard mode for P33                      */
  __IO uint16_t  KBSCN_P34_MODE_REG;                /*!< (@ 0x50001644) Defines the keyboard mode for P34                      */
  __IO uint16_t  KBSCN_P35_MODE_REG;                /*!< (@ 0x50001646) Defines the keyboard mode for P35                      */
  __IO uint16_t  KBSCN_P36_MODE_REG;                /*!< (@ 0x50001648) Defines the keyboard mode for P36                      */
  __IO uint16_t  KBSCN_P37_MODE_REG;                /*!< (@ 0x5000164A) Defines the keyboard mode for P37                      */
  __IO uint16_t  KBSCN_P40_MODE_REG;                /*!< (@ 0x5000164C) Defines the keyboard mode for P40                      */
  __IO uint16_t  KBSCN_P41_MODE_REG;                /*!< (@ 0x5000164E) Defines the keyboard mode for P41                      */
  __IO uint16_t  KBSCN_P42_MODE_REG;                /*!< (@ 0x50001650) Defines the keyboard mode for P42                      */
  __IO uint16_t  KBSCN_P43_MODE_REG;                /*!< (@ 0x50001652) Defines the keyboard mode for P43                      */
  __IO uint16_t  KBSCN_P44_MODE_REG;                /*!< (@ 0x50001654) Defines the keyboard mode for P44                      */
  __IO uint16_t  KBSCN_P45_MODE_REG;                /*!< (@ 0x50001656) Defines the keyboard mode for P45                      */
  __IO uint16_t  KBSCN_P46_MODE_REG;                /*!< (@ 0x50001658) Defines the keyboard mode for P46                      */
  __IO uint16_t  KBSCN_P47_MODE_REG;                /*!< (@ 0x5000165A) Defines the keyboard mode for P47                      */
} KBSCAN_Type;


/* ================================================================================ */
/* ================                      OTPC                      ================ */
/* ================================================================================ */


/**
  * @brief OTPC registers (OTPC)
  */

typedef struct {                                    /*!< (@ 0x07F40000) OTPC Structure                                         */
  __IO uint32_t  OTPC_MODE_REG;                     /*!< (@ 0x07F40000) Mode register                                          */
  __IO uint32_t  OTPC_PCTRL_REG;                    /*!< (@ 0x07F40004) Bit-programming control register                       */
  __IO uint32_t  OTPC_STAT_REG;                     /*!< (@ 0x07F40008) Status register                                        */
  __IO uint32_t  OTPC_AHBADR_REG;                   /*!< (@ 0x07F4000C) AHB master start address                               */
  __IO uint32_t  OTPC_CELADR_REG;                   /*!< (@ 0x07F40010) Macrocell start address                                */
  __IO uint32_t  OTPC_NWORDS_REG;                   /*!< (@ 0x07F40014) Number of words                                        */
  __IO uint32_t  OTPC_FFPRT_REG;                    /*!< (@ 0x07F40018) Ports access to fifo logic                             */
  __IO uint32_t  OTPC_FFRD_REG;                     /*!< (@ 0x07F4001C) The data which have taken with the latest read
                                                         from the OTPC_FFPRT_REG                                               */
  __IO uint32_t  OTPC_PWORDL_REG;                   /*!< (@ 0x07F40020) The 32 lower bits of the 64-bit word that will
                                                         be programmed, when the MPROG mode is used.                           */
  __IO uint32_t  OTPC_PWORDH_REG;                   /*!< (@ 0x07F40024) The 32 higher bits of the 64-bit word that will
                                                         be programmed, when the MPROG mode is used.                           */
  __IO uint32_t  OTPC_TIM1_REG;                     /*!< (@ 0x07F40028) Various timing parameters of the OTP cell.             */
  __IO uint32_t  OTPC_TIM2_REG;                     /*!< (@ 0x07F4002C) Various timing parameters of the OTP cell.             */
  __IO uint32_t  OTPC_TEST_REG;                     /*!< (@ 0x07F40030) OTPC_TEST_REG                                          */
} OTPC_Type;


/* ================================================================================ */
/* ================                      PATCH                     ================ */
/* ================================================================================ */


/**
  * @brief PATCH registers (PATCH)
  */

typedef struct {                                    /*!< (@ 0x40050000) PATCH Structure                                        */
  __IO uint32_t  PATCH_VALID_REG;                   /*!< (@ 0x40050000) Validity Control Register                              */
  __IO uint32_t  PATCH_VALID_SET_REG;               /*!< (@ 0x40050004) Validity Set Control Register                          */
  __IO uint32_t  PATCH_VALID_RESET_REG;             /*!< (@ 0x40050008) Validity Reset Control Register                        */
  __I  uint32_t  RESERVED[5];
  __IO uint32_t  PATCH_ADDR0_REG;                   /*!< (@ 0x40050020) Patch Address field                                    */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  PATCH_ADDR1_REG;                   /*!< (@ 0x40050028) Patch Address field                                    */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  PATCH_ADDR2_REG;                   /*!< (@ 0x40050030) Patch Address field                                    */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  PATCH_ADDR3_REG;                   /*!< (@ 0x40050038) Patch Address field                                    */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  PATCH_ADDR4_REG;                   /*!< (@ 0x40050040) Patch Address field                                    */
  __I  uint32_t  RESERVED5;
  __IO uint32_t  PATCH_ADDR5_REG;                   /*!< (@ 0x40050048) Patch Address field                                    */
  __I  uint32_t  RESERVED6;
  __IO uint32_t  PATCH_ADDR6_REG;                   /*!< (@ 0x40050050) Patch Address field                                    */
  __I  uint32_t  RESERVED7;
  __IO uint32_t  PATCH_ADDR7_REG;                   /*!< (@ 0x40050058) Patch Address field                                    */
  __I  uint32_t  RESERVED8;
  __IO uint32_t  PATCH_ADDR8_REG;                   /*!< (@ 0x40050060) Patch Address field                                    */
  __I  uint32_t  RESERVED9;
  __IO uint32_t  PATCH_ADDR9_REG;                   /*!< (@ 0x40050068) Patch Address field                                    */
  __I  uint32_t  RESERVED10;
  __IO uint32_t  PATCH_ADDR10_REG;                  /*!< (@ 0x40050070) Patch Address field                                    */
  __I  uint32_t  RESERVED11;
  __IO uint32_t  PATCH_ADDR11_REG;                  /*!< (@ 0x40050078) Patch Address field                                    */
  __I  uint32_t  RESERVED12;
  __IO uint32_t  PATCH_ADDR12_REG;                  /*!< (@ 0x40050080) Patch Address field                                    */
  __I  uint32_t  RESERVED13;
  __IO uint32_t  PATCH_ADDR13_REG;                  /*!< (@ 0x40050088) Patch Address field                                    */
  __I  uint32_t  RESERVED14;
  __IO uint32_t  PATCH_ADDR14_REG;                  /*!< (@ 0x40050090) Patch Address field                                    */
  __I  uint32_t  RESERVED15;
  __IO uint32_t  PATCH_ADDR15_REG;                  /*!< (@ 0x40050098) Patch Address field                                    */
  __I  uint32_t  RESERVED16;
  __IO uint32_t  PATCH_ADDR16_REG;                  /*!< (@ 0x400500A0) Patch Address field                                    */
  __I  uint32_t  RESERVED17;
  __IO uint32_t  PATCH_ADDR17_REG;                  /*!< (@ 0x400500A8) Patch Address field                                    */
  __I  uint32_t  RESERVED18;
  __IO uint32_t  PATCH_ADDR18_REG;                  /*!< (@ 0x400500B0) Patch Address field                                    */
  __I  uint32_t  RESERVED19;
  __IO uint32_t  PATCH_ADDR19_REG;                  /*!< (@ 0x400500B8) Patch Address field                                    */
  __I  uint32_t  RESERVED20;
  __IO uint32_t  PATCH_ADDR20_REG;                  /*!< (@ 0x400500C0) Patch Address field                                    */
  __IO uint32_t  PATCH_DATA20_REG;                  /*!< (@ 0x400500C4) Patch Data field                                       */
  __IO uint32_t  PATCH_ADDR21_REG;                  /*!< (@ 0x400500C8) Patch Address field                                    */
  __IO uint32_t  PATCH_DATA21_REG;                  /*!< (@ 0x400500CC) Patch Data field                                       */
  __IO uint32_t  PATCH_ADDR22_REG;                  /*!< (@ 0x400500D0) Patch Address field                                    */
  __IO uint32_t  PATCH_DATA22_REG;                  /*!< (@ 0x400500D4) Patch Data field                                       */
  __IO uint32_t  PATCH_ADDR23_REG;                  /*!< (@ 0x400500D8) Patch Address field                                    */
  __IO uint32_t  PATCH_DATA23_REG;                  /*!< (@ 0x400500DC) Patch Data field                                       */
  __IO uint32_t  PATCH_ADDR24_REG;                  /*!< (@ 0x400500E0) Patch Address field                                    */
  __IO uint32_t  PATCH_DATA24_REG;                  /*!< (@ 0x400500E4) Patch Data field                                       */
  __IO uint32_t  PATCH_ADDR25_REG;                  /*!< (@ 0x400500E8) Patch Address field                                    */
  __IO uint32_t  PATCH_DATA25_REG;                  /*!< (@ 0x400500EC) Patch Data field                                       */
  __IO uint32_t  PATCH_ADDR26_REG;                  /*!< (@ 0x400500F0) Patch Address field                                    */
  __IO uint32_t  PATCH_DATA26_REG;                  /*!< (@ 0x400500F4) Patch Data field                                       */
  __IO uint32_t  PATCH_ADDR27_REG;                  /*!< (@ 0x400500F8) Patch Address field                                    */
  __IO uint32_t  PATCH_DATA27_REG;                  /*!< (@ 0x400500FC) Patch Data field                                       */
} PATCH_Type;


/* ================================================================================ */
/* ================                     PLLDIG                     ================ */
/* ================================================================================ */


/**
  * @brief PLLDIG registers (PLLDIG)
  */

