openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
typedef struct {                                    /*!< (@ 0x50001800) USB Structure                                          */
  __IO uint16_t  USB_MCTRL_REG;                     /*!< (@ 0x50001800) Main Control Register)                                 */
  __IO uint16_t  USB_XCVDIAG_REG;                   /*!< (@ 0x50001802) Transceiver diagnostic Register (for test purpose
                                                         only)                                                                 */
  __IO uint16_t  USB_TCR_REG;                       /*!< (@ 0x50001804) Transceiver configuration Register                     */
  __IO uint16_t  USB_UTR_REG;                       /*!< (@ 0x50001806) USB test Register (for test purpose only)              */
  __IO uint16_t  USB_FAR_REG;                       /*!< (@ 0x50001808) Function Address Register                              */
  __IO uint16_t  USB_NFSR_REG;                      /*!< (@ 0x5000180A) Node Functional State Register                         */
  __IO uint16_t  USB_MAEV_REG;                      /*!< (@ 0x5000180C) Main Event Register                                    */
  __IO uint16_t  USB_MAMSK_REG;                     /*!< (@ 0x5000180E) Main Mask Register                                     */
  __IO uint16_t  USB_ALTEV_REG;                     /*!< (@ 0x50001810) Alternate Event Register                               */
  __IO uint16_t  USB_ALTMSK_REG;                    /*!< (@ 0x50001812) Alternate Mask Register                                */
  __IO uint16_t  USB_TXEV_REG;                      /*!< (@ 0x50001814) Transmit Event Register                                */
  __IO uint16_t  USB_TXMSK_REG;                     /*!< (@ 0x50001816) Transmit Mask Register                                 */
  __IO uint16_t  USB_RXEV_REG;                      /*!< (@ 0x50001818) Receive Event Register                                 */
  __IO uint16_t  USB_RXMSK_REG;                     /*!< (@ 0x5000181A) Receive Mask Register                                  */
  __IO uint16_t  USB_NAKEV_REG;                     /*!< (@ 0x5000181C) NAK Event Register                                     */
  __IO uint16_t  USB_NAKMSK_REG;                    /*!< (@ 0x5000181E) NAK Mask Register                                      */
  __IO uint16_t  USB_FWEV_REG;                      /*!< (@ 0x50001820) FIFO Warning Event Register                            */
  __IO uint16_t  USB_FWMSK_REG;                     /*!< (@ 0x50001822) FIFO Warning Mask Register                             */
  __IO uint16_t  USB_FNH_REG;                       /*!< (@ 0x50001824) Frame Number High Byte Register                        */
  __IO uint16_t  USB_FNL_REG;                       /*!< (@ 0x50001826) Frame Number Low Byte Register                         */
  __I  uint16_t  RESERVED[11];
  __IO uint16_t  USB_UX20CDR_REG;                   /*!< (@ 0x5000183E) Transceiver 2.0 Configuration and Diagnostics
                                                         Register(for test purpose only)                                       */
  __IO uint16_t  USB_EPC0_REG;                      /*!< (@ 0x50001840) Endpoint Control 0 Register                            */
  __IO uint16_t  USB_TXD0_REG;                      /*!< (@ 0x50001842) Transmit Data 0 Register                               */
  __IO uint16_t  USB_TXS0_REG;                      /*!< (@ 0x50001844) Transmit Status 0 Register                             */
  __IO uint16_t  USB_TXC0_REG;                      /*!< (@ 0x50001846) Transmit command 0 Register                            */
  __IO uint16_t  USB_EP0_NAK_REG;                   /*!< (@ 0x50001848) EP0 INNAK and OUTNAK Register                          */
  __IO uint16_t  USB_RXD0_REG;                      /*!< (@ 0x5000184A) Receive Data 0 Register                                */
  __IO uint16_t  USB_RXS0_REG;                      /*!< (@ 0x5000184C) Receive Status 0 Register                              */
  __IO uint16_t  USB_RXC0_REG;                      /*!< (@ 0x5000184E) Receive Command 0 Register                             */
  __IO uint16_t  USB_EPC1_REG;                      /*!< (@ 0x50001850) Endpoint Control Register 1                            */
  __IO uint16_t  USB_TXD1_REG;                      /*!< (@ 0x50001852) Transmit Data Register 1                               */
  __IO uint16_t  USB_TXS1_REG;                      /*!< (@ 0x50001854) Transmit Status Register 1                             */
  __IO uint16_t  USB_TXC1_REG;                      /*!< (@ 0x50001856) Transmit Command Register 1                            */
  __IO uint16_t  USB_EPC2_REG;                      /*!< (@ 0x50001858) Endpoint Control Register 2                            */
  __IO uint16_t  USB_RXD1_REG;                      /*!< (@ 0x5000185A) Receive Data Register,1                                */
  __IO uint16_t  USB_RXS1_REG;                      /*!< (@ 0x5000185C) Receive Status Register 1                              */
  __IO uint16_t  USB_RXC1_REG;                      /*!< (@ 0x5000185E) Receive Command Register 1                             */
  __IO uint16_t  USB_EPC3_REG;                      /*!< (@ 0x50001860) Endpoint Control Register 3                            */
  __IO uint16_t  USB_TXD2_REG;                      /*!< (@ 0x50001862) Transmit Data Register 2                               */
  __IO uint16_t  USB_TXS2_REG;                      /*!< (@ 0x50001864) Transmit Status Register 2                             */
  __IO uint16_t  USB_TXC2_REG;                      /*!< (@ 0x50001866) Transmit Command Register 2                            */
  __IO uint16_t  USB_EPC4_REG;                      /*!< (@ 0x50001868) Endpoint Control Register 4                            */
  __IO uint16_t  USB_RXD2_REG;                      /*!< (@ 0x5000186A) Receive Data Register 2                                */
  __IO uint16_t  USB_RXS2_REG;                      /*!< (@ 0x5000186C) Receive Status Register 2                              */
  __IO uint16_t  USB_RXC2_REG;                      /*!< (@ 0x5000186E) Receive Command Register 2                             */
  __IO uint16_t  USB_EPC5_REG;                      /*!< (@ 0x50001870) Endpoint Control Register 5                            */
  __IO uint16_t  USB_TXD3_REG;                      /*!< (@ 0x50001872) Transmit Data Register 3                               */
  __IO uint16_t  USB_TXS3_REG;                      /*!< (@ 0x50001874) Transmit Status Register 3                             */
  __IO uint16_t  USB_TXC3_REG;                      /*!< (@ 0x50001876) Transmit Command Register 3                            */
  __IO uint16_t  USB_EPC6_REG;                      /*!< (@ 0x50001878) Endpoint Control Register 6                            */
  __IO uint16_t  USB_RXD3_REG;                      /*!< (@ 0x5000187A) Receive Data Register 3                                */
  __IO uint16_t  USB_RXS3_REG;                      /*!< (@ 0x5000187C) Receive Status Register 3                              */
  __IO uint16_t  USB_RXC3_REG;                      /*!< (@ 0x5000187E) Receive Command Register 3                             */
  __I  uint32_t  RESERVED1[20];
  __IO uint16_t  USB_DMA_CTRL_REG;                  /*!< (@ 0x500018D0) USB DMA control register                               */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  USB_CHARGER_CTRL_REG;              /*!< (@ 0x500018D4) USB Charger Control Register                           */
  __IO uint16_t  USB_CHARGER_STAT_REG;              /*!< (@ 0x500018D6) USB Charger Status Register                            */
} USB_Type;


/* ================================================================================ */
/* ================                     WAKEUP                     ================ */
/* ================================================================================ */


/**
  * @brief WAKEUP registers (WAKEUP)
  */

typedef struct {                                    /*!< (@ 0x50000100) WAKEUP Structure                                       */
  __IO uint16_t  WKUP_CTRL_REG;                     /*!< (@ 0x50000100) Control register for the wakeup counter                */
  __I  uint16_t  RESERVED;
  __IO uint16_t  WKUP_RESET_IRQ_REG;                /*!< (@ 0x50000104) Reset wakeup interrupt                                 */
  __I  uint16_t  RESERVED1[2];
  __IO uint16_t  WKUP_SELECT_P0_REG;                /*!< (@ 0x5000010A) select which inputs from P0 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_SELECT_P1_REG;                /*!< (@ 0x5000010C) select which inputs from P1 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_SELECT_P2_REG;                /*!< (@ 0x5000010E) select which inputs from P2 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_SELECT_P3_REG;                /*!< (@ 0x50000110) select which inputs from P3 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_SELECT_P4_REG;                /*!< (@ 0x50000112) select which inputs from P3 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_POL_P0_REG;                   /*!< (@ 0x50000114) select the sesitivity polarity for each P0 input       */
  __IO uint16_t  WKUP_POL_P1_REG;                   /*!< (@ 0x50000116) select the sesitivity polarity for each P1 input       */
  __IO uint16_t  WKUP_POL_P2_REG;                   /*!< (@ 0x50000118) select the sesitivity polarity for each P2 input       */
  __IO uint16_t  WKUP_POL_P3_REG;                   /*!< (@ 0x5000011A) select the sesitivity polarity for each P3 input       */
  __IO uint16_t  WKUP_POL_P4_REG;                   /*!< (@ 0x5000011C) select the sesitivity polarity for each P3 input       */
  __IO uint16_t  WKUP_STATUS_0_REG;                 /*!< (@ 0x5000011E) Event status register for P0 and P1                    */
  __IO uint16_t  WKUP_STATUS_1_REG;                 /*!< (@ 0x50000120) Event status register for P2                           */
  __IO uint16_t  WKUP_STATUS_2_REG;                 /*!< (@ 0x50000122) Event status register for P3 and P4                    */
  __IO uint16_t  WKUP_CLEAR_0_REG;                  /*!< (@ 0x50000124) Clear event register for P0 and P1                     */
  __IO uint16_t  WKUP_CLEAR_1_REG;                  /*!< (@ 0x50000126) Clear event register for P2                            */
  __IO uint16_t  WKUP_CLEAR_2_REG;                  /*!< (@ 0x50000128) Clear event register for P3 and P4                     */
  __IO uint16_t  WKUP_SEL_GPIO_P0_REG;              /*!< (@ 0x5000012A) select which inputs from P0 port can trigger
                                                         interrupt                                                             */
  __IO uint16_t  WKUP_SEL_GPIO_P1_REG;              /*!< (@ 0x5000012C) select which inputs from P1 port can trigger
                                                         interrupt                                                             */
  __IO uint16_t  WKUP_SEL_GPIO_P2_REG;              /*!< (@ 0x5000012E) select which inputs from P2 port can trigger
                                                         interrupt                                                             */
  __IO uint16_t  WKUP_SEL_GPIO_P3_REG;              /*!< (@ 0x50000130) select which inputs from P3 port can trigger
                                                         interrupt                                                             */
  __IO uint16_t  WKUP_SEL_GPIO_P4_REG;              /*!< (@ 0x50000132) select which inputs from P3 port can trigger
                                                         interrupt                                                             */
} WAKEUP_Type;


/* ================================================================================ */
/* ================                      WDOG                      ================ */
/* ================================================================================ */


/**
  * @brief WDOG registers (WDOG)
  */

typedef struct {                                    /*!< (@ 0x50003100) WDOG Structure                                         */
  __IO uint16_t  WATCHDOG_REG;                      /*!< (@ 0x50003100) Watchdog timer register.                               */
  __IO uint16_t  WATCHDOG_CTRL_REG;                 /*!< (@ 0x50003102) Watchdog control register.                             */
} WDOG_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================          struct 'NVIC' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  NVIC_ISER  --------------------------------- */
#define NVIC_ISER_BLE_WAKEUP_LP_IRQn_Pos      (0UL)                     /*!< NVIC ISER: BLE_WAKEUP_LP_IRQn (Bit 0)                       */
#define NVIC_ISER_BLE_WAKEUP_LP_IRQn_Msk      (0x1UL)                   /*!< NVIC ISER: BLE_WAKEUP_LP_IRQn (Bitfield-Mask: 0x01)         */
#define NVIC_ISER_BLE_GEN_IRQn_Pos            (1UL)                     /*!< NVIC ISER: BLE_GEN_IRQn (Bit 1)                             */
#define NVIC_ISER_BLE_GEN_IRQn_Msk            (0x2UL)                   /*!< NVIC ISER: BLE_GEN_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ISER_FTDF_WAKEUP_IRQn_Pos        (2UL)                     /*!< NVIC ISER: FTDF_WAKEUP_IRQn (Bit 2)                         */
#define NVIC_ISER_FTDF_WAKEUP_IRQn_Msk        (0x4UL)                   /*!< NVIC ISER: FTDF_WAKEUP_IRQn (Bitfield-Mask: 0x01)           */
#define NVIC_ISER_FTDF_GEN_IRQn_Pos           (3UL)                     /*!< NVIC ISER: FTDF_GEN_IRQn (Bit 3)                            */
#define NVIC_ISER_FTDF_GEN_IRQn_Msk           (0x8UL)                   /*!< NVIC ISER: FTDF_GEN_IRQn (Bitfield-Mask: 0x01)              */
#define NVIC_ISER_RFCAL_IRQn_Pos              (4UL)                     /*!< NVIC ISER: RFCAL_IRQn (Bit 4)                               */
#define NVIC_ISER_RFCAL_IRQn_Msk              (0x10UL)                  /*!< NVIC ISER: RFCAL_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ISER_COEX_IRQn_Pos               (5UL)                     /*!< NVIC ISER: COEX_IRQn (Bit 5)                                */
#define NVIC_ISER_COEX_IRQn_Msk               (0x20UL)                  /*!< NVIC ISER: COEX_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_CRYPTO_IRQn_Pos             (6UL)                     /*!< NVIC ISER: CRYPTO_IRQn (Bit 6)                              */
#define NVIC_ISER_CRYPTO_IRQn_Msk             (0x40UL)                  /*!< NVIC ISER: CRYPTO_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_MRM_IRQn_Pos                (7UL)                     /*!< NVIC ISER: MRM_IRQn (Bit 7)                                 */
#define NVIC_ISER_MRM_IRQn_Msk                (0x80UL)                  /*!< NVIC ISER: MRM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_UART_IRQn_Pos               (8UL)                     /*!< NVIC ISER: UART_IRQn (Bit 8)                                */
#define NVIC_ISER_UART_IRQn_Msk               (0x100UL)                 /*!< NVIC ISER: UART_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_UART2_IRQn_Pos              (9UL)                     /*!< NVIC ISER: UART2_IRQn (Bit 9)                               */
#define NVIC_ISER_UART2_IRQn_Msk              (0x200UL)                 /*!< NVIC ISER: UART2_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ISER_I2C_IRQn_Pos                (10UL)                    /*!< NVIC ISER: I2C_IRQn (Bit 10)                                */
#define NVIC_ISER_I2C_IRQn_Msk                (0x400UL)                 /*!< NVIC ISER: I2C_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_I2C2_IRQn_Pos               (11UL)                    /*!< NVIC ISER: I2C2_IRQn (Bit 11)                               */
#define NVIC_ISER_I2C2_IRQn_Msk               (0x800UL)                 /*!< NVIC ISER: I2C2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_SPI_IRQn_Pos                (12UL)                    /*!< NVIC ISER: SPI_IRQn (Bit 12)                                */
#define NVIC_ISER_SPI_IRQn_Msk                (0x1000UL)                /*!< NVIC ISER: SPI_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_SPI2_IRQn_Pos               (13UL)                    /*!< NVIC ISER: SPI2_IRQn (Bit 13)                               */
#define NVIC_ISER_SPI2_IRQn_Msk               (0x2000UL)                /*!< NVIC ISER: SPI2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_ADC_IRQn_Pos                (14UL)                    /*!< NVIC ISER: ADC_IRQn (Bit 14)                                */
#define NVIC_ISER_ADC_IRQn_Msk                (0x4000UL)                /*!< NVIC ISER: ADC_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_KEYBRD_IRQn_Pos             (15UL)                    /*!< NVIC ISER: KEYBRD_IRQn (Bit 15)                             */
#define NVIC_ISER_KEYBRD_IRQn_Msk             (0x8000UL)                /*!< NVIC ISER: KEYBRD_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_IRGEN_IRQn_Pos              (16UL)                    /*!< NVIC ISER: IRGEN_IRQn (Bit 16)                              */
#define NVIC_ISER_IRGEN_IRQn_Msk              (0x10000UL)               /*!< NVIC ISER: IRGEN_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ISER_WKUP_GPIO_IRQn_Pos          (17UL)                    /*!< NVIC ISER: WKUP_GPIO_IRQn (Bit 17)                          */
#define NVIC_ISER_WKUP_GPIO_IRQn_Msk          (0x20000UL)               /*!< NVIC ISER: WKUP_GPIO_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ISER_SWTIM0_IRQn_Pos             (18UL)                    /*!< NVIC ISER: SWTIM0_IRQn (Bit 18)                             */
#define NVIC_ISER_SWTIM0_IRQn_Msk             (0x40000UL)               /*!< NVIC ISER: SWTIM0_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_SWTIM1_IRQn_Pos             (19UL)                    /*!< NVIC ISER: SWTIM1_IRQn (Bit 19)                             */
#define NVIC_ISER_SWTIM1_IRQn_Msk             (0x80000UL)               /*!< NVIC ISER: SWTIM1_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_QUADEC_IRQn_Pos             (20UL)                    /*!< NVIC ISER: QUADEC_IRQn (Bit 20)                             */
#define NVIC_ISER_QUADEC_IRQn_Msk             (0x100000UL)              /*!< NVIC ISER: QUADEC_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_USB_IRQn_Pos                (21UL)                    /*!< NVIC ISER: USB_IRQn (Bit 21)                                */
#define NVIC_ISER_USB_IRQn_Msk                (0x200000UL)              /*!< NVIC ISER: USB_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_PCM_IRQn_Pos                (22UL)                    /*!< NVIC ISER: PCM_IRQn (Bit 22)                                */
#define NVIC_ISER_PCM_IRQn_Msk                (0x400000UL)              /*!< NVIC ISER: PCM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_SRC_IN_IRQn_Pos             (23UL)                    /*!< NVIC ISER: SRC_IN_IRQn (Bit 23)                             */
#define NVIC_ISER_SRC_IN_IRQn_Msk             (0x800000UL)              /*!< NVIC ISER: SRC_IN_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_SRC_OUT_IRQn_Pos            (24UL)                    /*!< NVIC ISER: SRC_OUT_IRQn (Bit 24)                            */
#define NVIC_ISER_SRC_OUT_IRQn_Msk            (0x1000000UL)             /*!< NVIC ISER: SRC_OUT_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ISER_VBUS_IRQn_Pos               (25UL)                    /*!< NVIC ISER: VBUS_IRQn (Bit 25)                               */
#define NVIC_ISER_VBUS_IRQn_Msk               (0x2000000UL)             /*!< NVIC ISER: VBUS_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_DMA_IRQn_Pos                (26UL)                    /*!< NVIC ISER: DMA_IRQn (Bit 26)                                */
#define NVIC_ISER_DMA_IRQn_Msk                (0x4000000UL)             /*!< NVIC ISER: DMA_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_RF_DIAG_IRQn_Pos            (27UL)                    /*!< NVIC ISER: RF_DIAG_IRQn (Bit 27)                            */
#define NVIC_ISER_RF_DIAG_IRQn_Msk            (0x8000000UL)             /*!< NVIC ISER: RF_DIAG_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ISER_TRNG_IRQn_Pos               (28UL)                    /*!< NVIC ISER: TRNG_IRQn (Bit 28)                               */
#define NVIC_ISER_TRNG_IRQn_Msk               (0x10000000UL)            /*!< NVIC ISER: TRNG_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_DCDC_IRQn_Pos               (29UL)                    /*!< NVIC ISER: DCDC_IRQn (Bit 29)                               */
#define NVIC_ISER_DCDC_IRQn_Msk               (0x20000000UL)            /*!< NVIC ISER: DCDC_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_XTAL16RDY_IRQn_Pos          (30UL)                    /*!< NVIC ISER: XTAL16RDY_IRQn (Bit 30)                          */
#define NVIC_ISER_XTAL16RDY_IRQn_Msk          (0x40000000UL)            /*!< NVIC ISER: XTAL16RDY_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ISER_Rsvd__irq__n_Pos            (31UL)                    /*!< NVIC ISER: Rsvd__irq__n (Bit 31)                            */
#define NVIC_ISER_Rsvd__irq__n_Msk            (0x80000000UL)            /*!< NVIC ISER: Rsvd__irq__n (Bitfield-Mask: 0x01)               */

