openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* ---------------------------  BLE_BLE_INTRAWSTAT_REG  --------------------------- */
#define BLE_BLE_INTRAWSTAT_REG_CSCNTINTRAWSTAT_Pos (0UL)                /*!< BLE BLE_INTRAWSTAT_REG: CSCNTINTRAWSTAT (Bit 0)             */
#define BLE_BLE_INTRAWSTAT_REG_CSCNTINTRAWSTAT_Msk (0x1UL)              /*!< BLE BLE_INTRAWSTAT_REG: CSCNTINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_RXINTRAWSTAT_Pos (1UL)                   /*!< BLE BLE_INTRAWSTAT_REG: RXINTRAWSTAT (Bit 1)                */
#define BLE_BLE_INTRAWSTAT_REG_RXINTRAWSTAT_Msk (0x2UL)                 /*!< BLE BLE_INTRAWSTAT_REG: RXINTRAWSTAT (Bitfield-Mask: 0x01)  */
#define BLE_BLE_INTRAWSTAT_REG_SLPINTRAWSTAT_Pos (2UL)                  /*!< BLE BLE_INTRAWSTAT_REG: SLPINTRAWSTAT (Bit 2)               */
#define BLE_BLE_INTRAWSTAT_REG_SLPINTRAWSTAT_Msk (0x4UL)                /*!< BLE BLE_INTRAWSTAT_REG: SLPINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_EVENTINTRAWSTAT_Pos (3UL)                /*!< BLE BLE_INTRAWSTAT_REG: EVENTINTRAWSTAT (Bit 3)             */
#define BLE_BLE_INTRAWSTAT_REG_EVENTINTRAWSTAT_Msk (0x8UL)              /*!< BLE BLE_INTRAWSTAT_REG: EVENTINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_CRYPTINTRAWSTAT_Pos (4UL)                /*!< BLE BLE_INTRAWSTAT_REG: CRYPTINTRAWSTAT (Bit 4)             */
#define BLE_BLE_INTRAWSTAT_REG_CRYPTINTRAWSTAT_Msk (0x10UL)             /*!< BLE BLE_INTRAWSTAT_REG: CRYPTINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_ERRORINTRAWSTAT_Pos (5UL)                /*!< BLE BLE_INTRAWSTAT_REG: ERRORINTRAWSTAT (Bit 5)             */
#define BLE_BLE_INTRAWSTAT_REG_ERRORINTRAWSTAT_Msk (0x20UL)             /*!< BLE BLE_INTRAWSTAT_REG: ERRORINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_GROSSTGTIMINTRAWSTAT_Pos (6UL)           /*!< BLE BLE_INTRAWSTAT_REG: GROSSTGTIMINTRAWSTAT (Bit 6)        */
#define BLE_BLE_INTRAWSTAT_REG_GROSSTGTIMINTRAWSTAT_Msk (0x40UL)        /*!< BLE BLE_INTRAWSTAT_REG: GROSSTGTIMINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_FINETGTIMINTRAWSTAT_Pos (7UL)            /*!< BLE BLE_INTRAWSTAT_REG: FINETGTIMINTRAWSTAT (Bit 7)         */
#define BLE_BLE_INTRAWSTAT_REG_FINETGTIMINTRAWSTAT_Msk (0x80UL)         /*!< BLE BLE_INTRAWSTAT_REG: FINETGTIMINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_EVENTAPFAINTRAWSTAT_Pos (8UL)            /*!< BLE BLE_INTRAWSTAT_REG: EVENTAPFAINTRAWSTAT (Bit 8)         */
#define BLE_BLE_INTRAWSTAT_REG_EVENTAPFAINTRAWSTAT_Msk (0x100UL)        /*!< BLE BLE_INTRAWSTAT_REG: EVENTAPFAINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_SWINTRAWSTAT_Pos (9UL)                   /*!< BLE BLE_INTRAWSTAT_REG: SWINTRAWSTAT (Bit 9)                */
#define BLE_BLE_INTRAWSTAT_REG_SWINTRAWSTAT_Msk (0x200UL)               /*!< BLE BLE_INTRAWSTAT_REG: SWINTRAWSTAT (Bitfield-Mask: 0x01)  */

/* -----------------------------  BLE_BLE_INTACK_REG  ----------------------------- */
#define BLE_BLE_INTACK_REG_CSCNTINTACK_Pos    (0UL)                     /*!< BLE BLE_INTACK_REG: CSCNTINTACK (Bit 0)                     */
#define BLE_BLE_INTACK_REG_CSCNTINTACK_Msk    (0x1UL)                   /*!< BLE BLE_INTACK_REG: CSCNTINTACK (Bitfield-Mask: 0x01)       */
#define BLE_BLE_INTACK_REG_RXINTACK_Pos       (1UL)                     /*!< BLE BLE_INTACK_REG: RXINTACK (Bit 1)                        */
#define BLE_BLE_INTACK_REG_RXINTACK_Msk       (0x2UL)                   /*!< BLE BLE_INTACK_REG: RXINTACK (Bitfield-Mask: 0x01)          */
#define BLE_BLE_INTACK_REG_SLPINTACK_Pos      (2UL)                     /*!< BLE BLE_INTACK_REG: SLPINTACK (Bit 2)                       */
#define BLE_BLE_INTACK_REG_SLPINTACK_Msk      (0x4UL)                   /*!< BLE BLE_INTACK_REG: SLPINTACK (Bitfield-Mask: 0x01)         */
#define BLE_BLE_INTACK_REG_EVENTINTACK_Pos    (3UL)                     /*!< BLE BLE_INTACK_REG: EVENTINTACK (Bit 3)                     */
#define BLE_BLE_INTACK_REG_EVENTINTACK_Msk    (0x8UL)                   /*!< BLE BLE_INTACK_REG: EVENTINTACK (Bitfield-Mask: 0x01)       */
#define BLE_BLE_INTACK_REG_CRYPTINTACK_Pos    (4UL)                     /*!< BLE BLE_INTACK_REG: CRYPTINTACK (Bit 4)                     */
#define BLE_BLE_INTACK_REG_CRYPTINTACK_Msk    (0x10UL)                  /*!< BLE BLE_INTACK_REG: CRYPTINTACK (Bitfield-Mask: 0x01)       */
#define BLE_BLE_INTACK_REG_ERRORINTACK_Pos    (5UL)                     /*!< BLE BLE_INTACK_REG: ERRORINTACK (Bit 5)                     */
#define BLE_BLE_INTACK_REG_ERRORINTACK_Msk    (0x20UL)                  /*!< BLE BLE_INTACK_REG: ERRORINTACK (Bitfield-Mask: 0x01)       */
#define BLE_BLE_INTACK_REG_GROSSTGTIMINTACK_Pos (6UL)                   /*!< BLE BLE_INTACK_REG: GROSSTGTIMINTACK (Bit 6)                */
#define BLE_BLE_INTACK_REG_GROSSTGTIMINTACK_Msk (0x40UL)                /*!< BLE BLE_INTACK_REG: GROSSTGTIMINTACK (Bitfield-Mask: 0x01)  */
#define BLE_BLE_INTACK_REG_FINETGTIMINTACK_Pos (7UL)                    /*!< BLE BLE_INTACK_REG: FINETGTIMINTACK (Bit 7)                 */
#define BLE_BLE_INTACK_REG_FINETGTIMINTACK_Msk (0x80UL)                 /*!< BLE BLE_INTACK_REG: FINETGTIMINTACK (Bitfield-Mask: 0x01)   */
#define BLE_BLE_INTACK_REG_EVENTAPFAINTACK_Pos (8UL)                    /*!< BLE BLE_INTACK_REG: EVENTAPFAINTACK (Bit 8)                 */
#define BLE_BLE_INTACK_REG_EVENTAPFAINTACK_Msk (0x100UL)                /*!< BLE BLE_INTACK_REG: EVENTAPFAINTACK (Bitfield-Mask: 0x01)   */
#define BLE_BLE_INTACK_REG_SWINTACK_Pos       (9UL)                     /*!< BLE BLE_INTACK_REG: SWINTACK (Bit 9)                        */
#define BLE_BLE_INTACK_REG_SWINTACK_Msk       (0x200UL)                 /*!< BLE BLE_INTACK_REG: SWINTACK (Bitfield-Mask: 0x01)          */

/* ---------------------------  BLE_BLE_BASETIMECNT_REG  -------------------------- */
#define BLE_BLE_BASETIMECNT_REG_BASETIMECNT_Pos (0UL)                   /*!< BLE BLE_BASETIMECNT_REG: BASETIMECNT (Bit 0)                */
#define BLE_BLE_BASETIMECNT_REG_BASETIMECNT_Msk (0x7ffffffUL)           /*!< BLE BLE_BASETIMECNT_REG: BASETIMECNT (Bitfield-Mask: 0x7ffffff) */

/* ---------------------------  BLE_BLE_FINETIMECNT_REG  -------------------------- */
#define BLE_BLE_FINETIMECNT_REG_FINECNT_Pos   (0UL)                     /*!< BLE BLE_FINETIMECNT_REG: FINECNT (Bit 0)                    */
#define BLE_BLE_FINETIMECNT_REG_FINECNT_Msk   (0x3ffUL)                 /*!< BLE BLE_FINETIMECNT_REG: FINECNT (Bitfield-Mask: 0x3ff)     */

/* -----------------------------  BLE_BLE_BDADDRL_REG  ---------------------------- */
#define BLE_BLE_BDADDRL_REG_BDADDRL_Pos       (0UL)                     /*!< BLE BLE_BDADDRL_REG: BDADDRL (Bit 0)                        */
#define BLE_BLE_BDADDRL_REG_BDADDRL_Msk       (0xffffffffUL)            /*!< BLE BLE_BDADDRL_REG: BDADDRL (Bitfield-Mask: 0xffffffff)    */

/* -----------------------------  BLE_BLE_BDADDRU_REG  ---------------------------- */
#define BLE_BLE_BDADDRU_REG_BDADDRU_Pos       (0UL)                     /*!< BLE BLE_BDADDRU_REG: BDADDRU (Bit 0)                        */
#define BLE_BLE_BDADDRU_REG_BDADDRU_Msk       (0xffffUL)                /*!< BLE BLE_BDADDRU_REG: BDADDRU (Bitfield-Mask: 0xffff)        */
#define BLE_BLE_BDADDRU_REG_PRIV_NPUB_Pos     (16UL)                    /*!< BLE BLE_BDADDRU_REG: PRIV_NPUB (Bit 16)                     */
#define BLE_BLE_BDADDRU_REG_PRIV_NPUB_Msk     (0x10000UL)               /*!< BLE BLE_BDADDRU_REG: PRIV_NPUB (Bitfield-Mask: 0x01)        */

/* ------------------------  BLE_BLE_CURRENTRXDESCPTR_REG  ------------------------ */
#define BLE_BLE_CURRENTRXDESCPTR_REG_CURRENTRXDESCPTR_Pos (0UL)         /*!< BLE BLE_CURRENTRXDESCPTR_REG: CURRENTRXDESCPTR (Bit 0)      */
#define BLE_BLE_CURRENTRXDESCPTR_REG_CURRENTRXDESCPTR_Msk (0x7fffUL)    /*!< BLE BLE_CURRENTRXDESCPTR_REG: CURRENTRXDESCPTR (Bitfield-Mask: 0x7fff) */
#define BLE_BLE_CURRENTRXDESCPTR_REG_ETPTR_Pos (16UL)                   /*!< BLE BLE_CURRENTRXDESCPTR_REG: ETPTR (Bit 16)                */
#define BLE_BLE_CURRENTRXDESCPTR_REG_ETPTR_Msk (0xffff0000UL)           /*!< BLE BLE_CURRENTRXDESCPTR_REG: ETPTR (Bitfield-Mask: 0xffff) */

