openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* ---------------------------  BLE_BLE_DEEPSLCNTL_REG  --------------------------- */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_IRQ_EN_Pos (0UL)              /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_IRQ_EN (Bit 0)           */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_IRQ_EN_Msk (0x3UL)            /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_IRQ_EN (Bitfield-Mask: 0x03) */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_ON_Pos (2UL)                  /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_ON (Bit 2)               */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_ON_Msk (0x4UL)                /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_ON (Bitfield-Mask: 0x01) */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_CORR_EN_Pos (3UL)             /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_CORR_EN (Bit 3)          */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_CORR_EN_Msk (0x8UL)           /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_CORR_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_DEEPSLCNTL_REG_SOFT_WAKEUP_REQ_Pos (4UL)                /*!< BLE BLE_DEEPSLCNTL_REG: SOFT_WAKEUP_REQ (Bit 4)             */
#define BLE_BLE_DEEPSLCNTL_REG_SOFT_WAKEUP_REQ_Msk (0x10UL)             /*!< BLE BLE_DEEPSLCNTL_REG: SOFT_WAKEUP_REQ (Bitfield-Mask: 0x01) */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_STAT_Pos (15UL)               /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_STAT (Bit 15)            */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_STAT_Msk (0x8000UL)           /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_STAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_DEEPSLCNTL_REG_EXTWKUPDSB_Pos (31UL)                    /*!< BLE BLE_DEEPSLCNTL_REG: EXTWKUPDSB (Bit 31)                 */
#define BLE_BLE_DEEPSLCNTL_REG_EXTWKUPDSB_Msk (0x80000000UL)            /*!< BLE BLE_DEEPSLCNTL_REG: EXTWKUPDSB (Bitfield-Mask: 0x01)    */

/* ---------------------------  BLE_BLE_DEEPSLWKUP_REG  --------------------------- */
#define BLE_BLE_DEEPSLWKUP_REG_DEEPSLTIME_Pos (0UL)                     /*!< BLE BLE_DEEPSLWKUP_REG: DEEPSLTIME (Bit 0)                  */
#define BLE_BLE_DEEPSLWKUP_REG_DEEPSLTIME_Msk (0xffffffffUL)            /*!< BLE BLE_DEEPSLWKUP_REG: DEEPSLTIME (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  BLE_BLE_DEEPSLSTAT_REG  --------------------------- */
#define BLE_BLE_DEEPSLSTAT_REG_DEEPSLDUR_Pos  (0UL)                     /*!< BLE BLE_DEEPSLSTAT_REG: DEEPSLDUR (Bit 0)                   */
#define BLE_BLE_DEEPSLSTAT_REG_DEEPSLDUR_Msk  (0xffffffffUL)            /*!< BLE BLE_DEEPSLSTAT_REG: DEEPSLDUR (Bitfield-Mask: 0xffffffff) */

/* ----------------------------  BLE_BLE_ENBPRESET_REG  --------------------------- */
#define BLE_BLE_ENBPRESET_REG_TWIRQ_RESET_Pos (0UL)                     /*!< BLE BLE_ENBPRESET_REG: TWIRQ_RESET (Bit 0)                  */
#define BLE_BLE_ENBPRESET_REG_TWIRQ_RESET_Msk (0x3ffUL)                 /*!< BLE BLE_ENBPRESET_REG: TWIRQ_RESET (Bitfield-Mask: 0x3ff)   */
#define BLE_BLE_ENBPRESET_REG_TWIRQ_SET_Pos   (10UL)                    /*!< BLE BLE_ENBPRESET_REG: TWIRQ_SET (Bit 10)                   */
#define BLE_BLE_ENBPRESET_REG_TWIRQ_SET_Msk   (0x1ffc00UL)              /*!< BLE BLE_ENBPRESET_REG: TWIRQ_SET (Bitfield-Mask: 0x7ff)     */
#define BLE_BLE_ENBPRESET_REG_TWEXT_Pos       (21UL)                    /*!< BLE BLE_ENBPRESET_REG: TWEXT (Bit 21)                       */
#define BLE_BLE_ENBPRESET_REG_TWEXT_Msk       (0xffe00000UL)            /*!< BLE BLE_ENBPRESET_REG: TWEXT (Bitfield-Mask: 0x7ff)         */

/* ---------------------------  BLE_BLE_FINECNTCORR_REG  -------------------------- */
#define BLE_BLE_FINECNTCORR_REG_FINECNTCORR_Pos (0UL)                   /*!< BLE BLE_FINECNTCORR_REG: FINECNTCORR (Bit 0)                */
#define BLE_BLE_FINECNTCORR_REG_FINECNTCORR_Msk (0x3ffUL)               /*!< BLE BLE_FINECNTCORR_REG: FINECNTCORR (Bitfield-Mask: 0x3ff) */

/* -------------------------  BLE_BLE_BASETIMECNTCORR_REG  ------------------------ */
#define BLE_BLE_BASETIMECNTCORR_REG_BASETIMECNTCORR_Pos (0UL)           /*!< BLE BLE_BASETIMECNTCORR_REG: BASETIMECNTCORR (Bit 0)        */
#define BLE_BLE_BASETIMECNTCORR_REG_BASETIMECNTCORR_Msk (0x7ffffffUL)   /*!< BLE BLE_BASETIMECNTCORR_REG: BASETIMECNTCORR (Bitfield-Mask: 0x7ffffff) */

/* ----------------------------  BLE_BLE_DIAGCNTL_REG  ---------------------------- */
#define BLE_BLE_DIAGCNTL_REG_DIAG0_Pos        (0UL)                     /*!< BLE BLE_DIAGCNTL_REG: DIAG0 (Bit 0)                         */
#define BLE_BLE_DIAGCNTL_REG_DIAG0_Msk        (0x3fUL)                  /*!< BLE BLE_DIAGCNTL_REG: DIAG0 (Bitfield-Mask: 0x3f)           */
#define BLE_BLE_DIAGCNTL_REG_DIAG0_EN_Pos     (7UL)                     /*!< BLE BLE_DIAGCNTL_REG: DIAG0_EN (Bit 7)                      */
#define BLE_BLE_DIAGCNTL_REG_DIAG0_EN_Msk     (0x80UL)                  /*!< BLE BLE_DIAGCNTL_REG: DIAG0_EN (Bitfield-Mask: 0x01)        */
#define BLE_BLE_DIAGCNTL_REG_DIAG1_Pos        (8UL)                     /*!< BLE BLE_DIAGCNTL_REG: DIAG1 (Bit 8)                         */
#define BLE_BLE_DIAGCNTL_REG_DIAG1_Msk        (0x3f00UL)                /*!< BLE BLE_DIAGCNTL_REG: DIAG1 (Bitfield-Mask: 0x3f)           */
#define BLE_BLE_DIAGCNTL_REG_DIAG1_EN_Pos     (15UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG1_EN (Bit 15)                     */
#define BLE_BLE_DIAGCNTL_REG_DIAG1_EN_Msk     (0x8000UL)                /*!< BLE BLE_DIAGCNTL_REG: DIAG1_EN (Bitfield-Mask: 0x01)        */
#define BLE_BLE_DIAGCNTL_REG_DIAG2_Pos        (16UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG2 (Bit 16)                        */
#define BLE_BLE_DIAGCNTL_REG_DIAG2_Msk        (0x3f0000UL)              /*!< BLE BLE_DIAGCNTL_REG: DIAG2 (Bitfield-Mask: 0x3f)           */
#define BLE_BLE_DIAGCNTL_REG_DIAG2_EN_Pos     (23UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG2_EN (Bit 23)                     */
#define BLE_BLE_DIAGCNTL_REG_DIAG2_EN_Msk     (0x800000UL)              /*!< BLE BLE_DIAGCNTL_REG: DIAG2_EN (Bitfield-Mask: 0x01)        */
#define BLE_BLE_DIAGCNTL_REG_DIAG3_Pos        (24UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG3 (Bit 24)                        */
#define BLE_BLE_DIAGCNTL_REG_DIAG3_Msk        (0x3f000000UL)            /*!< BLE BLE_DIAGCNTL_REG: DIAG3 (Bitfield-Mask: 0x3f)           */
#define BLE_BLE_DIAGCNTL_REG_DIAG3_EN_Pos     (31UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG3_EN (Bit 31)                     */
#define BLE_BLE_DIAGCNTL_REG_DIAG3_EN_Msk     (0x80000000UL)            /*!< BLE BLE_DIAGCNTL_REG: DIAG3_EN (Bitfield-Mask: 0x01)        */

/* ----------------------------  BLE_BLE_DIAGSTAT_REG  ---------------------------- */
#define BLE_BLE_DIAGSTAT_REG_DIAG0STAT_Pos    (0UL)                     /*!< BLE BLE_DIAGSTAT_REG: DIAG0STAT (Bit 0)                     */
#define BLE_BLE_DIAGSTAT_REG_DIAG0STAT_Msk    (0xffUL)                  /*!< BLE BLE_DIAGSTAT_REG: DIAG0STAT (Bitfield-Mask: 0xff)       */
#define BLE_BLE_DIAGSTAT_REG_DIAG1STAT_Pos    (8UL)                     /*!< BLE BLE_DIAGSTAT_REG: DIAG1STAT (Bit 8)                     */
#define BLE_BLE_DIAGSTAT_REG_DIAG1STAT_Msk    (0xff00UL)                /*!< BLE BLE_DIAGSTAT_REG: DIAG1STAT (Bitfield-Mask: 0xff)       */
#define BLE_BLE_DIAGSTAT_REG_DIAG2STAT_Pos    (16UL)                    /*!< BLE BLE_DIAGSTAT_REG: DIAG2STAT (Bit 16)                    */
#define BLE_BLE_DIAGSTAT_REG_DIAG2STAT_Msk    (0xff0000UL)              /*!< BLE BLE_DIAGSTAT_REG: DIAG2STAT (Bitfield-Mask: 0xff)       */
#define BLE_BLE_DIAGSTAT_REG_DIAG3STAT_Pos    (24UL)                    /*!< BLE BLE_DIAGSTAT_REG: DIAG3STAT (Bit 24)                    */
#define BLE_BLE_DIAGSTAT_REG_DIAG3STAT_Msk    (0xff000000UL)            /*!< BLE BLE_DIAGSTAT_REG: DIAG3STAT (Bitfield-Mask: 0xff)       */

