openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* ----------------------------  CACHE_CACHE_CTRL3_REG  --------------------------- */
#define CACHE_CACHE_CTRL3_REG_CACHE_ASSOCIATIVITY_RESET_VALUE_Pos (0UL) /*!< CACHE CACHE_CTRL3_REG: CACHE_ASSOCIATIVITY_RESET_VALUE (Bit 0) */
#define CACHE_CACHE_CTRL3_REG_CACHE_ASSOCIATIVITY_RESET_VALUE_Msk (0x3UL) /*!< CACHE CACHE_CTRL3_REG: CACHE_ASSOCIATIVITY_RESET_VALUE (Bitfield-Mask: 0x03) */
#define CACHE_CACHE_CTRL3_REG_CACHE_LINE_SIZE_RESET_VALUE_Pos (2UL)     /*!< CACHE CACHE_CTRL3_REG: CACHE_LINE_SIZE_RESET_VALUE (Bit 2)  */
#define CACHE_CACHE_CTRL3_REG_CACHE_LINE_SIZE_RESET_VALUE_Msk (0xcUL)   /*!< CACHE CACHE_CTRL3_REG: CACHE_LINE_SIZE_RESET_VALUE (Bitfield-Mask: 0x03) */
#define CACHE_CACHE_CTRL3_REG_CACHE_RAM_SIZE_RESET_VALUE_Pos (4UL)      /*!< CACHE CACHE_CTRL3_REG: CACHE_RAM_SIZE_RESET_VALUE (Bit 4)   */
#define CACHE_CACHE_CTRL3_REG_CACHE_RAM_SIZE_RESET_VALUE_Msk (0x70UL)   /*!< CACHE CACHE_CTRL3_REG: CACHE_RAM_SIZE_RESET_VALUE (Bitfield-Mask: 0x07) */
#define CACHE_CACHE_CTRL3_REG_CACHE_CONTROLLER_RESET_Pos (7UL)          /*!< CACHE CACHE_CTRL3_REG: CACHE_CONTROLLER_RESET (Bit 7)       */
#define CACHE_CACHE_CTRL3_REG_CACHE_CONTROLLER_RESET_Msk (0x80UL)       /*!< CACHE CACHE_CTRL3_REG: CACHE_CONTROLLER_RESET (Bitfield-Mask: 0x01) */

/* --------------------------  CACHE_CACHE_MRM_HITS_REG  -------------------------- */
#define CACHE_CACHE_MRM_HITS_REG_MRM_HITS_Pos (0UL)                     /*!< CACHE CACHE_MRM_HITS_REG: MRM_HITS (Bit 0)                  */
#define CACHE_CACHE_MRM_HITS_REG_MRM_HITS_Msk (0x7ffffUL)               /*!< CACHE CACHE_MRM_HITS_REG: MRM_HITS (Bitfield-Mask: 0x7ffff) */

/* -------------------------  CACHE_CACHE_MRM_MISSES_REG  ------------------------- */
#define CACHE_CACHE_MRM_MISSES_REG_MRM_MISSES_Pos (0UL)                 /*!< CACHE CACHE_MRM_MISSES_REG: MRM_MISSES (Bit 0)              */
#define CACHE_CACHE_MRM_MISSES_REG_MRM_MISSES_Msk (0x3ffffUL)           /*!< CACHE CACHE_MRM_MISSES_REG: MRM_MISSES (Bitfield-Mask: 0x3ffff) */

/* --------------------------  CACHE_CACHE_MRM_CTRL_REG  -------------------------- */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_START_Pos (0UL)                    /*!< CACHE CACHE_MRM_CTRL_REG: MRM_START (Bit 0)                 */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_START_Msk (0x1UL)                  /*!< CACHE CACHE_MRM_CTRL_REG: MRM_START (Bitfield-Mask: 0x01)   */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Pos (1UL)                 /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_MASK (Bit 1)              */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Msk (0x2UL)               /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_MASK (Bitfield-Mask: 0x01) */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Pos (2UL)          /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_TINT_STATUS (Bit 2)       */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Msk (0x4UL)        /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_TINT_STATUS (Bitfield-Mask: 0x01) */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_THRES_STATUS_Pos (3UL)         /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_THRES_STATUS (Bit 3)      */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_THRES_STATUS_Msk (0x8UL)       /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_THRES_STATUS (Bitfield-Mask: 0x01) */

/* --------------------------  CACHE_CACHE_MRM_TINT_REG  -------------------------- */
#define CACHE_CACHE_MRM_TINT_REG_MRM_TINT_Pos (0UL)                     /*!< CACHE CACHE_MRM_TINT_REG: MRM_TINT (Bit 0)                  */
#define CACHE_CACHE_MRM_TINT_REG_MRM_TINT_Msk (0x3ffffUL)               /*!< CACHE CACHE_MRM_TINT_REG: MRM_TINT (Bitfield-Mask: 0x3ffff) */

/* --------------------------  CACHE_CACHE_MRM_THRES_REG  ------------------------- */
#define CACHE_CACHE_MRM_THRES_REG_MRM_THRES_Pos (0UL)                   /*!< CACHE CACHE_MRM_THRES_REG: MRM_THRES (Bit 0)                */
#define CACHE_CACHE_MRM_THRES_REG_MRM_THRES_Msk (0x3ffffUL)             /*!< CACHE CACHE_MRM_THRES_REG: MRM_THRES (Bitfield-Mask: 0x3ffff) */

/* -----------------------------  CACHE_SWD_RESET_REG  ---------------------------- */
#define CACHE_SWD_RESET_REG_SWD_HW_RESET_REQ_Pos (0UL)                  /*!< CACHE SWD_RESET_REG: SWD_HW_RESET_REQ (Bit 0)               */
#define CACHE_SWD_RESET_REG_SWD_HW_RESET_REQ_Msk (0x1UL)                /*!< CACHE SWD_RESET_REG: SWD_HW_RESET_REQ (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================      struct 'CHIP_VERSION' Position & Mask     ================ */
/* ================================================================================ */


/* --------------------------  CHIP_VERSION_CHIP_ID1_REG  ------------------------- */
#define CHIP_VERSION_CHIP_ID1_REG_CHIP_ID1_Pos (0UL)                    /*!< CHIP_VERSION CHIP_ID1_REG: CHIP_ID1 (Bit 0)                 */
#define CHIP_VERSION_CHIP_ID1_REG_CHIP_ID1_Msk (0xffUL)                 /*!< CHIP_VERSION CHIP_ID1_REG: CHIP_ID1 (Bitfield-Mask: 0xff)   */

/* --------------------------  CHIP_VERSION_CHIP_ID2_REG  ------------------------- */
#define CHIP_VERSION_CHIP_ID2_REG_CHIP_ID2_Pos (0UL)                    /*!< CHIP_VERSION CHIP_ID2_REG: CHIP_ID2 (Bit 0)                 */
#define CHIP_VERSION_CHIP_ID2_REG_CHIP_ID2_Msk (0xffUL)                 /*!< CHIP_VERSION CHIP_ID2_REG: CHIP_ID2 (Bitfield-Mask: 0xff)   */

/* --------------------------  CHIP_VERSION_CHIP_ID3_REG  ------------------------- */
#define CHIP_VERSION_CHIP_ID3_REG_CHIP_ID3_Pos (0UL)                    /*!< CHIP_VERSION CHIP_ID3_REG: CHIP_ID3 (Bit 0)                 */
#define CHIP_VERSION_CHIP_ID3_REG_CHIP_ID3_Msk (0xffUL)                 /*!< CHIP_VERSION CHIP_ID3_REG: CHIP_ID3 (Bitfield-Mask: 0xff)   */

/* --------------------------  CHIP_VERSION_CHIP_SWC_REG  ------------------------- */
#define CHIP_VERSION_CHIP_SWC_REG_CHIP_SWC_Pos (0UL)                    /*!< CHIP_VERSION CHIP_SWC_REG: CHIP_SWC (Bit 0)                 */
#define CHIP_VERSION_CHIP_SWC_REG_CHIP_SWC_Msk (0xfUL)                  /*!< CHIP_VERSION CHIP_SWC_REG: CHIP_SWC (Bitfield-Mask: 0x0f)   */

