openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* ---------------------------  COEX_COEX_INT_MASK_REG  --------------------------- */
#define COEX_COEX_INT_MASK_REG_IRQ_TXRX_MON_Pos (8UL)                   /*!< COEX COEX_INT_MASK_REG: IRQ_TXRX_MON (Bit 8)                */
#define COEX_COEX_INT_MASK_REG_IRQ_TXRX_MON_Msk (0x100UL)               /*!< COEX COEX_INT_MASK_REG: IRQ_TXRX_MON (Bitfield-Mask: 0x01)  */
#define COEX_COEX_INT_MASK_REG_IRQ_DECISION_SW_Pos (9UL)                /*!< COEX COEX_INT_MASK_REG: IRQ_DECISION_SW (Bit 9)             */
#define COEX_COEX_INT_MASK_REG_IRQ_DECISION_SW_Msk (0x200UL)            /*!< COEX COEX_INT_MASK_REG: IRQ_DECISION_SW (Bitfield-Mask: 0x01) */

/* ---------------------------  COEX_COEX_INT_STAT_REG  --------------------------- */
#define COEX_COEX_INT_STAT_REG_TXRX_MON_PTR_Pos (0UL)                   /*!< COEX COEX_INT_STAT_REG: TXRX_MON_PTR (Bit 0)                */
#define COEX_COEX_INT_STAT_REG_TXRX_MON_PTR_Msk (0xfUL)                 /*!< COEX COEX_INT_STAT_REG: TXRX_MON_PTR (Bitfield-Mask: 0x0f)  */
#define COEX_COEX_INT_STAT_REG_TXRX_MON_TX_Pos (5UL)                    /*!< COEX COEX_INT_STAT_REG: TXRX_MON_TX (Bit 5)                 */
#define COEX_COEX_INT_STAT_REG_TXRX_MON_TX_Msk (0x20UL)                 /*!< COEX COEX_INT_STAT_REG: TXRX_MON_TX (Bitfield-Mask: 0x01)   */
#define COEX_COEX_INT_STAT_REG_TXRX_MON_PASSED_Pos (6UL)                /*!< COEX COEX_INT_STAT_REG: TXRX_MON_PASSED (Bit 6)             */
#define COEX_COEX_INT_STAT_REG_TXRX_MON_PASSED_Msk (0x40UL)             /*!< COEX COEX_INT_STAT_REG: TXRX_MON_PASSED (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_TXRX_MON_OVWR_Pos (7UL)                  /*!< COEX COEX_INT_STAT_REG: TXRX_MON_OVWR (Bit 7)               */
#define COEX_COEX_INT_STAT_REG_TXRX_MON_OVWR_Msk (0x80UL)               /*!< COEX COEX_INT_STAT_REG: TXRX_MON_OVWR (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_IRQ_TXRX_MON_Pos (8UL)                   /*!< COEX COEX_INT_STAT_REG: IRQ_TXRX_MON (Bit 8)                */
#define COEX_COEX_INT_STAT_REG_IRQ_TXRX_MON_Msk (0x100UL)               /*!< COEX COEX_INT_STAT_REG: IRQ_TXRX_MON (Bitfield-Mask: 0x01)  */
#define COEX_COEX_INT_STAT_REG_IRQ_DECISION_SW_Pos (9UL)                /*!< COEX COEX_INT_STAT_REG: IRQ_DECISION_SW (Bit 9)             */
#define COEX_COEX_INT_STAT_REG_IRQ_DECISION_SW_Msk (0x200UL)            /*!< COEX COEX_INT_STAT_REG: IRQ_DECISION_SW (Bitfield-Mask: 0x01) */

/* ----------------------------  COEX_COEX_BLE_PTI_REG  --------------------------- */
#define COEX_COEX_BLE_PTI_REG_COEX_BLE_PTI_Pos (0UL)                    /*!< COEX COEX_BLE_PTI_REG: COEX_BLE_PTI (Bit 0)                 */
#define COEX_COEX_BLE_PTI_REG_COEX_BLE_PTI_Msk (0x7UL)                  /*!< COEX COEX_BLE_PTI_REG: COEX_BLE_PTI (Bitfield-Mask: 0x07)   */

/* ---------------------------  COEX_COEX_FTDF_PTI_REG  --------------------------- */
#define COEX_COEX_FTDF_PTI_REG_COEX_FTDF_PTI_Pos (0UL)                  /*!< COEX COEX_FTDF_PTI_REG: COEX_FTDF_PTI (Bit 0)               */
#define COEX_COEX_FTDF_PTI_REG_COEX_FTDF_PTI_Msk (0x7UL)                /*!< COEX COEX_FTDF_PTI_REG: COEX_FTDF_PTI (Bitfield-Mask: 0x07) */

/* -----------------------------  COEX_COEX_PRI1_REG  ----------------------------- */
#define COEX_COEX_PRI1_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI1_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI1_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI1_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI1_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI1_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI1_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI1_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI2_REG  ----------------------------- */
#define COEX_COEX_PRI2_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI2_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI2_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI2_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI2_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI2_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI2_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI2_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI3_REG  ----------------------------- */
#define COEX_COEX_PRI3_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI3_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI3_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI3_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI3_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI3_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI3_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI3_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI4_REG  ----------------------------- */
#define COEX_COEX_PRI4_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI4_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI4_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI4_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI4_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI4_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI4_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI4_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI5_REG  ----------------------------- */
#define COEX_COEX_PRI5_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI5_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI5_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI5_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI5_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI5_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI5_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI5_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI6_REG  ----------------------------- */
#define COEX_COEX_PRI6_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI6_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI6_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI6_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI6_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI6_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI6_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI6_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI7_REG  ----------------------------- */
#define COEX_COEX_PRI7_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI7_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI7_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI7_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI7_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI7_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI7_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI7_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI8_REG  ----------------------------- */
#define COEX_COEX_PRI8_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI8_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI8_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI8_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI8_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI8_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI8_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI8_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI9_REG  ----------------------------- */
#define COEX_COEX_PRI9_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI9_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI9_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI9_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI9_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI9_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI9_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI9_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI10_REG  ---------------------------- */
#define COEX_COEX_PRI10_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI10_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI10_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI10_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI10_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI10_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI10_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI10_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */

/* -----------------------------  COEX_COEX_PRI11_REG  ---------------------------- */
#define COEX_COEX_PRI11_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI11_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI11_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI11_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI11_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI11_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI11_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI11_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */

