openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* ----------------------------  CRG_TOP_BOD_CTRL2_REG  --------------------------- */
#define CRG_TOP_BOD_CTRL2_REG_BOD_RESET_EN_Pos (0UL)                    /*!< CRG_TOP BOD_CTRL2_REG: BOD_RESET_EN (Bit 0)                 */
#define CRG_TOP_BOD_CTRL2_REG_BOD_RESET_EN_Msk (0x1UL)                  /*!< CRG_TOP BOD_CTRL2_REG: BOD_RESET_EN (Bitfield-Mask: 0x01)   */
#define CRG_TOP_BOD_CTRL2_REG_BOD_VDD_EN_Pos  (1UL)                     /*!< CRG_TOP BOD_CTRL2_REG: BOD_VDD_EN (Bit 1)                   */
#define CRG_TOP_BOD_CTRL2_REG_BOD_VDD_EN_Msk  (0x2UL)                   /*!< CRG_TOP BOD_CTRL2_REG: BOD_VDD_EN (Bitfield-Mask: 0x01)     */
#define CRG_TOP_BOD_CTRL2_REG_BOD_V33_EN_Pos  (2UL)                     /*!< CRG_TOP BOD_CTRL2_REG: BOD_V33_EN (Bit 2)                   */
#define CRG_TOP_BOD_CTRL2_REG_BOD_V33_EN_Msk  (0x4UL)                   /*!< CRG_TOP BOD_CTRL2_REG: BOD_V33_EN (Bitfield-Mask: 0x01)     */
#define CRG_TOP_BOD_CTRL2_REG_BOD_1V8_PA_EN_Pos (3UL)                   /*!< CRG_TOP BOD_CTRL2_REG: BOD_1V8_PA_EN (Bit 3)                */
#define CRG_TOP_BOD_CTRL2_REG_BOD_1V8_PA_EN_Msk (0x8UL)                 /*!< CRG_TOP BOD_CTRL2_REG: BOD_1V8_PA_EN (Bitfield-Mask: 0x01)  */
#define CRG_TOP_BOD_CTRL2_REG_BOD_1V8_FLASH_EN_Pos (4UL)                /*!< CRG_TOP BOD_CTRL2_REG: BOD_1V8_FLASH_EN (Bit 4)             */
#define CRG_TOP_BOD_CTRL2_REG_BOD_1V8_FLASH_EN_Msk (0x10UL)             /*!< CRG_TOP BOD_CTRL2_REG: BOD_1V8_FLASH_EN (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_CTRL2_REG_BOD_VBAT_EN_Pos (5UL)                     /*!< CRG_TOP BOD_CTRL2_REG: BOD_VBAT_EN (Bit 5)                  */
#define CRG_TOP_BOD_CTRL2_REG_BOD_VBAT_EN_Msk (0x20UL)                  /*!< CRG_TOP BOD_CTRL2_REG: BOD_VBAT_EN (Bitfield-Mask: 0x01)    */
#define CRG_TOP_BOD_CTRL2_REG_BOD_V14_EN_Pos  (6UL)                     /*!< CRG_TOP BOD_CTRL2_REG: BOD_V14_EN (Bit 6)                   */
#define CRG_TOP_BOD_CTRL2_REG_BOD_V14_EN_Msk  (0x40UL)                  /*!< CRG_TOP BOD_CTRL2_REG: BOD_V14_EN (Bitfield-Mask: 0x01)     */

/* ---------------------------  CRG_TOP_BOD_STATUS_REG  --------------------------- */
#define CRG_TOP_BOD_STATUS_REG_BOD_VDD_LOW_Pos (0UL)                    /*!< CRG_TOP BOD_STATUS_REG: BOD_VDD_LOW (Bit 0)                 */
#define CRG_TOP_BOD_STATUS_REG_BOD_VDD_LOW_Msk (0x1UL)                  /*!< CRG_TOP BOD_STATUS_REG: BOD_VDD_LOW (Bitfield-Mask: 0x01)   */
#define CRG_TOP_BOD_STATUS_REG_BOD_1V8_PA_LOW_Pos (1UL)                 /*!< CRG_TOP BOD_STATUS_REG: BOD_1V8_PA_LOW (Bit 1)              */
#define CRG_TOP_BOD_STATUS_REG_BOD_1V8_PA_LOW_Msk (0x2UL)               /*!< CRG_TOP BOD_STATUS_REG: BOD_1V8_PA_LOW (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_STATUS_REG_BOD_1V8_FLASH_LOW_Pos (2UL)              /*!< CRG_TOP BOD_STATUS_REG: BOD_1V8_FLASH_LOW (Bit 2)           */
#define CRG_TOP_BOD_STATUS_REG_BOD_1V8_FLASH_LOW_Msk (0x4UL)            /*!< CRG_TOP BOD_STATUS_REG: BOD_1V8_FLASH_LOW (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_STATUS_REG_BOD_V33_LOW_Pos (3UL)                    /*!< CRG_TOP BOD_STATUS_REG: BOD_V33_LOW (Bit 3)                 */
#define CRG_TOP_BOD_STATUS_REG_BOD_V33_LOW_Msk (0x8UL)                  /*!< CRG_TOP BOD_STATUS_REG: BOD_V33_LOW (Bitfield-Mask: 0x01)   */
#define CRG_TOP_BOD_STATUS_REG_BOD_VBAT_LOW_Pos (4UL)                   /*!< CRG_TOP BOD_STATUS_REG: BOD_VBAT_LOW (Bit 4)                */
#define CRG_TOP_BOD_STATUS_REG_BOD_VBAT_LOW_Msk (0x10UL)                /*!< CRG_TOP BOD_STATUS_REG: BOD_VBAT_LOW (Bitfield-Mask: 0x01)  */
#define CRG_TOP_BOD_STATUS_REG_BOD_V14_LOW_Pos (5UL)                    /*!< CRG_TOP BOD_STATUS_REG: BOD_V14_LOW (Bit 5)                 */
#define CRG_TOP_BOD_STATUS_REG_BOD_V14_LOW_Msk (0x20UL)                 /*!< CRG_TOP BOD_STATUS_REG: BOD_V14_LOW (Bitfield-Mask: 0x01)   */

/* ----------------------------  CRG_TOP_LDO_CTRL1_REG  --------------------------- */
#define CRG_TOP_LDO_CTRL1_REG_LDO_CORE_CURLIM_Pos (0UL)                 /*!< CRG_TOP LDO_CTRL1_REG: LDO_CORE_CURLIM (Bit 0)              */
#define CRG_TOP_LDO_CTRL1_REG_LDO_CORE_CURLIM_Msk (0x3UL)               /*!< CRG_TOP LDO_CTRL1_REG: LDO_CORE_CURLIM (Bitfield-Mask: 0x03) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_VBAT_RET_LEVEL_Pos (2UL)              /*!< CRG_TOP LDO_CTRL1_REG: LDO_VBAT_RET_LEVEL (Bit 2)           */
#define CRG_TOP_LDO_CTRL1_REG_LDO_VBAT_RET_LEVEL_Msk (0xcUL)            /*!< CRG_TOP LDO_CTRL1_REG: LDO_VBAT_RET_LEVEL (Bitfield-Mask: 0x03) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_SUPPLY_VBAT_LEVEL_Pos (4UL)           /*!< CRG_TOP LDO_CTRL1_REG: LDO_SUPPLY_VBAT_LEVEL (Bit 4)        */
#define CRG_TOP_LDO_CTRL1_REG_LDO_SUPPLY_VBAT_LEVEL_Msk (0x30UL)        /*!< CRG_TOP LDO_CTRL1_REG: LDO_SUPPLY_VBAT_LEVEL (Bitfield-Mask: 0x03) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_SUPPLY_USB_LEVEL_Pos (6UL)            /*!< CRG_TOP LDO_CTRL1_REG: LDO_SUPPLY_USB_LEVEL (Bit 6)         */
#define CRG_TOP_LDO_CTRL1_REG_LDO_SUPPLY_USB_LEVEL_Msk (0xc0UL)         /*!< CRG_TOP LDO_CTRL1_REG: LDO_SUPPLY_USB_LEVEL (Bitfield-Mask: 0x03) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_CORE_SETVDD_Pos (8UL)                 /*!< CRG_TOP LDO_CTRL1_REG: LDO_CORE_SETVDD (Bit 8)              */
#define CRG_TOP_LDO_CTRL1_REG_LDO_CORE_SETVDD_Msk (0x700UL)             /*!< CRG_TOP LDO_CTRL1_REG: LDO_CORE_SETVDD (Bitfield-Mask: 0x07) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_RADIO_SETVDD_Pos (11UL)               /*!< CRG_TOP LDO_CTRL1_REG: LDO_RADIO_SETVDD (Bit 11)            */
#define CRG_TOP_LDO_CTRL1_REG_LDO_RADIO_SETVDD_Msk (0x3800UL)           /*!< CRG_TOP LDO_CTRL1_REG: LDO_RADIO_SETVDD (Bitfield-Mask: 0x07) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_RADIO_ENABLE_Pos (14UL)               /*!< CRG_TOP LDO_CTRL1_REG: LDO_RADIO_ENABLE (Bit 14)            */
#define CRG_TOP_LDO_CTRL1_REG_LDO_RADIO_ENABLE_Msk (0x4000UL)           /*!< CRG_TOP LDO_CTRL1_REG: LDO_RADIO_ENABLE (Bitfield-Mask: 0x01) */

/* ----------------------------  CRG_TOP_LDO_CTRL2_REG  --------------------------- */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V2_ON_Pos  (0UL)                     /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V2_ON (Bit 0)                   */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V2_ON_Msk  (0x1UL)                   /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V2_ON (Bitfield-Mask: 0x01)     */
#define CRG_TOP_LDO_CTRL2_REG_LDO_3V3_ON_Pos  (1UL)                     /*!< CRG_TOP LDO_CTRL2_REG: LDO_3V3_ON (Bit 1)                   */
#define CRG_TOP_LDO_CTRL2_REG_LDO_3V3_ON_Msk  (0x2UL)                   /*!< CRG_TOP LDO_CTRL2_REG: LDO_3V3_ON (Bitfield-Mask: 0x01)     */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_FLASH_ON_Pos (2UL)                /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_FLASH_ON (Bit 2)             */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_FLASH_ON_Msk (0x4UL)              /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_FLASH_ON (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_PA_ON_Pos (3UL)                   /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_PA_ON (Bit 3)                */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_PA_ON_Msk (0x8UL)                 /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_PA_ON (Bitfield-Mask: 0x01)  */
#define CRG_TOP_LDO_CTRL2_REG_LDO_VBAT_RET_DISABLE_Pos (4UL)            /*!< CRG_TOP LDO_CTRL2_REG: LDO_VBAT_RET_DISABLE (Bit 4)         */
#define CRG_TOP_LDO_CTRL2_REG_LDO_VBAT_RET_DISABLE_Msk (0x10UL)         /*!< CRG_TOP LDO_CTRL2_REG: LDO_VBAT_RET_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_FLASH_RET_DISABLE_Pos (5UL)       /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_FLASH_RET_DISABLE (Bit 5)    */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_FLASH_RET_DISABLE_Msk (0x20UL)    /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_FLASH_RET_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_PA_RET_DISABLE_Pos (6UL)          /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_PA_RET_DISABLE (Bit 6)       */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_PA_RET_DISABLE_Msk (0x40UL)       /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_PA_RET_DISABLE (Bitfield-Mask: 0x01) */

/* ---------------------------  CRG_TOP_SLEEP_TIMER_REG  -------------------------- */
#define CRG_TOP_SLEEP_TIMER_REG_SLEEP_TIMER_Pos (0UL)                   /*!< CRG_TOP SLEEP_TIMER_REG: SLEEP_TIMER (Bit 0)                */
#define CRG_TOP_SLEEP_TIMER_REG_SLEEP_TIMER_Msk (0xffffUL)              /*!< CRG_TOP SLEEP_TIMER_REG: SLEEP_TIMER (Bitfield-Mask: 0xffff) */

/* ---------------------------  CRG_TOP_POWER_CTRL_REG  --------------------------- */
#define CRG_TOP_POWER_CTRL_REG_TRIM_NEWBAT_Pos (0UL)                    /*!< CRG_TOP POWER_CTRL_REG: TRIM_NEWBAT (Bit 0)                 */
#define CRG_TOP_POWER_CTRL_REG_TRIM_NEWBAT_Msk (0x7UL)                  /*!< CRG_TOP POWER_CTRL_REG: TRIM_NEWBAT (Bitfield-Mask: 0x07)   */

/* --------------------------  CRG_TOP_POR_VBAT_CTRL_REG  ------------------------- */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_THRES_LOW_Pos (0UL)          /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_THRES_LOW (Bit 0)       */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_THRES_LOW_Msk (0xfUL)        /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_THRES_LOW (Bitfield-Mask: 0x0f) */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_THRES_HIGH_Pos (4UL)         /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_THRES_HIGH (Bit 4)      */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_THRES_HIGH_Msk (0xf0UL)      /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_THRES_HIGH (Bitfield-Mask: 0x0f) */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_HYST_LOW_Pos (8UL)           /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_HYST_LOW (Bit 8)        */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_HYST_LOW_Msk (0xf00UL)       /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_HYST_LOW (Bitfield-Mask: 0x0f) */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_ENABLE_Pos (12UL)            /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_ENABLE (Bit 12)         */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_ENABLE_Msk (0x1000UL)        /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_MASK_N_Pos (13UL)            /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_MASK_N (Bit 13)         */
#define CRG_TOP_POR_VBAT_CTRL_REG_POR_VBAT_MASK_N_Msk (0x2000UL)        /*!< CRG_TOP POR_VBAT_CTRL_REG: POR_VBAT_MASK_N (Bitfield-Mask: 0x01) */

/* --------------------------  CRG_TOP_XTALRDY_CTRL_REG  -------------------------- */
#define CRG_TOP_XTALRDY_CTRL_REG_XTALRDY_CNT_Pos (0UL)                  /*!< CRG_TOP XTALRDY_CTRL_REG: XTALRDY_CNT (Bit 0)               */
#define CRG_TOP_XTALRDY_CTRL_REG_XTALRDY_CNT_Msk (0xffUL)               /*!< CRG_TOP XTALRDY_CTRL_REG: XTALRDY_CNT (Bitfield-Mask: 0xff) */

/* --------------------------  CRG_TOP_XTALRDY_STAT_REG  -------------------------- */
#define CRG_TOP_XTALRDY_STAT_REG_XTALRDY_STAT_Pos (0UL)                 /*!< CRG_TOP XTALRDY_STAT_REG: XTALRDY_STAT (Bit 0)              */
#define CRG_TOP_XTALRDY_STAT_REG_XTALRDY_STAT_Msk (0xffUL)              /*!< CRG_TOP XTALRDY_STAT_REG: XTALRDY_STAT (Bitfield-Mask: 0xff) */

/* ----------------------------  CRG_TOP_LDO_CTRL3_REG  --------------------------- */
#define CRG_TOP_LDO_CTRL3_REG_LDO_VBAT_RET_ENABLE_Pos (0UL)             /*!< CRG_TOP LDO_CTRL3_REG: LDO_VBAT_RET_ENABLE (Bit 0)          */
#define CRG_TOP_LDO_CTRL3_REG_LDO_VBAT_RET_ENABLE_Msk (0x1UL)           /*!< CRG_TOP LDO_CTRL3_REG: LDO_VBAT_RET_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL3_REG_LDO_VBAT_RET_VREF_HOLD_Pos (1UL)          /*!< CRG_TOP LDO_CTRL3_REG: LDO_VBAT_RET_VREF_HOLD (Bit 1)       */
#define CRG_TOP_LDO_CTRL3_REG_LDO_VBAT_RET_VREF_HOLD_Msk (0x2UL)        /*!< CRG_TOP LDO_CTRL3_REG: LDO_VBAT_RET_VREF_HOLD (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL3_REG_LDO_1V8_FLASH_RET_ENABLE_Pos (2UL)        /*!< CRG_TOP LDO_CTRL3_REG: LDO_1V8_FLASH_RET_ENABLE (Bit 2)     */
#define CRG_TOP_LDO_CTRL3_REG_LDO_1V8_FLASH_RET_ENABLE_Msk (0x4UL)      /*!< CRG_TOP LDO_CTRL3_REG: LDO_1V8_FLASH_RET_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL3_REG_LDO_1V8_FLASH_RET_VREF_HOLD_Pos (3UL)     /*!< CRG_TOP LDO_CTRL3_REG: LDO_1V8_FLASH_RET_VREF_HOLD (Bit 3)  */
#define CRG_TOP_LDO_CTRL3_REG_LDO_1V8_FLASH_RET_VREF_HOLD_Msk (0x8UL)   /*!< CRG_TOP LDO_CTRL3_REG: LDO_1V8_FLASH_RET_VREF_HOLD (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL3_REG_LDO_1V8_PA_RET_ENABLE_Pos (4UL)           /*!< CRG_TOP LDO_CTRL3_REG: LDO_1V8_PA_RET_ENABLE (Bit 4)        */
#define CRG_TOP_LDO_CTRL3_REG_LDO_1V8_PA_RET_ENABLE_Msk (0x10UL)        /*!< CRG_TOP LDO_CTRL3_REG: LDO_1V8_PA_RET_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL3_REG_LDO_1V8_PA_RET_VREF_HOLD_Pos (5UL)        /*!< CRG_TOP LDO_CTRL3_REG: LDO_1V8_PA_RET_VREF_HOLD (Bit 5)     */
#define CRG_TOP_LDO_CTRL3_REG_LDO_1V8_PA_RET_VREF_HOLD_Msk (0x20UL)     /*!< CRG_TOP LDO_CTRL3_REG: LDO_1V8_PA_RET_VREF_HOLD (Bitfield-Mask: 0x01) */

