openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* --------------------------  CRG_TOP_XTAL16M_CTRL_REG  -------------------------- */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_FREQ_TRIM_SW2_AMP_Pos (0UL)    /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_FREQ_TRIM_SW2_AMP (Bit 0) */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_FREQ_TRIM_SW2_AMP_Msk (0x7UL)  /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_FREQ_TRIM_SW2_AMP (Bitfield-Mask: 0x07) */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_AMP_REG_SIG_SEL_Pos (3UL)      /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_AMP_REG_SIG_SEL (Bit 3)   */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_AMP_REG_SIG_SEL_Msk (0x8UL)    /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_AMP_REG_SIG_SEL (Bitfield-Mask: 0x01) */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_TST_AON_Pos (4UL)              /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_TST_AON (Bit 4)           */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_TST_AON_Msk (0x30UL)           /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_TST_AON (Bitfield-Mask: 0x03) */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_SH_OVERRULE_Pos (6UL)          /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_SH_OVERRULE (Bit 6)       */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_SH_OVERRULE_Msk (0xc0UL)       /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_SH_OVERRULE (Bitfield-Mask: 0x03) */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_ENABLE_ZERO_Pos (8UL)          /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_ENABLE_ZERO (Bit 8)       */
#define CRG_TOP_XTAL16M_CTRL_REG_XTAL16M_ENABLE_ZERO_Msk (0x100UL)      /*!< CRG_TOP XTAL16M_CTRL_REG: XTAL16M_ENABLE_ZERO (Bitfield-Mask: 0x01) */

/* --------------------------  CRG_TOP_XTAL16M_START_REG  ------------------------- */
#define CRG_TOP_XTAL16M_START_REG_FINE_ADJ_Pos (0UL)                    /*!< CRG_TOP XTAL16M_START_REG: FINE_ADJ (Bit 0)                 */
#define CRG_TOP_XTAL16M_START_REG_FINE_ADJ_Msk (0xffUL)                 /*!< CRG_TOP XTAL16M_START_REG: FINE_ADJ (Bitfield-Mask: 0xff)   */
#define CRG_TOP_XTAL16M_START_REG_COARSE_ADJ_Pos (8UL)                  /*!< CRG_TOP XTAL16M_START_REG: COARSE_ADJ (Bit 8)               */
#define CRG_TOP_XTAL16M_START_REG_COARSE_ADJ_Msk (0x700UL)              /*!< CRG_TOP XTAL16M_START_REG: COARSE_ADJ (Bitfield-Mask: 0x07) */

/* --------------------------  CRG_TOP_XTAL16M_RAMP_REG  -------------------------- */
#define CRG_TOP_XTAL16M_RAMP_REG_FINE_ADJ_Pos (0UL)                     /*!< CRG_TOP XTAL16M_RAMP_REG: FINE_ADJ (Bit 0)                  */
#define CRG_TOP_XTAL16M_RAMP_REG_FINE_ADJ_Msk (0xffUL)                  /*!< CRG_TOP XTAL16M_RAMP_REG: FINE_ADJ (Bitfield-Mask: 0xff)    */
#define CRG_TOP_XTAL16M_RAMP_REG_COARSE_ADJ_Pos (8UL)                   /*!< CRG_TOP XTAL16M_RAMP_REG: COARSE_ADJ (Bit 8)                */
#define CRG_TOP_XTAL16M_RAMP_REG_COARSE_ADJ_Msk (0x700UL)               /*!< CRG_TOP XTAL16M_RAMP_REG: COARSE_ADJ (Bitfield-Mask: 0x07)  */

/* -------------------------  CRG_TOP_XTAL16M_TRSTAT_REG  ------------------------- */
#define CRG_TOP_XTAL16M_TRSTAT_REG_XTAL16M_TRSTAT_Pos (0UL)             /*!< CRG_TOP XTAL16M_TRSTAT_REG: XTAL16M_TRSTAT (Bit 0)          */
#define CRG_TOP_XTAL16M_TRSTAT_REG_XTAL16M_TRSTAT_Msk (0x7fffUL)        /*!< CRG_TOP XTAL16M_TRSTAT_REG: XTAL16M_TRSTAT (Bitfield-Mask: 0x7fff) */

/* ---------------------------  CRG_TOP_RESET_STAT_REG  --------------------------- */
#define CRG_TOP_RESET_STAT_REG_PORESET_STAT_Pos (0UL)                   /*!< CRG_TOP RESET_STAT_REG: PORESET_STAT (Bit 0)                */
#define CRG_TOP_RESET_STAT_REG_PORESET_STAT_Msk (0x1UL)                 /*!< CRG_TOP RESET_STAT_REG: PORESET_STAT (Bitfield-Mask: 0x01)  */
#define CRG_TOP_RESET_STAT_REG_HWRESET_STAT_Pos (1UL)                   /*!< CRG_TOP RESET_STAT_REG: HWRESET_STAT (Bit 1)                */
#define CRG_TOP_RESET_STAT_REG_HWRESET_STAT_Msk (0x2UL)                 /*!< CRG_TOP RESET_STAT_REG: HWRESET_STAT (Bitfield-Mask: 0x01)  */
#define CRG_TOP_RESET_STAT_REG_SWRESET_STAT_Pos (2UL)                   /*!< CRG_TOP RESET_STAT_REG: SWRESET_STAT (Bit 2)                */
#define CRG_TOP_RESET_STAT_REG_SWRESET_STAT_Msk (0x4UL)                 /*!< CRG_TOP RESET_STAT_REG: SWRESET_STAT (Bitfield-Mask: 0x01)  */
#define CRG_TOP_RESET_STAT_REG_WDOGRESET_STAT_Pos (3UL)                 /*!< CRG_TOP RESET_STAT_REG: WDOGRESET_STAT (Bit 3)              */
#define CRG_TOP_RESET_STAT_REG_WDOGRESET_STAT_Msk (0x8UL)               /*!< CRG_TOP RESET_STAT_REG: WDOGRESET_STAT (Bitfield-Mask: 0x01) */
#define CRG_TOP_RESET_STAT_REG_SWD_HWRESET_STAT_Pos (4UL)               /*!< CRG_TOP RESET_STAT_REG: SWD_HWRESET_STAT (Bit 4)            */
#define CRG_TOP_RESET_STAT_REG_SWD_HWRESET_STAT_Msk (0x10UL)            /*!< CRG_TOP RESET_STAT_REG: SWD_HWRESET_STAT (Bitfield-Mask: 0x01) */

/* ---------------------------  CRG_TOP_FORCE_SLEEP_REG  -------------------------- */
#define CRG_TOP_FORCE_SLEEP_REG_FORCE_FTDF_SLEEP_Pos (0UL)              /*!< CRG_TOP FORCE_SLEEP_REG: FORCE_FTDF_SLEEP (Bit 0)           */
#define CRG_TOP_FORCE_SLEEP_REG_FORCE_FTDF_SLEEP_Msk (0x1UL)            /*!< CRG_TOP FORCE_SLEEP_REG: FORCE_FTDF_SLEEP (Bitfield-Mask: 0x01) */
#define CRG_TOP_FORCE_SLEEP_REG_FORCE_BLE_SLEEP_Pos (1UL)               /*!< CRG_TOP FORCE_SLEEP_REG: FORCE_BLE_SLEEP (Bit 1)            */
#define CRG_TOP_FORCE_SLEEP_REG_FORCE_BLE_SLEEP_Msk (0x2UL)             /*!< CRG_TOP FORCE_SLEEP_REG: FORCE_BLE_SLEEP (Bitfield-Mask: 0x01) */

/* --------------------------  CRG_TOP_LDOS_DISABLE_REG  -------------------------- */
#define CRG_TOP_LDOS_DISABLE_REG_LDOS_DISABLE_Pos (0UL)                 /*!< CRG_TOP LDOS_DISABLE_REG: LDOS_DISABLE (Bit 0)              */
#define CRG_TOP_LDOS_DISABLE_REG_LDOS_DISABLE_Msk (0x1UL)               /*!< CRG_TOP LDOS_DISABLE_REG: LDOS_DISABLE (Bitfield-Mask: 0x01) */

/* ----------------------------  CRG_TOP_AON_SPARE_REG  --------------------------- */
#define CRG_TOP_AON_SPARE_REG_OSC16_HOLD_AMP_REG_Pos (0UL)              /*!< CRG_TOP AON_SPARE_REG: OSC16_HOLD_AMP_REG (Bit 0)           */
#define CRG_TOP_AON_SPARE_REG_OSC16_HOLD_AMP_REG_Msk (0x1UL)            /*!< CRG_TOP AON_SPARE_REG: OSC16_HOLD_AMP_REG (Bitfield-Mask: 0x01) */
#define CRG_TOP_AON_SPARE_REG_OSC16_SH_DISABLE_Pos (1UL)                /*!< CRG_TOP AON_SPARE_REG: OSC16_SH_DISABLE (Bit 1)             */
#define CRG_TOP_AON_SPARE_REG_OSC16_SH_DISABLE_Msk (0x2UL)              /*!< CRG_TOP AON_SPARE_REG: OSC16_SH_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_AON_SPARE_REG_EN_BATSYS_RET_Pos (2UL)                   /*!< CRG_TOP AON_SPARE_REG: EN_BATSYS_RET (Bit 2)                */
#define CRG_TOP_AON_SPARE_REG_EN_BATSYS_RET_Msk (0x4UL)                 /*!< CRG_TOP AON_SPARE_REG: EN_BATSYS_RET (Bitfield-Mask: 0x01)  */
#define CRG_TOP_AON_SPARE_REG_EN_BUSSYS_RET_Pos (3UL)                   /*!< CRG_TOP AON_SPARE_REG: EN_BUSSYS_RET (Bit 3)                */
#define CRG_TOP_AON_SPARE_REG_EN_BUSSYS_RET_Msk (0x8UL)                 /*!< CRG_TOP AON_SPARE_REG: EN_BUSSYS_RET (Bitfield-Mask: 0x01)  */

/* ---------------------------  CRG_TOP_SECURE_BOOT_REG  -------------------------- */
#define CRG_TOP_SECURE_BOOT_REG_SECURE_BOOT_Pos (0UL)                   /*!< CRG_TOP SECURE_BOOT_REG: SECURE_BOOT (Bit 0)                */
#define CRG_TOP_SECURE_BOOT_REG_SECURE_BOOT_Msk (0x1UL)                 /*!< CRG_TOP SECURE_BOOT_REG: SECURE_BOOT (Bitfield-Mask: 0x01)  */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_DEBUGGER_OFF_Pos (1UL)            /*!< CRG_TOP SECURE_BOOT_REG: FORCE_DEBUGGER_OFF (Bit 1)         */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_DEBUGGER_OFF_Msk (0x2UL)          /*!< CRG_TOP SECURE_BOOT_REG: FORCE_DEBUGGER_OFF (Bitfield-Mask: 0x01) */

/* -------------------------  CRG_TOP_PMU_RESET_RAIL_REG  ------------------------- */
#define CRG_TOP_PMU_RESET_RAIL_REG_RESET_V14_Pos (0UL)                  /*!< CRG_TOP PMU_RESET_RAIL_REG: RESET_V14 (Bit 0)               */
#define CRG_TOP_PMU_RESET_RAIL_REG_RESET_V14_Msk (0x1UL)                /*!< CRG_TOP PMU_RESET_RAIL_REG: RESET_V14 (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_RESET_RAIL_REG_RESET_V18_Pos (1UL)                  /*!< CRG_TOP PMU_RESET_RAIL_REG: RESET_V18 (Bit 1)               */
#define CRG_TOP_PMU_RESET_RAIL_REG_RESET_V18_Msk (0x2UL)                /*!< CRG_TOP PMU_RESET_RAIL_REG: RESET_V18 (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_RESET_RAIL_REG_RESET_V18P_Pos (2UL)                 /*!< CRG_TOP PMU_RESET_RAIL_REG: RESET_V18P (Bit 2)              */
#define CRG_TOP_PMU_RESET_RAIL_REG_RESET_V18P_Msk (0x4UL)               /*!< CRG_TOP PMU_RESET_RAIL_REG: RESET_V18P (Bitfield-Mask: 0x01) */

