openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* ----------------------------  DMA_DMA7_B_STARTH_REG  --------------------------- */
#define DMA_DMA7_B_STARTH_REG_DMA7_B_STARTH_Pos (0UL)                   /*!< DMA DMA7_B_STARTH_REG: DMA7_B_STARTH (Bit 0)                */
#define DMA_DMA7_B_STARTH_REG_DMA7_B_STARTH_Msk (0xffffUL)              /*!< DMA DMA7_B_STARTH_REG: DMA7_B_STARTH (Bitfield-Mask: 0xffff) */

/* ------------------------------  DMA_DMA7_INT_REG  ------------------------------ */
#define DMA_DMA7_INT_REG_DMA7_INT_Pos         (0UL)                     /*!< DMA DMA7_INT_REG: DMA7_INT (Bit 0)                          */
#define DMA_DMA7_INT_REG_DMA7_INT_Msk         (0xffffUL)                /*!< DMA DMA7_INT_REG: DMA7_INT (Bitfield-Mask: 0xffff)          */

/* ------------------------------  DMA_DMA7_LEN_REG  ------------------------------ */
#define DMA_DMA7_LEN_REG_DMA7_LEN_Pos         (0UL)                     /*!< DMA DMA7_LEN_REG: DMA7_LEN (Bit 0)                          */
#define DMA_DMA7_LEN_REG_DMA7_LEN_Msk         (0xffffUL)                /*!< DMA DMA7_LEN_REG: DMA7_LEN (Bitfield-Mask: 0xffff)          */

/* ------------------------------  DMA_DMA7_CTRL_REG  ----------------------------- */
#define DMA_DMA7_CTRL_REG_DMA_ON_Pos          (0UL)                     /*!< DMA DMA7_CTRL_REG: DMA_ON (Bit 0)                           */
#define DMA_DMA7_CTRL_REG_DMA_ON_Msk          (0x1UL)                   /*!< DMA DMA7_CTRL_REG: DMA_ON (Bitfield-Mask: 0x01)             */
#define DMA_DMA7_CTRL_REG_BW_Pos              (1UL)                     /*!< DMA DMA7_CTRL_REG: BW (Bit 1)                               */
#define DMA_DMA7_CTRL_REG_BW_Msk              (0x6UL)                   /*!< DMA DMA7_CTRL_REG: BW (Bitfield-Mask: 0x03)                 */
#define DMA_DMA7_CTRL_REG_IRQ_ENABLE_Pos      (3UL)                     /*!< DMA DMA7_CTRL_REG: IRQ_ENABLE (Bit 3)                       */
#define DMA_DMA7_CTRL_REG_IRQ_ENABLE_Msk      (0x8UL)                   /*!< DMA DMA7_CTRL_REG: IRQ_ENABLE (Bitfield-Mask: 0x01)         */
#define DMA_DMA7_CTRL_REG_DREQ_MODE_Pos       (4UL)                     /*!< DMA DMA7_CTRL_REG: DREQ_MODE (Bit 4)                        */
#define DMA_DMA7_CTRL_REG_DREQ_MODE_Msk       (0x10UL)                  /*!< DMA DMA7_CTRL_REG: DREQ_MODE (Bitfield-Mask: 0x01)          */
#define DMA_DMA7_CTRL_REG_BINC_Pos            (5UL)                     /*!< DMA DMA7_CTRL_REG: BINC (Bit 5)                             */
#define DMA_DMA7_CTRL_REG_BINC_Msk            (0x20UL)                  /*!< DMA DMA7_CTRL_REG: BINC (Bitfield-Mask: 0x01)               */
#define DMA_DMA7_CTRL_REG_AINC_Pos            (6UL)                     /*!< DMA DMA7_CTRL_REG: AINC (Bit 6)                             */
#define DMA_DMA7_CTRL_REG_AINC_Msk            (0x40UL)                  /*!< DMA DMA7_CTRL_REG: AINC (Bitfield-Mask: 0x01)               */
#define DMA_DMA7_CTRL_REG_CIRCULAR_Pos        (7UL)                     /*!< DMA DMA7_CTRL_REG: CIRCULAR (Bit 7)                         */
#define DMA_DMA7_CTRL_REG_CIRCULAR_Msk        (0x80UL)                  /*!< DMA DMA7_CTRL_REG: CIRCULAR (Bitfield-Mask: 0x01)           */
#define DMA_DMA7_CTRL_REG_DMA_PRIO_Pos        (8UL)                     /*!< DMA DMA7_CTRL_REG: DMA_PRIO (Bit 8)                         */
#define DMA_DMA7_CTRL_REG_DMA_PRIO_Msk        (0x700UL)                 /*!< DMA DMA7_CTRL_REG: DMA_PRIO (Bitfield-Mask: 0x07)           */
#define DMA_DMA7_CTRL_REG_DMA_IDLE_Pos        (11UL)                    /*!< DMA DMA7_CTRL_REG: DMA_IDLE (Bit 11)                        */
#define DMA_DMA7_CTRL_REG_DMA_IDLE_Msk        (0x800UL)                 /*!< DMA DMA7_CTRL_REG: DMA_IDLE (Bitfield-Mask: 0x01)           */
#define DMA_DMA7_CTRL_REG_DMA_INIT_Pos        (12UL)                    /*!< DMA DMA7_CTRL_REG: DMA_INIT (Bit 12)                        */
#define DMA_DMA7_CTRL_REG_DMA_INIT_Msk        (0x1000UL)                /*!< DMA DMA7_CTRL_REG: DMA_INIT (Bitfield-Mask: 0x01)           */
#define DMA_DMA7_CTRL_REG_REQ_SENSE_Pos       (13UL)                    /*!< DMA DMA7_CTRL_REG: REQ_SENSE (Bit 13)                       */
#define DMA_DMA7_CTRL_REG_REQ_SENSE_Msk       (0x2000UL)                /*!< DMA DMA7_CTRL_REG: REQ_SENSE (Bitfield-Mask: 0x01)          */

/* ------------------------------  DMA_DMA7_IDX_REG  ------------------------------ */
#define DMA_DMA7_IDX_REG_DMA7_IDX_Pos         (0UL)                     /*!< DMA DMA7_IDX_REG: DMA7_IDX (Bit 0)                          */
#define DMA_DMA7_IDX_REG_DMA7_IDX_Msk         (0xffffUL)                /*!< DMA DMA7_IDX_REG: DMA7_IDX (Bitfield-Mask: 0xffff)          */

/* -----------------------------  DMA_DMA_REQ_MUX_REG  ---------------------------- */
#define DMA_DMA_REQ_MUX_REG_DMA01_SEL_Pos     (0UL)                     /*!< DMA DMA_REQ_MUX_REG: DMA01_SEL (Bit 0)                      */
#define DMA_DMA_REQ_MUX_REG_DMA01_SEL_Msk     (0xfUL)                   /*!< DMA DMA_REQ_MUX_REG: DMA01_SEL (Bitfield-Mask: 0x0f)        */
#define DMA_DMA_REQ_MUX_REG_DMA23_SEL_Pos     (4UL)                     /*!< DMA DMA_REQ_MUX_REG: DMA23_SEL (Bit 4)                      */
#define DMA_DMA_REQ_MUX_REG_DMA23_SEL_Msk     (0xf0UL)                  /*!< DMA DMA_REQ_MUX_REG: DMA23_SEL (Bitfield-Mask: 0x0f)        */
#define DMA_DMA_REQ_MUX_REG_DMA45_SEL_Pos     (8UL)                     /*!< DMA DMA_REQ_MUX_REG: DMA45_SEL (Bit 8)                      */
#define DMA_DMA_REQ_MUX_REG_DMA45_SEL_Msk     (0xf00UL)                 /*!< DMA DMA_REQ_MUX_REG: DMA45_SEL (Bitfield-Mask: 0x0f)        */
#define DMA_DMA_REQ_MUX_REG_DMA67_SEL_Pos     (12UL)                    /*!< DMA DMA_REQ_MUX_REG: DMA67_SEL (Bit 12)                     */
#define DMA_DMA_REQ_MUX_REG_DMA67_SEL_Msk     (0xf000UL)                /*!< DMA DMA_REQ_MUX_REG: DMA67_SEL (Bitfield-Mask: 0x0f)        */

/* ---------------------------  DMA_DMA_INT_STATUS_REG  --------------------------- */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH0_Pos (0UL)                    /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH0 (Bit 0)                 */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH0_Msk (0x1UL)                  /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH0 (Bitfield-Mask: 0x01)   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH1_Pos (1UL)                    /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH1 (Bit 1)                 */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH1_Msk (0x2UL)                  /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH1 (Bitfield-Mask: 0x01)   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH2_Pos (2UL)                    /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH2 (Bit 2)                 */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH2_Msk (0x4UL)                  /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH2 (Bitfield-Mask: 0x01)   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH3_Pos (3UL)                    /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH3 (Bit 3)                 */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH3_Msk (0x8UL)                  /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH3 (Bitfield-Mask: 0x01)   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH4_Pos (4UL)                    /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH4 (Bit 4)                 */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH4_Msk (0x10UL)                 /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH4 (Bitfield-Mask: 0x01)   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH5_Pos (5UL)                    /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH5 (Bit 5)                 */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH5_Msk (0x20UL)                 /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH5 (Bitfield-Mask: 0x01)   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH6_Pos (6UL)                    /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH6 (Bit 6)                 */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH6_Msk (0x40UL)                 /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH6 (Bitfield-Mask: 0x01)   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH7_Pos (7UL)                    /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH7 (Bit 7)                 */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH7_Msk (0x80UL)                 /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH7 (Bitfield-Mask: 0x01)   */

/* ----------------------------  DMA_DMA_CLEAR_INT_REG  --------------------------- */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH0_Pos (0UL)                 /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH0 (Bit 0)              */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH0_Msk (0x1UL)               /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH0 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH1_Pos (1UL)                 /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH1 (Bit 1)              */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH1_Msk (0x2UL)               /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH1 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH2_Pos (2UL)                 /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH2 (Bit 2)              */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH2_Msk (0x4UL)               /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH2 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH3_Pos (3UL)                 /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH3 (Bit 3)              */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH3_Msk (0x8UL)               /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH3 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH4_Pos (4UL)                 /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH4 (Bit 4)              */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH4_Msk (0x10UL)              /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH4 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH5_Pos (5UL)                 /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH5 (Bit 5)              */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH5_Msk (0x20UL)              /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH5 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH6_Pos (6UL)                 /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH6 (Bit 6)              */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH6_Msk (0x40UL)              /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH6 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH7_Pos (7UL)                 /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH7 (Bit 7)              */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH7_Msk (0x80UL)              /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH7 (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================          struct 'ECC' Position & Mask          ================ */
/* ================================================================================ */


