openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* --------------------------  FTDF_FTDF_TX_FIFO_0_0_REG  ------------------------- */
#define FTDF_FTDF_TX_FIFO_0_0_REG_TX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_TX_FIFO_0_0_REG: TX_FIFO (Bit 0)                  */
#define FTDF_FTDF_TX_FIFO_0_0_REG_TX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_TX_FIFO_0_0_REG: TX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_TX_FIFO_1_0_REG  ------------------------- */
#define FTDF_FTDF_TX_FIFO_1_0_REG_TX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_TX_FIFO_1_0_REG: TX_FIFO (Bit 0)                  */
#define FTDF_FTDF_TX_FIFO_1_0_REG_TX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_TX_FIFO_1_0_REG: TX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_TX_FIFO_2_0_REG  ------------------------- */
#define FTDF_FTDF_TX_FIFO_2_0_REG_TX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_TX_FIFO_2_0_REG: TX_FIFO (Bit 0)                  */
#define FTDF_FTDF_TX_FIFO_2_0_REG_TX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_TX_FIFO_2_0_REG: TX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_TX_FIFO_3_0_REG  ------------------------- */
#define FTDF_FTDF_TX_FIFO_3_0_REG_TX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_TX_FIFO_3_0_REG: TX_FIFO (Bit 0)                  */
#define FTDF_FTDF_TX_FIFO_3_0_REG_TX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_TX_FIFO_3_0_REG: TX_FIFO (Bitfield-Mask: 0xffffffff) */

/* -----------------------  FTDF_FTDF_TX_META_DATA_0_0_REG  ----------------------- */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_FRAME_LENGTH_Pos (0UL)           /*!< FTDF FTDF_TX_META_DATA_0_0_REG: FRAME_LENGTH (Bit 0)        */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_FRAME_LENGTH_Msk (0x7fUL)        /*!< FTDF FTDF_TX_META_DATA_0_0_REG: FRAME_LENGTH (Bitfield-Mask: 0x7f) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_DEM_PTI_Pos (7UL)        /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_DEM_PTI (Bit 7)     */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_DEM_PTI_Msk (0x780UL)    /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_DEM_PTI (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_CN_Pos (11UL)            /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_CN (Bit 11)         */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_CN_Msk (0x7800UL)        /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_CN (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_CALCAP_Pos (15UL)        /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_CALCAP (Bit 15)     */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_CALCAP_Msk (0x78000UL)   /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_CALCAP (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_RF_GPIO_PINS_Pos (19UL)  /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_RF_GPIO_PINS (Bit 19) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_RF_GPIO_PINS_Msk (0x380000UL) /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_RF_GPIO_PINS (Bitfield-Mask: 0x07) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_HSI_Pos (22UL)           /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_HSI (Bit 22)        */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_PHYATTR_HSI_Msk (0x400000UL)     /*!< FTDF FTDF_TX_META_DATA_0_0_REG: PHYATTR_HSI (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_FRAMETYPE_Pos (23UL)             /*!< FTDF FTDF_TX_META_DATA_0_0_REG: FRAMETYPE (Bit 23)          */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_FRAMETYPE_Msk (0x3800000UL)      /*!< FTDF FTDF_TX_META_DATA_0_0_REG: FRAMETYPE (Bitfield-Mask: 0x07) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_CSMACA_ENA_Pos (26UL)            /*!< FTDF FTDF_TX_META_DATA_0_0_REG: CSMACA_ENA (Bit 26)         */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_CSMACA_ENA_Msk (0x4000000UL)     /*!< FTDF FTDF_TX_META_DATA_0_0_REG: CSMACA_ENA (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_ACKREQUEST_Pos (28UL)            /*!< FTDF FTDF_TX_META_DATA_0_0_REG: ACKREQUEST (Bit 28)         */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_ACKREQUEST_Msk (0x10000000UL)    /*!< FTDF FTDF_TX_META_DATA_0_0_REG: ACKREQUEST (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_CRC16_ENA_Pos (30UL)             /*!< FTDF FTDF_TX_META_DATA_0_0_REG: CRC16_ENA (Bit 30)          */
#define FTDF_FTDF_TX_META_DATA_0_0_REG_CRC16_ENA_Msk (0x40000000UL)     /*!< FTDF FTDF_TX_META_DATA_0_0_REG: CRC16_ENA (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_META_DATA_1_0_REG  ----------------------- */
#define FTDF_FTDF_TX_META_DATA_1_0_REG_MACSN_Pos (0UL)                  /*!< FTDF FTDF_TX_META_DATA_1_0_REG: MACSN (Bit 0)               */
#define FTDF_FTDF_TX_META_DATA_1_0_REG_MACSN_Msk (0xffUL)               /*!< FTDF FTDF_TX_META_DATA_1_0_REG: MACSN (Bitfield-Mask: 0xff) */

/* -----------------------  FTDF_FTDF_TX_META_DATA_0_1_REG  ----------------------- */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_FRAME_LENGTH_Pos (0UL)           /*!< FTDF FTDF_TX_META_DATA_0_1_REG: FRAME_LENGTH (Bit 0)        */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_FRAME_LENGTH_Msk (0x7fUL)        /*!< FTDF FTDF_TX_META_DATA_0_1_REG: FRAME_LENGTH (Bitfield-Mask: 0x7f) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_DEM_PTI_Pos (7UL)        /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_DEM_PTI (Bit 7)     */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_DEM_PTI_Msk (0x780UL)    /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_DEM_PTI (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_CN_Pos (11UL)            /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_CN (Bit 11)         */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_CN_Msk (0x7800UL)        /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_CN (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_CALCAP_Pos (15UL)        /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_CALCAP (Bit 15)     */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_CALCAP_Msk (0x78000UL)   /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_CALCAP (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_RF_GPIO_PINS_Pos (19UL)  /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_RF_GPIO_PINS (Bit 19) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_RF_GPIO_PINS_Msk (0x380000UL) /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_RF_GPIO_PINS (Bitfield-Mask: 0x07) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_HSI_Pos (22UL)           /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_HSI (Bit 22)        */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_PHYATTR_HSI_Msk (0x400000UL)     /*!< FTDF FTDF_TX_META_DATA_0_1_REG: PHYATTR_HSI (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_FRAMETYPE_Pos (23UL)             /*!< FTDF FTDF_TX_META_DATA_0_1_REG: FRAMETYPE (Bit 23)          */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_FRAMETYPE_Msk (0x3800000UL)      /*!< FTDF FTDF_TX_META_DATA_0_1_REG: FRAMETYPE (Bitfield-Mask: 0x07) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_CSMACA_ENA_Pos (26UL)            /*!< FTDF FTDF_TX_META_DATA_0_1_REG: CSMACA_ENA (Bit 26)         */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_CSMACA_ENA_Msk (0x4000000UL)     /*!< FTDF FTDF_TX_META_DATA_0_1_REG: CSMACA_ENA (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_ACKREQUEST_Pos (28UL)            /*!< FTDF FTDF_TX_META_DATA_0_1_REG: ACKREQUEST (Bit 28)         */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_ACKREQUEST_Msk (0x10000000UL)    /*!< FTDF FTDF_TX_META_DATA_0_1_REG: ACKREQUEST (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_CRC16_ENA_Pos (30UL)             /*!< FTDF FTDF_TX_META_DATA_0_1_REG: CRC16_ENA (Bit 30)          */
#define FTDF_FTDF_TX_META_DATA_0_1_REG_CRC16_ENA_Msk (0x40000000UL)     /*!< FTDF FTDF_TX_META_DATA_0_1_REG: CRC16_ENA (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_META_DATA_1_1_REG  ----------------------- */
#define FTDF_FTDF_TX_META_DATA_1_1_REG_MACSN_Pos (0UL)                  /*!< FTDF FTDF_TX_META_DATA_1_1_REG: MACSN (Bit 0)               */
#define FTDF_FTDF_TX_META_DATA_1_1_REG_MACSN_Msk (0xffUL)               /*!< FTDF FTDF_TX_META_DATA_1_1_REG: MACSN (Bitfield-Mask: 0xff) */

