openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* --------------------------  FTDF_FTDF_RX_META_0_2_REG  ------------------------- */
#define FTDF_FTDF_RX_META_0_2_REG_RX_TIMESTAMP_Pos (0UL)                /*!< FTDF FTDF_RX_META_0_2_REG: RX_TIMESTAMP (Bit 0)             */
#define FTDF_FTDF_RX_META_0_2_REG_RX_TIMESTAMP_Msk (0xffffffffUL)       /*!< FTDF FTDF_RX_META_0_2_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_META_1_2_REG  ------------------------- */
#define FTDF_FTDF_RX_META_1_2_REG_CRC16_ERROR_Pos (0UL)                 /*!< FTDF FTDF_RX_META_1_2_REG: CRC16_ERROR (Bit 0)              */
#define FTDF_FTDF_RX_META_1_2_REG_CRC16_ERROR_Msk (0x1UL)               /*!< FTDF FTDF_RX_META_1_2_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_RES_FRM_TYPE_ERROR_Pos (2UL)          /*!< FTDF FTDF_RX_META_1_2_REG: RES_FRM_TYPE_ERROR (Bit 2)       */
#define FTDF_FTDF_RX_META_1_2_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)        /*!< FTDF FTDF_RX_META_1_2_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_RES_FRM_VERSION_ERROR_Pos (3UL)       /*!< FTDF FTDF_RX_META_1_2_REG: RES_FRM_VERSION_ERROR (Bit 3)    */
#define FTDF_FTDF_RX_META_1_2_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL)     /*!< FTDF FTDF_RX_META_1_2_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_DPANID_ERROR_Pos (4UL)                /*!< FTDF FTDF_RX_META_1_2_REG: DPANID_ERROR (Bit 4)             */
#define FTDF_FTDF_RX_META_1_2_REG_DPANID_ERROR_Msk (0x10UL)             /*!< FTDF FTDF_RX_META_1_2_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_DADDR_ERROR_Pos (5UL)                 /*!< FTDF FTDF_RX_META_1_2_REG: DADDR_ERROR (Bit 5)              */
#define FTDF_FTDF_RX_META_1_2_REG_DADDR_ERROR_Msk (0x20UL)              /*!< FTDF FTDF_RX_META_1_2_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_SPANID_ERROR_Pos (6UL)                /*!< FTDF FTDF_RX_META_1_2_REG: SPANID_ERROR (Bit 6)             */
#define FTDF_FTDF_RX_META_1_2_REG_SPANID_ERROR_Msk (0x40UL)             /*!< FTDF FTDF_RX_META_1_2_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_ISPANID_COORD_ERROR_Pos (7UL)         /*!< FTDF FTDF_RX_META_1_2_REG: ISPANID_COORD_ERROR (Bit 7)      */
#define FTDF_FTDF_RX_META_1_2_REG_ISPANID_COORD_ERROR_Msk (0x80UL)      /*!< FTDF FTDF_RX_META_1_2_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_QUALITY_INDICATOR_Pos (8UL)           /*!< FTDF FTDF_RX_META_1_2_REG: QUALITY_INDICATOR (Bit 8)        */
#define FTDF_FTDF_RX_META_1_2_REG_QUALITY_INDICATOR_Msk (0xff00UL)      /*!< FTDF FTDF_RX_META_1_2_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */

/* --------------------------  FTDF_FTDF_RX_META_0_3_REG  ------------------------- */
#define FTDF_FTDF_RX_META_0_3_REG_RX_TIMESTAMP_Pos (0UL)                /*!< FTDF FTDF_RX_META_0_3_REG: RX_TIMESTAMP (Bit 0)             */
#define FTDF_FTDF_RX_META_0_3_REG_RX_TIMESTAMP_Msk (0xffffffffUL)       /*!< FTDF FTDF_RX_META_0_3_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_META_1_3_REG  ------------------------- */
#define FTDF_FTDF_RX_META_1_3_REG_CRC16_ERROR_Pos (0UL)                 /*!< FTDF FTDF_RX_META_1_3_REG: CRC16_ERROR (Bit 0)              */
#define FTDF_FTDF_RX_META_1_3_REG_CRC16_ERROR_Msk (0x1UL)               /*!< FTDF FTDF_RX_META_1_3_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_RES_FRM_TYPE_ERROR_Pos (2UL)          /*!< FTDF FTDF_RX_META_1_3_REG: RES_FRM_TYPE_ERROR (Bit 2)       */
#define FTDF_FTDF_RX_META_1_3_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)        /*!< FTDF FTDF_RX_META_1_3_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_RES_FRM_VERSION_ERROR_Pos (3UL)       /*!< FTDF FTDF_RX_META_1_3_REG: RES_FRM_VERSION_ERROR (Bit 3)    */
#define FTDF_FTDF_RX_META_1_3_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL)     /*!< FTDF FTDF_RX_META_1_3_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_DPANID_ERROR_Pos (4UL)                /*!< FTDF FTDF_RX_META_1_3_REG: DPANID_ERROR (Bit 4)             */
#define FTDF_FTDF_RX_META_1_3_REG_DPANID_ERROR_Msk (0x10UL)             /*!< FTDF FTDF_RX_META_1_3_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_DADDR_ERROR_Pos (5UL)                 /*!< FTDF FTDF_RX_META_1_3_REG: DADDR_ERROR (Bit 5)              */
#define FTDF_FTDF_RX_META_1_3_REG_DADDR_ERROR_Msk (0x20UL)              /*!< FTDF FTDF_RX_META_1_3_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_SPANID_ERROR_Pos (6UL)                /*!< FTDF FTDF_RX_META_1_3_REG: SPANID_ERROR (Bit 6)             */
#define FTDF_FTDF_RX_META_1_3_REG_SPANID_ERROR_Msk (0x40UL)             /*!< FTDF FTDF_RX_META_1_3_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_ISPANID_COORD_ERROR_Pos (7UL)         /*!< FTDF FTDF_RX_META_1_3_REG: ISPANID_COORD_ERROR (Bit 7)      */
#define FTDF_FTDF_RX_META_1_3_REG_ISPANID_COORD_ERROR_Msk (0x80UL)      /*!< FTDF FTDF_RX_META_1_3_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_QUALITY_INDICATOR_Pos (8UL)           /*!< FTDF FTDF_RX_META_1_3_REG: QUALITY_INDICATOR (Bit 8)        */
#define FTDF_FTDF_RX_META_1_3_REG_QUALITY_INDICATOR_Msk (0xff00UL)      /*!< FTDF FTDF_RX_META_1_3_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */

/* --------------------------  FTDF_FTDF_RX_META_0_4_REG  ------------------------- */
#define FTDF_FTDF_RX_META_0_4_REG_RX_TIMESTAMP_Pos (0UL)                /*!< FTDF FTDF_RX_META_0_4_REG: RX_TIMESTAMP (Bit 0)             */
#define FTDF_FTDF_RX_META_0_4_REG_RX_TIMESTAMP_Msk (0xffffffffUL)       /*!< FTDF FTDF_RX_META_0_4_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_META_1_4_REG  ------------------------- */
#define FTDF_FTDF_RX_META_1_4_REG_CRC16_ERROR_Pos (0UL)                 /*!< FTDF FTDF_RX_META_1_4_REG: CRC16_ERROR (Bit 0)              */
#define FTDF_FTDF_RX_META_1_4_REG_CRC16_ERROR_Msk (0x1UL)               /*!< FTDF FTDF_RX_META_1_4_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_RES_FRM_TYPE_ERROR_Pos (2UL)          /*!< FTDF FTDF_RX_META_1_4_REG: RES_FRM_TYPE_ERROR (Bit 2)       */
#define FTDF_FTDF_RX_META_1_4_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)        /*!< FTDF FTDF_RX_META_1_4_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_RES_FRM_VERSION_ERROR_Pos (3UL)       /*!< FTDF FTDF_RX_META_1_4_REG: RES_FRM_VERSION_ERROR (Bit 3)    */
#define FTDF_FTDF_RX_META_1_4_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL)     /*!< FTDF FTDF_RX_META_1_4_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_DPANID_ERROR_Pos (4UL)                /*!< FTDF FTDF_RX_META_1_4_REG: DPANID_ERROR (Bit 4)             */
#define FTDF_FTDF_RX_META_1_4_REG_DPANID_ERROR_Msk (0x10UL)             /*!< FTDF FTDF_RX_META_1_4_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_DADDR_ERROR_Pos (5UL)                 /*!< FTDF FTDF_RX_META_1_4_REG: DADDR_ERROR (Bit 5)              */
#define FTDF_FTDF_RX_META_1_4_REG_DADDR_ERROR_Msk (0x20UL)              /*!< FTDF FTDF_RX_META_1_4_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_SPANID_ERROR_Pos (6UL)                /*!< FTDF FTDF_RX_META_1_4_REG: SPANID_ERROR (Bit 6)             */
#define FTDF_FTDF_RX_META_1_4_REG_SPANID_ERROR_Msk (0x40UL)             /*!< FTDF FTDF_RX_META_1_4_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_ISPANID_COORD_ERROR_Pos (7UL)         /*!< FTDF FTDF_RX_META_1_4_REG: ISPANID_COORD_ERROR (Bit 7)      */
#define FTDF_FTDF_RX_META_1_4_REG_ISPANID_COORD_ERROR_Msk (0x80UL)      /*!< FTDF FTDF_RX_META_1_4_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_QUALITY_INDICATOR_Pos (8UL)           /*!< FTDF FTDF_RX_META_1_4_REG: QUALITY_INDICATOR (Bit 8)        */
#define FTDF_FTDF_RX_META_1_4_REG_QUALITY_INDICATOR_Msk (0xff00UL)      /*!< FTDF FTDF_RX_META_1_4_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */

/* --------------------------  FTDF_FTDF_RX_META_0_5_REG  ------------------------- */
#define FTDF_FTDF_RX_META_0_5_REG_RX_TIMESTAMP_Pos (0UL)                /*!< FTDF FTDF_RX_META_0_5_REG: RX_TIMESTAMP (Bit 0)             */
#define FTDF_FTDF_RX_META_0_5_REG_RX_TIMESTAMP_Msk (0xffffffffUL)       /*!< FTDF FTDF_RX_META_0_5_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */

