openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* ----------------------  FTDF_FTDF_MACRXSTDACKFRMOKCNT_REG  --------------------- */
#define FTDF_FTDF_MACRXSTDACKFRMOKCNT_REG_MACRXSTDACKFRMOKCNT_Pos (0UL) /*!< FTDF FTDF_MACRXSTDACKFRMOKCNT_REG: MACRXSTDACKFRMOKCNT (Bit 0) */
#define FTDF_FTDF_MACRXSTDACKFRMOKCNT_REG_MACRXSTDACKFRMOKCNT_Msk (0xffffffffUL) /*!< FTDF FTDF_MACRXSTDACKFRMOKCNT_REG: MACRXSTDACKFRMOKCNT (Bitfield-Mask: 0xffffffff) */

/* ----------------------  FTDF_FTDF_MACRXADDRFAILFRMCNT_REG  --------------------- */
#define FTDF_FTDF_MACRXADDRFAILFRMCNT_REG_MACRXADDRFAILFRMCNT_Pos (0UL) /*!< FTDF FTDF_MACRXADDRFAILFRMCNT_REG: MACRXADDRFAILFRMCNT (Bit 0) */
#define FTDF_FTDF_MACRXADDRFAILFRMCNT_REG_MACRXADDRFAILFRMCNT_Msk (0xffffffffUL) /*!< FTDF FTDF_MACRXADDRFAILFRMCNT_REG: MACRXADDRFAILFRMCNT (Bitfield-Mask: 0xffffffff) */

/* -----------------------  FTDF_FTDF_MACRXUNSUPFRMCNT_REG  ----------------------- */
#define FTDF_FTDF_MACRXUNSUPFRMCNT_REG_MACRXUNSUPFRMCNT_Pos (0UL)       /*!< FTDF FTDF_MACRXUNSUPFRMCNT_REG: MACRXUNSUPFRMCNT (Bit 0)    */
#define FTDF_FTDF_MACRXUNSUPFRMCNT_REG_MACRXUNSUPFRMCNT_Msk (0xffffffffUL) /*!< FTDF FTDF_MACRXUNSUPFRMCNT_REG: MACRXUNSUPFRMCNT (Bitfield-Mask: 0xffffffff) */

/* ---------------------  FTDF_FTDF_SYNCTIMESTAMPPHASEVAL_REG  -------------------- */
#define FTDF_FTDF_SYNCTIMESTAMPPHASEVAL_REG_SYNCTIMESTAMPPHASEVAL_Pos (0UL) /*!< FTDF FTDF_SYNCTIMESTAMPPHASEVAL_REG: SYNCTIMESTAMPPHASEVAL (Bit 0) */
#define FTDF_FTDF_SYNCTIMESTAMPPHASEVAL_REG_SYNCTIMESTAMPPHASEVAL_Msk (0xffUL) /*!< FTDF FTDF_SYNCTIMESTAMPPHASEVAL_REG: SYNCTIMESTAMPPHASEVAL (Bitfield-Mask: 0xff) */

/* -----------------------  FTDF_FTDF_MACFCSERRORCOUNT_REG  ----------------------- */
#define FTDF_FTDF_MACFCSERRORCOUNT_REG_MACFCSERRORCOUNT_Pos (0UL)       /*!< FTDF FTDF_MACFCSERRORCOUNT_REG: MACFCSERRORCOUNT (Bit 0)    */
#define FTDF_FTDF_MACFCSERRORCOUNT_REG_MACFCSERRORCOUNT_Msk (0xffffffffUL) /*!< FTDF FTDF_MACFCSERRORCOUNT_REG: MACFCSERRORCOUNT (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  FTDF_FTDF_LMACRESET_REG  -------------------------- */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_CONTROL_Pos (0UL)             /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_CONTROL (Bit 0)          */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_CONTROL_Msk (0x1UL)           /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_CONTROL (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_RX_Pos (1UL)                  /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_RX (Bit 1)               */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_RX_Msk (0x2UL)                /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_RX (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_TX_Pos (2UL)                  /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_TX (Bit 2)               */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_TX_Msk (0x4UL)                /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_TX (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_AHB_Pos (3UL)                 /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_AHB (Bit 3)              */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_AHB_Msk (0x8UL)               /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_AHB (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_OREG_Pos (4UL)                /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_OREG (Bit 4)             */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_OREG_Msk (0x10UL)             /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_OREG (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_TSTIM_Pos (6UL)               /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_TSTIM (Bit 6)            */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_TSTIM_Msk (0x40UL)            /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_TSTIM (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_SEC_Pos (7UL)                 /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_SEC (Bit 7)              */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_SEC_Msk (0x80UL)              /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_SEC (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_COUNT_Pos (9UL)               /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_COUNT (Bit 9)            */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_COUNT_Msk (0x200UL)           /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_COUNT (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_TIMCTRL_Pos (10UL)            /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_TIMCTRL (Bit 10)         */
#define FTDF_FTDF_LMACRESET_REG_LMACRESET_TIMCTRL_Msk (0x400UL)         /*!< FTDF FTDF_LMACRESET_REG: LMACRESET_TIMCTRL (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMACRESET_REG_LMACGLOBRESET_COUNT_Pos (16UL)          /*!< FTDF FTDF_LMACRESET_REG: LMACGLOBRESET_COUNT (Bit 16)       */
#define FTDF_FTDF_LMACRESET_REG_LMACGLOBRESET_COUNT_Msk (0x10000UL)     /*!< FTDF FTDF_LMACRESET_REG: LMACGLOBRESET_COUNT (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_WAKEUP_CONTROL_OS_REG  ---------------------- */
#define FTDF_FTDF_WAKEUP_CONTROL_OS_REG_WAKEUPTIMERENABLE_SET_Pos (0UL) /*!< FTDF FTDF_WAKEUP_CONTROL_OS_REG: WAKEUPTIMERENABLE_SET (Bit 0) */
#define FTDF_FTDF_WAKEUP_CONTROL_OS_REG_WAKEUPTIMERENABLE_SET_Msk (0x1UL) /*!< FTDF FTDF_WAKEUP_CONTROL_OS_REG: WAKEUPTIMERENABLE_SET (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_WAKEUP_CONTROL_OS_REG_WAKEUPTIMERENABLE_CLEAR_Pos (1UL) /*!< FTDF FTDF_WAKEUP_CONTROL_OS_REG: WAKEUPTIMERENABLE_CLEAR (Bit 1) */
#define FTDF_FTDF_WAKEUP_CONTROL_OS_REG_WAKEUPTIMERENABLE_CLEAR_Msk (0x2UL) /*!< FTDF FTDF_WAKEUP_CONTROL_OS_REG: WAKEUPTIMERENABLE_CLEAR (Bitfield-Mask: 0x01) */

/* -------------------------  FTDF_FTDF_SYMBOLTIMETHR_REG  ------------------------ */
#define FTDF_FTDF_SYMBOLTIMETHR_REG_SYMBOLTIMETHR_Pos (0UL)             /*!< FTDF FTDF_SYMBOLTIMETHR_REG: SYMBOLTIMETHR (Bit 0)          */
#define FTDF_FTDF_SYMBOLTIMETHR_REG_SYMBOLTIMETHR_Msk (0xffffffffUL)    /*!< FTDF FTDF_SYMBOLTIMETHR_REG: SYMBOLTIMETHR (Bitfield-Mask: 0xffffffff) */

/* ------------------------  FTDF_FTDF_SYMBOLTIME2THR_REG  ------------------------ */
#define FTDF_FTDF_SYMBOLTIME2THR_REG_SYMBOLTIME2THR_Pos (0UL)           /*!< FTDF FTDF_SYMBOLTIME2THR_REG: SYMBOLTIME2THR (Bit 0)        */
#define FTDF_FTDF_SYMBOLTIME2THR_REG_SYMBOLTIME2THR_Msk (0xffffffffUL)  /*!< FTDF FTDF_SYMBOLTIME2THR_REG: SYMBOLTIME2THR (Bitfield-Mask: 0xffffffff) */

/* -------------------------  FTDF_FTDF_DEBUGCONTROL_REG  ------------------------- */
#define FTDF_FTDF_DEBUGCONTROL_REG_DBG_RX_INPUT_Pos (8UL)               /*!< FTDF FTDF_DEBUGCONTROL_REG: DBG_RX_INPUT (Bit 8)            */
#define FTDF_FTDF_DEBUGCONTROL_REG_DBG_RX_INPUT_Msk (0x100UL)           /*!< FTDF FTDF_DEBUGCONTROL_REG: DBG_RX_INPUT (Bitfield-Mask: 0x01) */

/* ---------------------------  FTDF_FTDF_TXBYTE_E_REG  --------------------------- */
#define FTDF_FTDF_TXBYTE_E_REG_TXBYTE_E_Pos   (0UL)                     /*!< FTDF FTDF_TXBYTE_E_REG: TXBYTE_E (Bit 0)                    */
#define FTDF_FTDF_TXBYTE_E_REG_TXBYTE_E_Msk   (0x1UL)                   /*!< FTDF FTDF_TXBYTE_E_REG: TXBYTE_E (Bitfield-Mask: 0x01)      */
#define FTDF_FTDF_TXBYTE_E_REG_TX_LAST_SYMBOL_E_Pos (1UL)               /*!< FTDF FTDF_TXBYTE_E_REG: TX_LAST_SYMBOL_E (Bit 1)            */
#define FTDF_FTDF_TXBYTE_E_REG_TX_LAST_SYMBOL_E_Msk (0x2UL)             /*!< FTDF FTDF_TXBYTE_E_REG: TX_LAST_SYMBOL_E (Bitfield-Mask: 0x01) */

