openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* --------------------------  KBSCAN_KBSCN_P40_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P41_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P42_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P43_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P44_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P45_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P46_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P47_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================          struct 'OTPC' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------  OTPC_OTPC_MODE_REG  ----------------------------- */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_MODE_Pos (0UL)                     /*!< OTPC OTPC_MODE_REG: OTPC_MODE_MODE (Bit 0)                  */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_MODE_Msk (0x7UL)                   /*!< OTPC OTPC_MODE_REG: OTPC_MODE_MODE (Bitfield-Mask: 0x07)    */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_USE_DMA_Pos (4UL)                  /*!< OTPC OTPC_MODE_REG: OTPC_MODE_USE_DMA (Bit 4)               */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_USE_DMA_Msk (0x10UL)               /*!< OTPC OTPC_MODE_REG: OTPC_MODE_USE_DMA (Bitfield-Mask: 0x01) */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_FIFO_FLUSH_Pos (5UL)               /*!< OTPC OTPC_MODE_REG: OTPC_MODE_FIFO_FLUSH (Bit 5)            */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_FIFO_FLUSH_Msk (0x20UL)            /*!< OTPC OTPC_MODE_REG: OTPC_MODE_FIFO_FLUSH (Bitfield-Mask: 0x01) */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_ERR_RESP_DIS_Pos (6UL)             /*!< OTPC OTPC_MODE_REG: OTPC_MODE_ERR_RESP_DIS (Bit 6)          */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_ERR_RESP_DIS_Msk (0x40UL)          /*!< OTPC OTPC_MODE_REG: OTPC_MODE_ERR_RESP_DIS (Bitfield-Mask: 0x01) */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_USE_SP_ROWS_Pos (8UL)              /*!< OTPC OTPC_MODE_REG: OTPC_MODE_USE_SP_ROWS (Bit 8)           */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_USE_SP_ROWS_Msk (0x100UL)          /*!< OTPC OTPC_MODE_REG: OTPC_MODE_USE_SP_ROWS (Bitfield-Mask: 0x01) */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_RLD_RR_REQ_Pos (9UL)               /*!< OTPC OTPC_MODE_REG: OTPC_MODE_RLD_RR_REQ (Bit 9)            */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_RLD_RR_REQ_Msk (0x200UL)           /*!< OTPC OTPC_MODE_REG: OTPC_MODE_RLD_RR_REQ (Bitfield-Mask: 0x01) */

/* -----------------------------  OTPC_OTPC_PCTRL_REG  ---------------------------- */
#define OTPC_OTPC_PCTRL_REG_OTPC_PCTRL_WADDR_Pos (0UL)                  /*!< OTPC OTPC_PCTRL_REG: OTPC_PCTRL_WADDR (Bit 0)               */
#define OTPC_OTPC_PCTRL_REG_OTPC_PCTRL_WADDR_Msk (0x1fffUL)             /*!< OTPC OTPC_PCTRL_REG: OTPC_PCTRL_WADDR (Bitfield-Mask: 0x1fff) */
#define OTPC_OTPC_PCTRL_REG_OTPC_PCTRL_PRETRY_Pos (14UL)                /*!< OTPC OTPC_PCTRL_REG: OTPC_PCTRL_PRETRY (Bit 14)             */
#define OTPC_OTPC_PCTRL_REG_OTPC_PCTRL_PRETRY_Msk (0x4000UL)            /*!< OTPC OTPC_PCTRL_REG: OTPC_PCTRL_PRETRY (Bitfield-Mask: 0x01) */
#define OTPC_OTPC_PCTRL_REG_OTPC_PCTRL_PSTART_Pos (15UL)                /*!< OTPC OTPC_PCTRL_REG: OTPC_PCTRL_PSTART (Bit 15)             */
#define OTPC_OTPC_PCTRL_REG_OTPC_PCTRL_PSTART_Msk (0x8000UL)            /*!< OTPC OTPC_PCTRL_REG: OTPC_PCTRL_PSTART (Bitfield-Mask: 0x01) */

