openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* -----------------------------  OTPC_OTPC_STAT_REG  ----------------------------- */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PRDY_Pos (0UL)                     /*!< OTPC OTPC_STAT_REG: OTPC_STAT_PRDY (Bit 0)                  */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PRDY_Msk (0x1UL)                   /*!< OTPC OTPC_STAT_REG: OTPC_STAT_PRDY (Bitfield-Mask: 0x01)    */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PERR_UNC_Pos (1UL)                 /*!< OTPC OTPC_STAT_REG: OTPC_STAT_PERR_UNC (Bit 1)              */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PERR_UNC_Msk (0x2UL)               /*!< OTPC OTPC_STAT_REG: OTPC_STAT_PERR_UNC (Bitfield-Mask: 0x01) */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PERR_COR_Pos (2UL)                 /*!< OTPC OTPC_STAT_REG: OTPC_STAT_PERR_COR (Bit 2)              */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PERR_COR_Msk (0x4UL)               /*!< OTPC OTPC_STAT_REG: OTPC_STAT_PERR_COR (Bitfield-Mask: 0x01) */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PZERO_Pos (3UL)                    /*!< OTPC OTPC_STAT_REG: OTPC_STAT_PZERO (Bit 3)                 */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PZERO_Msk (0x8UL)                  /*!< OTPC OTPC_STAT_REG: OTPC_STAT_PZERO (Bitfield-Mask: 0x01)   */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_TRDY_Pos (4UL)                     /*!< OTPC OTPC_STAT_REG: OTPC_STAT_TRDY (Bit 4)                  */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_TRDY_Msk (0x10UL)                  /*!< OTPC OTPC_STAT_REG: OTPC_STAT_TRDY (Bitfield-Mask: 0x01)    */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_TERROR_Pos (5UL)                   /*!< OTPC OTPC_STAT_REG: OTPC_STAT_TERROR (Bit 5)                */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_TERROR_Msk (0x20UL)                /*!< OTPC OTPC_STAT_REG: OTPC_STAT_TERROR (Bitfield-Mask: 0x01)  */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_ARDY_Pos (6UL)                     /*!< OTPC OTPC_STAT_REG: OTPC_STAT_ARDY (Bit 6)                  */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_ARDY_Msk (0x40UL)                  /*!< OTPC OTPC_STAT_REG: OTPC_STAT_ARDY (Bitfield-Mask: 0x01)    */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_RERROR_Pos (7UL)                   /*!< OTPC OTPC_STAT_REG: OTPC_STAT_RERROR (Bit 7)                */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_RERROR_Msk (0x80UL)                /*!< OTPC OTPC_STAT_REG: OTPC_STAT_RERROR (Bitfield-Mask: 0x01)  */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_FWORDS_Pos (8UL)                   /*!< OTPC OTPC_STAT_REG: OTPC_STAT_FWORDS (Bit 8)                */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_FWORDS_Msk (0xf00UL)               /*!< OTPC OTPC_STAT_REG: OTPC_STAT_FWORDS (Bitfield-Mask: 0x0f)  */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_NWORDS_Pos (16UL)                  /*!< OTPC OTPC_STAT_REG: OTPC_STAT_NWORDS (Bit 16)               */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_NWORDS_Msk (0x3fff0000UL)          /*!< OTPC OTPC_STAT_REG: OTPC_STAT_NWORDS (Bitfield-Mask: 0x3fff) */

/* ----------------------------  OTPC_OTPC_AHBADR_REG  ---------------------------- */
#define OTPC_OTPC_AHBADR_REG_OTPC_AHBADR_Pos  (2UL)                     /*!< OTPC OTPC_AHBADR_REG: OTPC_AHBADR (Bit 2)                   */
#define OTPC_OTPC_AHBADR_REG_OTPC_AHBADR_Msk  (0xfffffffcUL)            /*!< OTPC OTPC_AHBADR_REG: OTPC_AHBADR (Bitfield-Mask: 0x3fffffff) */

/* ----------------------------  OTPC_OTPC_CELADR_REG  ---------------------------- */
#define OTPC_OTPC_CELADR_REG_OTPC_CELADR_Pos  (0UL)                     /*!< OTPC OTPC_CELADR_REG: OTPC_CELADR (Bit 0)                   */
#define OTPC_OTPC_CELADR_REG_OTPC_CELADR_Msk  (0x3fffUL)                /*!< OTPC OTPC_CELADR_REG: OTPC_CELADR (Bitfield-Mask: 0x3fff)   */
#define OTPC_OTPC_CELADR_REG_OTPC_CELADR_LV_Pos (16UL)                  /*!< OTPC OTPC_CELADR_REG: OTPC_CELADR_LV (Bit 16)               */
#define OTPC_OTPC_CELADR_REG_OTPC_CELADR_LV_Msk (0x3fff0000UL)          /*!< OTPC OTPC_CELADR_REG: OTPC_CELADR_LV (Bitfield-Mask: 0x3fff) */

/* ----------------------------  OTPC_OTPC_NWORDS_REG  ---------------------------- */
#define OTPC_OTPC_NWORDS_REG_OTPC_NWORDS_Pos  (0UL)                     /*!< OTPC OTPC_NWORDS_REG: OTPC_NWORDS (Bit 0)                   */
#define OTPC_OTPC_NWORDS_REG_OTPC_NWORDS_Msk  (0x3fffUL)                /*!< OTPC OTPC_NWORDS_REG: OTPC_NWORDS (Bitfield-Mask: 0x3fff)   */

/* -----------------------------  OTPC_OTPC_FFPRT_REG  ---------------------------- */
#define OTPC_OTPC_FFPRT_REG_OTPC_FFPRT_Pos    (0UL)                     /*!< OTPC OTPC_FFPRT_REG: OTPC_FFPRT (Bit 0)                     */
#define OTPC_OTPC_FFPRT_REG_OTPC_FFPRT_Msk    (0xffffffffUL)            /*!< OTPC OTPC_FFPRT_REG: OTPC_FFPRT (Bitfield-Mask: 0xffffffff) */

/* -----------------------------  OTPC_OTPC_FFRD_REG  ----------------------------- */
#define OTPC_OTPC_FFRD_REG_OTPC_FFRD_Pos      (0UL)                     /*!< OTPC OTPC_FFRD_REG: OTPC_FFRD (Bit 0)                       */
#define OTPC_OTPC_FFRD_REG_OTPC_FFRD_Msk      (0xffffffffUL)            /*!< OTPC OTPC_FFRD_REG: OTPC_FFRD (Bitfield-Mask: 0xffffffff)   */

/* ----------------------------  OTPC_OTPC_PWORDL_REG  ---------------------------- */
#define OTPC_OTPC_PWORDL_REG_OTPC_PWORDL_Pos  (0UL)                     /*!< OTPC OTPC_PWORDL_REG: OTPC_PWORDL (Bit 0)                   */
#define OTPC_OTPC_PWORDL_REG_OTPC_PWORDL_Msk  (0xffffffffUL)            /*!< OTPC OTPC_PWORDL_REG: OTPC_PWORDL (Bitfield-Mask: 0xffffffff) */

/* ----------------------------  OTPC_OTPC_PWORDH_REG  ---------------------------- */
#define OTPC_OTPC_PWORDH_REG_OTPC_PWORDH_Pos  (0UL)                     /*!< OTPC OTPC_PWORDH_REG: OTPC_PWORDH (Bit 0)                   */
#define OTPC_OTPC_PWORDH_REG_OTPC_PWORDH_Msk  (0xffffffffUL)            /*!< OTPC OTPC_PWORDH_REG: OTPC_PWORDH (Bitfield-Mask: 0xffffffff) */

/* -----------------------------  OTPC_OTPC_TIM1_REG  ----------------------------- */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_CADX_Pos (0UL)                /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_CADX (Bit 0)             */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_CADX_Msk (0xffUL)             /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_CADX (Bitfield-Mask: 0xff) */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_PW_Pos (8UL)                  /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_PW (Bit 8)               */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_PW_Msk (0xff00UL)             /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_PW (Bitfield-Mask: 0xff) */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_1US_Pos (16UL)                /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_1US (Bit 16)             */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_1US_Msk (0x3f0000UL)          /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_1US (Bitfield-Mask: 0x3f) */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_500NS_Pos (22UL)              /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_500NS (Bit 22)           */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_500NS_Msk (0x7c00000UL)       /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_500NS (Bitfield-Mask: 0x1f) */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_200NS_Pos (27UL)              /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_200NS (Bit 27)           */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_200NS_Msk (0x78000000UL)      /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_200NS (Bitfield-Mask: 0x0f) */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_25NS_Pos (31UL)               /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_25NS (Bit 31)            */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_25NS_Msk (0x80000000UL)       /*!< OTPC OTPC_TIM1_REG: OTPC_TIM1_CC_T_25NS (Bitfield-Mask: 0x01) */

