openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* ----------------------------  PATCH_PATCH_ADDR5_REG  --------------------------- */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ----------------------------  PATCH_PATCH_ADDR6_REG  --------------------------- */
#define PATCH_PATCH_ADDR6_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR6_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR6_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR6_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR6_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR6_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR6_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR6_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ----------------------------  PATCH_PATCH_ADDR7_REG  --------------------------- */
#define PATCH_PATCH_ADDR7_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR7_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR7_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR7_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR7_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR7_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR7_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR7_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ----------------------------  PATCH_PATCH_ADDR8_REG  --------------------------- */
#define PATCH_PATCH_ADDR8_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR8_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR8_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR8_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR8_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR8_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR8_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR8_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ----------------------------  PATCH_PATCH_ADDR9_REG  --------------------------- */
#define PATCH_PATCH_ADDR9_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR9_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR9_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR9_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR9_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR9_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR9_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR9_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ---------------------------  PATCH_PATCH_ADDR10_REG  --------------------------- */
#define PATCH_PATCH_ADDR10_REG_PATCH_ADDR_C_Pos (1UL)                   /*!< PATCH PATCH_ADDR10_REG: PATCH_ADDR_C (Bit 1)                */
#define PATCH_PATCH_ADDR10_REG_PATCH_ADDR_C_Msk (0x1fffeUL)             /*!< PATCH PATCH_ADDR10_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR10_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR10_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR10_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR10_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_ADDR11_REG  --------------------------- */
#define PATCH_PATCH_ADDR11_REG_PATCH_ADDR_C_Pos (1UL)                   /*!< PATCH PATCH_ADDR11_REG: PATCH_ADDR_C (Bit 1)                */
#define PATCH_PATCH_ADDR11_REG_PATCH_ADDR_C_Msk (0x1fffeUL)             /*!< PATCH PATCH_ADDR11_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR11_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR11_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR11_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR11_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_ADDR12_REG  --------------------------- */
#define PATCH_PATCH_ADDR12_REG_PATCH_ADDR_C_Pos (1UL)                   /*!< PATCH PATCH_ADDR12_REG: PATCH_ADDR_C (Bit 1)                */
#define PATCH_PATCH_ADDR12_REG_PATCH_ADDR_C_Msk (0x1fffeUL)             /*!< PATCH PATCH_ADDR12_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR12_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR12_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR12_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR12_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_ADDR13_REG  --------------------------- */
#define PATCH_PATCH_ADDR13_REG_PATCH_ADDR_C_Pos (1UL)                   /*!< PATCH PATCH_ADDR13_REG: PATCH_ADDR_C (Bit 1)                */
#define PATCH_PATCH_ADDR13_REG_PATCH_ADDR_C_Msk (0x1fffeUL)             /*!< PATCH PATCH_ADDR13_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR13_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR13_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR13_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR13_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_ADDR14_REG  --------------------------- */
#define PATCH_PATCH_ADDR14_REG_PATCH_ADDR_C_Pos (1UL)                   /*!< PATCH PATCH_ADDR14_REG: PATCH_ADDR_C (Bit 1)                */
#define PATCH_PATCH_ADDR14_REG_PATCH_ADDR_C_Msk (0x1fffeUL)             /*!< PATCH PATCH_ADDR14_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR14_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR14_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR14_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR14_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

