openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* -----------------------------  RFPT_RFPT_CTRL_REG  ----------------------------- */
#define RFPT_RFPT_CTRL_REG_RFPT_PACK_EN_Pos   (0UL)                     /*!< RFPT RFPT_CTRL_REG: RFPT_PACK_EN (Bit 0)                    */
#define RFPT_RFPT_CTRL_REG_RFPT_PACK_EN_Msk   (0x1UL)                   /*!< RFPT RFPT_CTRL_REG: RFPT_PACK_EN (Bitfield-Mask: 0x01)      */
#define RFPT_RFPT_CTRL_REG_RFPT_PACK_SEL_Pos  (1UL)                     /*!< RFPT RFPT_CTRL_REG: RFPT_PACK_SEL (Bit 1)                   */
#define RFPT_RFPT_CTRL_REG_RFPT_PACK_SEL_Msk  (0x6UL)                   /*!< RFPT RFPT_CTRL_REG: RFPT_PACK_SEL (Bitfield-Mask: 0x03)     */
#define RFPT_RFPT_CTRL_REG_RFPT_PACK_ADC_TYPE_Pos (3UL)                 /*!< RFPT RFPT_CTRL_REG: RFPT_PACK_ADC_TYPE (Bit 3)              */
#define RFPT_RFPT_CTRL_REG_RFPT_PACK_ADC_TYPE_Msk (0x8UL)               /*!< RFPT RFPT_CTRL_REG: RFPT_PACK_ADC_TYPE (Bitfield-Mask: 0x01) */
#define RFPT_RFPT_CTRL_REG_RFPT_CIRC_EN_Pos   (4UL)                     /*!< RFPT RFPT_CTRL_REG: RFPT_CIRC_EN (Bit 4)                    */
#define RFPT_RFPT_CTRL_REG_RFPT_CIRC_EN_Msk   (0x10UL)                  /*!< RFPT RFPT_CTRL_REG: RFPT_CIRC_EN (Bitfield-Mask: 0x01)      */
#define RFPT_RFPT_CTRL_REG_RFPT_BREQ_FORCE_Pos (5UL)                    /*!< RFPT RFPT_CTRL_REG: RFPT_BREQ_FORCE (Bit 5)                 */
#define RFPT_RFPT_CTRL_REG_RFPT_BREQ_FORCE_Msk (0x20UL)                 /*!< RFPT RFPT_CTRL_REG: RFPT_BREQ_FORCE (Bitfield-Mask: 0x01)   */

/* -----------------------------  RFPT_RFPT_ADDRL_REG  ---------------------------- */
#define RFPT_RFPT_ADDRL_REG_RFPT_ADDRL_Pos    (2UL)                     /*!< RFPT RFPT_ADDRL_REG: RFPT_ADDRL (Bit 2)                     */
#define RFPT_RFPT_ADDRL_REG_RFPT_ADDRL_Msk    (0xfffcUL)                /*!< RFPT RFPT_ADDRL_REG: RFPT_ADDRL (Bitfield-Mask: 0x3fff)     */

/* -----------------------------  RFPT_RFPT_ADDRH_REG  ---------------------------- */
#define RFPT_RFPT_ADDRH_REG_RFPT_ADDRH_Pos    (0UL)                     /*!< RFPT RFPT_ADDRH_REG: RFPT_ADDRH (Bit 0)                     */
#define RFPT_RFPT_ADDRH_REG_RFPT_ADDRH_Msk    (0x3UL)                   /*!< RFPT RFPT_ADDRH_REG: RFPT_ADDRH (Bitfield-Mask: 0x03)       */

/* ------------------------------  RFPT_RFPT_LEN_REG  ----------------------------- */
#define RFPT_RFPT_LEN_REG_RFPT_LEN_Pos        (0UL)                     /*!< RFPT RFPT_LEN_REG: RFPT_LEN (Bit 0)                         */
#define RFPT_RFPT_LEN_REG_RFPT_LEN_Msk        (0x7fffUL)                /*!< RFPT RFPT_LEN_REG: RFPT_LEN (Bitfield-Mask: 0x7fff)         */

/* -----------------------------  RFPT_RFPT_STAT_REG  ----------------------------- */
#define RFPT_RFPT_STAT_REG_RFPT_ACTIVE_Pos    (0UL)                     /*!< RFPT RFPT_STAT_REG: RFPT_ACTIVE (Bit 0)                     */
#define RFPT_RFPT_STAT_REG_RFPT_ACTIVE_Msk    (0x1UL)                   /*!< RFPT RFPT_STAT_REG: RFPT_ACTIVE (Bitfield-Mask: 0x01)       */
#define RFPT_RFPT_STAT_REG_RFPT_OFLOW_STK_Pos (1UL)                     /*!< RFPT RFPT_STAT_REG: RFPT_OFLOW_STK (Bit 1)                  */
#define RFPT_RFPT_STAT_REG_RFPT_OFLOW_STK_Msk (0x2UL)                   /*!< RFPT RFPT_STAT_REG: RFPT_OFLOW_STK (Bitfield-Mask: 0x01)    */

/* ---------------------------  RFPT_RFPT_CRV_ADDRL_REG  -------------------------- */
#define RFPT_RFPT_CRV_ADDRL_REG_RFPT_CRV_ADDRL_Pos (2UL)                /*!< RFPT RFPT_CRV_ADDRL_REG: RFPT_CRV_ADDRL (Bit 2)             */
#define RFPT_RFPT_CRV_ADDRL_REG_RFPT_CRV_ADDRL_Msk (0xfffcUL)           /*!< RFPT RFPT_CRV_ADDRL_REG: RFPT_CRV_ADDRL (Bitfield-Mask: 0x3fff) */

/* ---------------------------  RFPT_RFPT_CRV_ADDRH_REG  -------------------------- */
#define RFPT_RFPT_CRV_ADDRH_REG_RFPT_CRV_ADDRH_Pos (0UL)                /*!< RFPT RFPT_CRV_ADDRH_REG: RFPT_CRV_ADDRH (Bit 0)             */
#define RFPT_RFPT_CRV_ADDRH_REG_RFPT_CRV_ADDRH_Msk (0x3UL)              /*!< RFPT RFPT_CRV_ADDRH_REG: RFPT_CRV_ADDRH (Bitfield-Mask: 0x03) */

/* ----------------------------  RFPT_RFPT_CRV_LEN_REG  --------------------------- */
#define RFPT_RFPT_CRV_LEN_REG_RFPT_CRV_LEN_Pos (0UL)                    /*!< RFPT RFPT_CRV_LEN_REG: RFPT_CRV_LEN (Bit 0)                 */
#define RFPT_RFPT_CRV_LEN_REG_RFPT_CRV_LEN_Msk (0x7fffUL)               /*!< RFPT RFPT_CRV_LEN_REG: RFPT_CRV_LEN (Bitfield-Mask: 0x7fff) */


/* ================================================================================ */
/* ================          struct 'SPI' Position & Mask          ================ */
/* ================================================================================ */


/* ------------------------------  SPI_SPI_CTRL_REG  ------------------------------ */
#define SPI_SPI_CTRL_REG_SPI_ON_Pos           (0UL)                     /*!< SPI SPI_CTRL_REG: SPI_ON (Bit 0)                            */
#define SPI_SPI_CTRL_REG_SPI_ON_Msk           (0x1UL)                   /*!< SPI SPI_CTRL_REG: SPI_ON (Bitfield-Mask: 0x01)              */
#define SPI_SPI_CTRL_REG_SPI_PHA_Pos          (1UL)                     /*!< SPI SPI_CTRL_REG: SPI_PHA (Bit 1)                           */
#define SPI_SPI_CTRL_REG_SPI_PHA_Msk          (0x2UL)                   /*!< SPI SPI_CTRL_REG: SPI_PHA (Bitfield-Mask: 0x01)             */
#define SPI_SPI_CTRL_REG_SPI_POL_Pos          (2UL)                     /*!< SPI SPI_CTRL_REG: SPI_POL (Bit 2)                           */
#define SPI_SPI_CTRL_REG_SPI_POL_Msk          (0x4UL)                   /*!< SPI SPI_CTRL_REG: SPI_POL (Bitfield-Mask: 0x01)             */
#define SPI_SPI_CTRL_REG_SPI_CLK_Pos          (3UL)                     /*!< SPI SPI_CTRL_REG: SPI_CLK (Bit 3)                           */
#define SPI_SPI_CTRL_REG_SPI_CLK_Msk          (0x18UL)                  /*!< SPI SPI_CTRL_REG: SPI_CLK (Bitfield-Mask: 0x03)             */
#define SPI_SPI_CTRL_REG_SPI_DO_Pos           (5UL)                     /*!< SPI SPI_CTRL_REG: SPI_DO (Bit 5)                            */
#define SPI_SPI_CTRL_REG_SPI_DO_Msk           (0x20UL)                  /*!< SPI SPI_CTRL_REG: SPI_DO (Bitfield-Mask: 0x01)              */
#define SPI_SPI_CTRL_REG_SPI_SMN_Pos          (6UL)                     /*!< SPI SPI_CTRL_REG: SPI_SMN (Bit 6)                           */
#define SPI_SPI_CTRL_REG_SPI_SMN_Msk          (0x40UL)                  /*!< SPI SPI_CTRL_REG: SPI_SMN (Bitfield-Mask: 0x01)             */
#define SPI_SPI_CTRL_REG_SPI_WORD_Pos         (7UL)                     /*!< SPI SPI_CTRL_REG: SPI_WORD (Bit 7)                          */
#define SPI_SPI_CTRL_REG_SPI_WORD_Msk         (0x180UL)                 /*!< SPI SPI_CTRL_REG: SPI_WORD (Bitfield-Mask: 0x03)            */
#define SPI_SPI_CTRL_REG_SPI_RST_Pos          (9UL)                     /*!< SPI SPI_CTRL_REG: SPI_RST (Bit 9)                           */
#define SPI_SPI_CTRL_REG_SPI_RST_Msk          (0x200UL)                 /*!< SPI SPI_CTRL_REG: SPI_RST (Bitfield-Mask: 0x01)             */
#define SPI_SPI_CTRL_REG_SPI_FORCE_DO_Pos     (10UL)                    /*!< SPI SPI_CTRL_REG: SPI_FORCE_DO (Bit 10)                     */
#define SPI_SPI_CTRL_REG_SPI_FORCE_DO_Msk     (0x400UL)                 /*!< SPI SPI_CTRL_REG: SPI_FORCE_DO (Bitfield-Mask: 0x01)        */
#define SPI_SPI_CTRL_REG_SPI_TXH_Pos          (11UL)                    /*!< SPI SPI_CTRL_REG: SPI_TXH (Bit 11)                          */
#define SPI_SPI_CTRL_REG_SPI_TXH_Msk          (0x800UL)                 /*!< SPI SPI_CTRL_REG: SPI_TXH (Bitfield-Mask: 0x01)             */
#define SPI_SPI_CTRL_REG_SPI_DI_Pos           (12UL)                    /*!< SPI SPI_CTRL_REG: SPI_DI (Bit 12)                           */
#define SPI_SPI_CTRL_REG_SPI_DI_Msk           (0x1000UL)                /*!< SPI SPI_CTRL_REG: SPI_DI (Bitfield-Mask: 0x01)              */
#define SPI_SPI_CTRL_REG_SPI_INT_BIT_Pos      (13UL)                    /*!< SPI SPI_CTRL_REG: SPI_INT_BIT (Bit 13)                      */
#define SPI_SPI_CTRL_REG_SPI_INT_BIT_Msk      (0x2000UL)                /*!< SPI SPI_CTRL_REG: SPI_INT_BIT (Bitfield-Mask: 0x01)         */
#define SPI_SPI_CTRL_REG_SPI_MINT_Pos         (14UL)                    /*!< SPI SPI_CTRL_REG: SPI_MINT (Bit 14)                         */
#define SPI_SPI_CTRL_REG_SPI_MINT_Msk         (0x4000UL)                /*!< SPI SPI_CTRL_REG: SPI_MINT (Bitfield-Mask: 0x01)            */
#define SPI_SPI_CTRL_REG_SPI_EN_CTRL_Pos      (15UL)                    /*!< SPI SPI_CTRL_REG: SPI_EN_CTRL (Bit 15)                      */
#define SPI_SPI_CTRL_REG_SPI_EN_CTRL_Msk      (0x8000UL)                /*!< SPI SPI_CTRL_REG: SPI_EN_CTRL (Bitfield-Mask: 0x01)         */

/* -----------------------------  SPI_SPI_RX_TX_REG0  ----------------------------- */
#define SPI_SPI_RX_TX_REG0_SPI_DATA0_Pos      (0UL)                     /*!< SPI SPI_RX_TX_REG0: SPI_DATA0 (Bit 0)                       */
#define SPI_SPI_RX_TX_REG0_SPI_DATA0_Msk      (0xffffUL)                /*!< SPI SPI_RX_TX_REG0: SPI_DATA0 (Bitfield-Mask: 0xffff)       */

/* -----------------------------  SPI_SPI_RX_TX_REG1  ----------------------------- */
#define SPI_SPI_RX_TX_REG1_SPI_DATA1_Pos      (0UL)                     /*!< SPI SPI_RX_TX_REG1: SPI_DATA1 (Bit 0)                       */
#define SPI_SPI_RX_TX_REG1_SPI_DATA1_Msk      (0xffffUL)                /*!< SPI SPI_RX_TX_REG1: SPI_DATA1 (Bitfield-Mask: 0xffff)       */

