openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* --------------------  TIMER1_CAPTIM_CAPTURE_HIGH_GPIO1_REG  -------------------- */
#define TIMER1_CAPTIM_CAPTURE_HIGH_GPIO1_REG_CAPTIM_CAPTURE_HIGH_GPIO1_Pos (0UL) /*!< TIMER1 CAPTIM_CAPTURE_HIGH_GPIO1_REG: CAPTIM_CAPTURE_HIGH_GPIO1 (Bit 0) */
#define TIMER1_CAPTIM_CAPTURE_HIGH_GPIO1_REG_CAPTIM_CAPTURE_HIGH_GPIO1_Msk (0xffffUL) /*!< TIMER1 CAPTIM_CAPTURE_HIGH_GPIO1_REG: CAPTIM_CAPTURE_HIGH_GPIO1 (Bitfield-Mask: 0xffff) */

/* --------------------  TIMER1_CAPTIM_CAPTURE_HIGH_GPIO2_REG  -------------------- */
#define TIMER1_CAPTIM_CAPTURE_HIGH_GPIO2_REG_CAPTIM_CAPTURE_HIGH_GPIO2_Pos (0UL) /*!< TIMER1 CAPTIM_CAPTURE_HIGH_GPIO2_REG: CAPTIM_CAPTURE_HIGH_GPIO2 (Bit 0) */
#define TIMER1_CAPTIM_CAPTURE_HIGH_GPIO2_REG_CAPTIM_CAPTURE_HIGH_GPIO2_Msk (0xffffUL) /*!< TIMER1 CAPTIM_CAPTURE_HIGH_GPIO2_REG: CAPTIM_CAPTURE_HIGH_GPIO2 (Bitfield-Mask: 0xffff) */

/* ----------------------  TIMER1_CAPTIM_SHOTWIDTH_HIGH_REG  ---------------------- */
#define TIMER1_CAPTIM_SHOTWIDTH_HIGH_REG_CAPTIM_SHOTWIDTH_HIGH_Pos (0UL) /*!< TIMER1 CAPTIM_SHOTWIDTH_HIGH_REG: CAPTIM_SHOTWIDTH_HIGH (Bit 0) */
#define TIMER1_CAPTIM_SHOTWIDTH_HIGH_REG_CAPTIM_SHOTWIDTH_HIGH_Msk (0xffffUL) /*!< TIMER1 CAPTIM_SHOTWIDTH_HIGH_REG: CAPTIM_SHOTWIDTH_HIGH (Bitfield-Mask: 0xffff) */


/* ================================================================================ */
/* ================          struct 'TRNG' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------  TRNG_TRNG_CTRL_REG  ----------------------------- */
#define TRNG_TRNG_CTRL_REG_TRNG_ENABLE_Pos    (0UL)                     /*!< TRNG TRNG_CTRL_REG: TRNG_ENABLE (Bit 0)                     */
#define TRNG_TRNG_CTRL_REG_TRNG_ENABLE_Msk    (0x1UL)                   /*!< TRNG TRNG_CTRL_REG: TRNG_ENABLE (Bitfield-Mask: 0x01)       */
#define TRNG_TRNG_CTRL_REG_TRNG_MODE_Pos      (1UL)                     /*!< TRNG TRNG_CTRL_REG: TRNG_MODE (Bit 1)                       */
#define TRNG_TRNG_CTRL_REG_TRNG_MODE_Msk      (0x2UL)                   /*!< TRNG TRNG_CTRL_REG: TRNG_MODE (Bitfield-Mask: 0x01)         */

/* ----------------------------  TRNG_TRNG_FIFOLVL_REG  --------------------------- */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOLVL_Pos (0UL)                    /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOLVL (Bit 0)                 */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOLVL_Msk (0x1fUL)                 /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOLVL (Bitfield-Mask: 0x1f)   */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOFULL_Pos (5UL)                   /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOFULL (Bit 5)                */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOFULL_Msk (0x20UL)                /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOFULL (Bitfield-Mask: 0x01)  */

/* ------------------------------  TRNG_TRNG_VER_REG  ----------------------------- */
#define TRNG_TRNG_VER_REG_TRNG_SVN_Pos        (0UL)                     /*!< TRNG TRNG_VER_REG: TRNG_SVN (Bit 0)                         */
#define TRNG_TRNG_VER_REG_TRNG_SVN_Msk        (0xffffUL)                /*!< TRNG TRNG_VER_REG: TRNG_SVN (Bitfield-Mask: 0xffff)         */
#define TRNG_TRNG_VER_REG_TRNG_MIN_Pos        (16UL)                    /*!< TRNG TRNG_VER_REG: TRNG_MIN (Bit 16)                        */
#define TRNG_TRNG_VER_REG_TRNG_MIN_Msk        (0xff0000UL)              /*!< TRNG TRNG_VER_REG: TRNG_MIN (Bitfield-Mask: 0xff)           */
#define TRNG_TRNG_VER_REG_TRNG_MAJ_Pos        (24UL)                    /*!< TRNG TRNG_VER_REG: TRNG_MAJ (Bit 24)                        */
#define TRNG_TRNG_VER_REG_TRNG_MAJ_Msk        (0xff000000UL)            /*!< TRNG TRNG_VER_REG: TRNG_MAJ (Bitfield-Mask: 0xff)           */


/* ================================================================================ */
/* ================          struct 'UART' Position & Mask         ================ */
/* ================================================================================ */


/* --------------------------  UART_UART_RBR_THR_DLL_REG  ------------------------- */
#define UART_UART_RBR_THR_DLL_REG_RBR_THR_DLL_Pos (0UL)                 /*!< UART UART_RBR_THR_DLL_REG: RBR_THR_DLL (Bit 0)              */
#define UART_UART_RBR_THR_DLL_REG_RBR_THR_DLL_Msk (0xffUL)              /*!< UART UART_RBR_THR_DLL_REG: RBR_THR_DLL (Bitfield-Mask: 0xff) */

/* ----------------------------  UART_UART_IER_DLH_REG  --------------------------- */
#define UART_UART_IER_DLH_REG_ERBFI_dlh0_Pos  (0UL)                     /*!< UART UART_IER_DLH_REG: ERBFI_dlh0 (Bit 0)                   */
#define UART_UART_IER_DLH_REG_ERBFI_dlh0_Msk  (0x1UL)                   /*!< UART UART_IER_DLH_REG: ERBFI_dlh0 (Bitfield-Mask: 0x01)     */
#define UART_UART_IER_DLH_REG_ETBEI_dlh1_Pos  (1UL)                     /*!< UART UART_IER_DLH_REG: ETBEI_dlh1 (Bit 1)                   */
#define UART_UART_IER_DLH_REG_ETBEI_dlh1_Msk  (0x2UL)                   /*!< UART UART_IER_DLH_REG: ETBEI_dlh1 (Bitfield-Mask: 0x01)     */
#define UART_UART_IER_DLH_REG_ELSI_dhl2_Pos   (2UL)                     /*!< UART UART_IER_DLH_REG: ELSI_dhl2 (Bit 2)                    */
#define UART_UART_IER_DLH_REG_ELSI_dhl2_Msk   (0x4UL)                   /*!< UART UART_IER_DLH_REG: ELSI_dhl2 (Bitfield-Mask: 0x01)      */
#define UART_UART_IER_DLH_REG_EDSSI_dlh3_Pos  (3UL)                     /*!< UART UART_IER_DLH_REG: EDSSI_dlh3 (Bit 3)                   */
#define UART_UART_IER_DLH_REG_EDSSI_dlh3_Msk  (0x8UL)                   /*!< UART UART_IER_DLH_REG: EDSSI_dlh3 (Bitfield-Mask: 0x01)     */
#define UART_UART_IER_DLH_REG_dlh6_4_Pos      (4UL)                     /*!< UART UART_IER_DLH_REG: dlh6_4 (Bit 4)                       */
#define UART_UART_IER_DLH_REG_dlh6_4_Msk      (0x70UL)                  /*!< UART UART_IER_DLH_REG: dlh6_4 (Bitfield-Mask: 0x07)         */
#define UART_UART_IER_DLH_REG_PTIME_dlh7_Pos  (7UL)                     /*!< UART UART_IER_DLH_REG: PTIME_dlh7 (Bit 7)                   */
#define UART_UART_IER_DLH_REG_PTIME_dlh7_Msk  (0x80UL)                  /*!< UART UART_IER_DLH_REG: PTIME_dlh7 (Bitfield-Mask: 0x01)     */

