openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* ----------------------------  UART_UART_IIR_FCR_REG  --------------------------- */
#define UART_UART_IIR_FCR_REG_IIR_FCR_Pos     (0UL)                     /*!< UART UART_IIR_FCR_REG: IIR_FCR (Bit 0)                      */
#define UART_UART_IIR_FCR_REG_IIR_FCR_Msk     (0xffffUL)                /*!< UART UART_IIR_FCR_REG: IIR_FCR (Bitfield-Mask: 0xffff)      */

/* ------------------------------  UART_UART_LCR_REG  ----------------------------- */
#define UART_UART_LCR_REG_UART_DLS_Pos        (0UL)                     /*!< UART UART_LCR_REG: UART_DLS (Bit 0)                         */
#define UART_UART_LCR_REG_UART_DLS_Msk        (0x3UL)                   /*!< UART UART_LCR_REG: UART_DLS (Bitfield-Mask: 0x03)           */
#define UART_UART_LCR_REG_UART_STOP_Pos       (2UL)                     /*!< UART UART_LCR_REG: UART_STOP (Bit 2)                        */
#define UART_UART_LCR_REG_UART_STOP_Msk       (0x4UL)                   /*!< UART UART_LCR_REG: UART_STOP (Bitfield-Mask: 0x01)          */
#define UART_UART_LCR_REG_UART_PEN_Pos        (3UL)                     /*!< UART UART_LCR_REG: UART_PEN (Bit 3)                         */
#define UART_UART_LCR_REG_UART_PEN_Msk        (0x8UL)                   /*!< UART UART_LCR_REG: UART_PEN (Bitfield-Mask: 0x01)           */
#define UART_UART_LCR_REG_UART_EPS_Pos        (4UL)                     /*!< UART UART_LCR_REG: UART_EPS (Bit 4)                         */
#define UART_UART_LCR_REG_UART_EPS_Msk        (0x10UL)                  /*!< UART UART_LCR_REG: UART_EPS (Bitfield-Mask: 0x01)           */
#define UART_UART_LCR_REG_UART_BC_Pos         (6UL)                     /*!< UART UART_LCR_REG: UART_BC (Bit 6)                          */
#define UART_UART_LCR_REG_UART_BC_Msk         (0x40UL)                  /*!< UART UART_LCR_REG: UART_BC (Bitfield-Mask: 0x01)            */
#define UART_UART_LCR_REG_UART_DLAB_Pos       (7UL)                     /*!< UART UART_LCR_REG: UART_DLAB (Bit 7)                        */
#define UART_UART_LCR_REG_UART_DLAB_Msk       (0x80UL)                  /*!< UART UART_LCR_REG: UART_DLAB (Bitfield-Mask: 0x01)          */

/* ------------------------------  UART_UART_MCR_REG  ----------------------------- */
#define UART_UART_MCR_REG_UART_OUT1_Pos       (2UL)                     /*!< UART UART_MCR_REG: UART_OUT1 (Bit 2)                        */
#define UART_UART_MCR_REG_UART_OUT1_Msk       (0x4UL)                   /*!< UART UART_MCR_REG: UART_OUT1 (Bitfield-Mask: 0x01)          */
#define UART_UART_MCR_REG_UART_OUT2_Pos       (3UL)                     /*!< UART UART_MCR_REG: UART_OUT2 (Bit 3)                        */
#define UART_UART_MCR_REG_UART_OUT2_Msk       (0x8UL)                   /*!< UART UART_MCR_REG: UART_OUT2 (Bitfield-Mask: 0x01)          */
#define UART_UART_MCR_REG_UART_LB_Pos         (4UL)                     /*!< UART UART_MCR_REG: UART_LB (Bit 4)                          */
#define UART_UART_MCR_REG_UART_LB_Msk         (0x10UL)                  /*!< UART UART_MCR_REG: UART_LB (Bitfield-Mask: 0x01)            */
#define UART_UART_MCR_REG_UART_SIRE_Pos       (6UL)                     /*!< UART UART_MCR_REG: UART_SIRE (Bit 6)                        */
#define UART_UART_MCR_REG_UART_SIRE_Msk       (0x40UL)                  /*!< UART UART_MCR_REG: UART_SIRE (Bitfield-Mask: 0x01)          */

/* ------------------------------  UART_UART_LSR_REG  ----------------------------- */
#define UART_UART_LSR_REG_UART_DR_Pos         (0UL)                     /*!< UART UART_LSR_REG: UART_DR (Bit 0)                          */
#define UART_UART_LSR_REG_UART_DR_Msk         (0x1UL)                   /*!< UART UART_LSR_REG: UART_DR (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_OE_Pos         (1UL)                     /*!< UART UART_LSR_REG: UART_OE (Bit 1)                          */
#define UART_UART_LSR_REG_UART_OE_Msk         (0x2UL)                   /*!< UART UART_LSR_REG: UART_OE (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_PE_Pos         (2UL)                     /*!< UART UART_LSR_REG: UART_PE (Bit 2)                          */
#define UART_UART_LSR_REG_UART_PE_Msk         (0x4UL)                   /*!< UART UART_LSR_REG: UART_PE (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_FE_Pos         (3UL)                     /*!< UART UART_LSR_REG: UART_FE (Bit 3)                          */
#define UART_UART_LSR_REG_UART_FE_Msk         (0x8UL)                   /*!< UART UART_LSR_REG: UART_FE (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_BI_Pos         (4UL)                     /*!< UART UART_LSR_REG: UART_BI (Bit 4)                          */
#define UART_UART_LSR_REG_UART_BI_Msk         (0x10UL)                  /*!< UART UART_LSR_REG: UART_BI (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_THRE_Pos       (5UL)                     /*!< UART UART_LSR_REG: UART_THRE (Bit 5)                        */
#define UART_UART_LSR_REG_UART_THRE_Msk       (0x20UL)                  /*!< UART UART_LSR_REG: UART_THRE (Bitfield-Mask: 0x01)          */
#define UART_UART_LSR_REG_UART_TEMT_Pos       (6UL)                     /*!< UART UART_LSR_REG: UART_TEMT (Bit 6)                        */
#define UART_UART_LSR_REG_UART_TEMT_Msk       (0x40UL)                  /*!< UART UART_LSR_REG: UART_TEMT (Bitfield-Mask: 0x01)          */

/* ------------------------------  UART_UART_SCR_REG  ----------------------------- */
#define UART_UART_SCR_REG_UART_SCRATCH_PAD_Pos (0UL)                    /*!< UART UART_SCR_REG: UART_SCRATCH_PAD (Bit 0)                 */
#define UART_UART_SCR_REG_UART_SCRATCH_PAD_Msk (0xffUL)                 /*!< UART UART_SCR_REG: UART_SCRATCH_PAD (Bitfield-Mask: 0xff)   */

/* ------------------------------  UART_UART_USR_REG  ----------------------------- */
#define UART_UART_USR_REG_UART_BUSY_Pos       (0UL)                     /*!< UART UART_USR_REG: UART_BUSY (Bit 0)                        */
#define UART_UART_USR_REG_UART_BUSY_Msk       (0x1UL)                   /*!< UART UART_USR_REG: UART_BUSY (Bitfield-Mask: 0x01)          */

/* ------------------------------  UART_UART_SRR_REG  ----------------------------- */
#define UART_UART_SRR_REG_UART_UR_Pos         (0UL)                     /*!< UART UART_SRR_REG: UART_UR (Bit 0)                          */
#define UART_UART_SRR_REG_UART_UR_Msk         (0x1UL)                   /*!< UART UART_SRR_REG: UART_UR (Bitfield-Mask: 0x01)            */

