openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680BB.h
/* -----------------------------  UART2_UART2_MCR_REG  ---------------------------- */
#define UART2_UART2_MCR_REG_UART_RTS_Pos      (1UL)                     /*!< UART2 UART2_MCR_REG: UART_RTS (Bit 1)                       */
#define UART2_UART2_MCR_REG_UART_RTS_Msk      (0x2UL)                   /*!< UART2 UART2_MCR_REG: UART_RTS (Bitfield-Mask: 0x01)         */
#define UART2_UART2_MCR_REG_UART_OUT1_Pos     (2UL)                     /*!< UART2 UART2_MCR_REG: UART_OUT1 (Bit 2)                      */
#define UART2_UART2_MCR_REG_UART_OUT1_Msk     (0x4UL)                   /*!< UART2 UART2_MCR_REG: UART_OUT1 (Bitfield-Mask: 0x01)        */
#define UART2_UART2_MCR_REG_UART_OUT2_Pos     (3UL)                     /*!< UART2 UART2_MCR_REG: UART_OUT2 (Bit 3)                      */
#define UART2_UART2_MCR_REG_UART_OUT2_Msk     (0x8UL)                   /*!< UART2 UART2_MCR_REG: UART_OUT2 (Bitfield-Mask: 0x01)        */
#define UART2_UART2_MCR_REG_UART_LB_Pos       (4UL)                     /*!< UART2 UART2_MCR_REG: UART_LB (Bit 4)                        */
#define UART2_UART2_MCR_REG_UART_LB_Msk       (0x10UL)                  /*!< UART2 UART2_MCR_REG: UART_LB (Bitfield-Mask: 0x01)          */
#define UART2_UART2_MCR_REG_UART_AFCE_Pos     (5UL)                     /*!< UART2 UART2_MCR_REG: UART_AFCE (Bit 5)                      */
#define UART2_UART2_MCR_REG_UART_AFCE_Msk     (0x20UL)                  /*!< UART2 UART2_MCR_REG: UART_AFCE (Bitfield-Mask: 0x01)        */
#define UART2_UART2_MCR_REG_UART_SIRE_Pos     (6UL)                     /*!< UART2 UART2_MCR_REG: UART_SIRE (Bit 6)                      */
#define UART2_UART2_MCR_REG_UART_SIRE_Msk     (0x40UL)                  /*!< UART2 UART2_MCR_REG: UART_SIRE (Bitfield-Mask: 0x01)        */

/* -----------------------------  UART2_UART2_LSR_REG  ---------------------------- */
#define UART2_UART2_LSR_REG_UART_DR_Pos       (0UL)                     /*!< UART2 UART2_LSR_REG: UART_DR (Bit 0)                        */
#define UART2_UART2_LSR_REG_UART_DR_Msk       (0x1UL)                   /*!< UART2 UART2_LSR_REG: UART_DR (Bitfield-Mask: 0x01)          */
#define UART2_UART2_LSR_REG_UART_OE_Pos       (1UL)                     /*!< UART2 UART2_LSR_REG: UART_OE (Bit 1)                        */
#define UART2_UART2_LSR_REG_UART_OE_Msk       (0x2UL)                   /*!< UART2 UART2_LSR_REG: UART_OE (Bitfield-Mask: 0x01)          */
#define UART2_UART2_LSR_REG_UART_PE_Pos       (2UL)                     /*!< UART2 UART2_LSR_REG: UART_PE (Bit 2)                        */
#define UART2_UART2_LSR_REG_UART_PE_Msk       (0x4UL)                   /*!< UART2 UART2_LSR_REG: UART_PE (Bitfield-Mask: 0x01)          */
#define UART2_UART2_LSR_REG_UART_FE_Pos       (3UL)                     /*!< UART2 UART2_LSR_REG: UART_FE (Bit 3)                        */
#define UART2_UART2_LSR_REG_UART_FE_Msk       (0x8UL)                   /*!< UART2 UART2_LSR_REG: UART_FE (Bitfield-Mask: 0x01)          */
#define UART2_UART2_LSR_REG_UART_BI_Pos       (4UL)                     /*!< UART2 UART2_LSR_REG: UART_BI (Bit 4)                        */
#define UART2_UART2_LSR_REG_UART_BI_Msk       (0x10UL)                  /*!< UART2 UART2_LSR_REG: UART_BI (Bitfield-Mask: 0x01)          */
#define UART2_UART2_LSR_REG_UART_THRE_Pos     (5UL)                     /*!< UART2 UART2_LSR_REG: UART_THRE (Bit 5)                      */
#define UART2_UART2_LSR_REG_UART_THRE_Msk     (0x20UL)                  /*!< UART2 UART2_LSR_REG: UART_THRE (Bitfield-Mask: 0x01)        */
#define UART2_UART2_LSR_REG_UART_TEMT_Pos     (6UL)                     /*!< UART2 UART2_LSR_REG: UART_TEMT (Bit 6)                      */
#define UART2_UART2_LSR_REG_UART_TEMT_Msk     (0x40UL)                  /*!< UART2 UART2_LSR_REG: UART_TEMT (Bitfield-Mask: 0x01)        */
#define UART2_UART2_LSR_REG_UART_RFE_Pos      (7UL)                     /*!< UART2 UART2_LSR_REG: UART_RFE (Bit 7)                       */
#define UART2_UART2_LSR_REG_UART_RFE_Msk      (0x80UL)                  /*!< UART2 UART2_LSR_REG: UART_RFE (Bitfield-Mask: 0x01)         */

/* -----------------------------  UART2_UART2_MSR_REG  ---------------------------- */
#define UART2_UART2_MSR_REG_UART_DCTS_Pos     (0UL)                     /*!< UART2 UART2_MSR_REG: UART_DCTS (Bit 0)                      */
#define UART2_UART2_MSR_REG_UART_DCTS_Msk     (0x1UL)                   /*!< UART2 UART2_MSR_REG: UART_DCTS (Bitfield-Mask: 0x01)        */
#define UART2_UART2_MSR_REG_UART_CTS_Pos      (4UL)                     /*!< UART2 UART2_MSR_REG: UART_CTS (Bit 4)                       */
#define UART2_UART2_MSR_REG_UART_CTS_Msk      (0x10UL)                  /*!< UART2 UART2_MSR_REG: UART_CTS (Bitfield-Mask: 0x01)         */

/* -----------------------------  UART2_UART2_SCR_REG  ---------------------------- */
#define UART2_UART2_SCR_REG_UART_SCRATCH_PAD_Pos (0UL)                  /*!< UART2 UART2_SCR_REG: UART_SCRATCH_PAD (Bit 0)               */
#define UART2_UART2_SCR_REG_UART_SCRATCH_PAD_Msk (0xffUL)               /*!< UART2 UART2_SCR_REG: UART_SCRATCH_PAD (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR0_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR0_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR0_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR0_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR0_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR1_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR1_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR1_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR1_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR1_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR2_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR2_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR2_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR2_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR2_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR3_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR3_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR3_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR3_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR3_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR4_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR4_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR4_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR4_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR4_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR5_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR5_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR5_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR5_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR5_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR6_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR6_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR6_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR6_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR6_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR7_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR7_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR7_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR7_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR7_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR8_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR8_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR8_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR8_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR8_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR9_REG  ------------------------- */
#define UART2_UART2_SRBR_STHR9_REG_SRBR_STHRx_Pos (0UL)                 /*!< UART2 UART2_SRBR_STHR9_REG: SRBR_STHRx (Bit 0)              */
#define UART2_UART2_SRBR_STHR9_REG_SRBR_STHRx_Msk (0xffUL)              /*!< UART2 UART2_SRBR_STHR9_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR10_REG  ------------------------ */
#define UART2_UART2_SRBR_STHR10_REG_SRBR_STHRx_Pos (0UL)                /*!< UART2 UART2_SRBR_STHR10_REG: SRBR_STHRx (Bit 0)             */
#define UART2_UART2_SRBR_STHR10_REG_SRBR_STHRx_Msk (0xffUL)             /*!< UART2 UART2_SRBR_STHR10_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR11_REG  ------------------------ */
#define UART2_UART2_SRBR_STHR11_REG_SRBR_STHRx_Pos (0UL)                /*!< UART2 UART2_SRBR_STHR11_REG: SRBR_STHRx (Bit 0)             */
#define UART2_UART2_SRBR_STHR11_REG_SRBR_STHRx_Msk (0xffUL)             /*!< UART2 UART2_SRBR_STHR11_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR12_REG  ------------------------ */
#define UART2_UART2_SRBR_STHR12_REG_SRBR_STHRx_Pos (0UL)                /*!< UART2 UART2_SRBR_STHR12_REG: SRBR_STHRx (Bit 0)             */
#define UART2_UART2_SRBR_STHR12_REG_SRBR_STHRx_Msk (0xffUL)             /*!< UART2 UART2_SRBR_STHR12_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR13_REG  ------------------------ */
#define UART2_UART2_SRBR_STHR13_REG_SRBR_STHRx_Pos (0UL)                /*!< UART2 UART2_SRBR_STHR13_REG: SRBR_STHRx (Bit 0)             */
#define UART2_UART2_SRBR_STHR13_REG_SRBR_STHRx_Msk (0xffUL)             /*!< UART2 UART2_SRBR_STHR13_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR14_REG  ------------------------ */
#define UART2_UART2_SRBR_STHR14_REG_SRBR_STHRx_Pos (0UL)                /*!< UART2 UART2_SRBR_STHR14_REG: SRBR_STHRx (Bit 0)             */
#define UART2_UART2_SRBR_STHR14_REG_SRBR_STHRx_Msk (0xffUL)             /*!< UART2 UART2_SRBR_STHR14_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -------------------------  UART2_UART2_SRBR_STHR15_REG  ------------------------ */
#define UART2_UART2_SRBR_STHR15_REG_SRBR_STHRx_Pos (0UL)                /*!< UART2 UART2_SRBR_STHR15_REG: SRBR_STHRx (Bit 0)             */
#define UART2_UART2_SRBR_STHR15_REG_SRBR_STHRx_Msk (0xffUL)             /*!< UART2 UART2_SRBR_STHR15_REG: SRBR_STHRx (Bitfield-Mask: 0xff) */

/* -----------------------------  UART2_UART2_FAR_REG  ---------------------------- */
#define UART2_UART2_FAR_REG_UART_FAR_Pos      (0UL)                     /*!< UART2 UART2_FAR_REG: UART_FAR (Bit 0)                       */
#define UART2_UART2_FAR_REG_UART_FAR_Msk      (0x1UL)                   /*!< UART2 UART2_FAR_REG: UART_FAR (Bitfield-Mask: 0x01)         */

/* -----------------------------  UART2_UART2_USR_REG  ---------------------------- */
#define UART2_UART2_USR_REG_UART_BUSY_Pos     (0UL)                     /*!< UART2 UART2_USR_REG: UART_BUSY (Bit 0)                      */
#define UART2_UART2_USR_REG_UART_BUSY_Msk     (0x1UL)                   /*!< UART2 UART2_USR_REG: UART_BUSY (Bitfield-Mask: 0x01)        */
#define UART2_UART2_USR_REG_UART_TFNF_Pos     (1UL)                     /*!< UART2 UART2_USR_REG: UART_TFNF (Bit 1)                      */
#define UART2_UART2_USR_REG_UART_TFNF_Msk     (0x2UL)                   /*!< UART2 UART2_USR_REG: UART_TFNF (Bitfield-Mask: 0x01)        */
#define UART2_UART2_USR_REG_UART_TFE_Pos      (2UL)                     /*!< UART2 UART2_USR_REG: UART_TFE (Bit 2)                       */
#define UART2_UART2_USR_REG_UART_TFE_Msk      (0x4UL)                   /*!< UART2 UART2_USR_REG: UART_TFE (Bitfield-Mask: 0x01)         */
#define UART2_UART2_USR_REG_UART_RFNE_Pos     (3UL)                     /*!< UART2 UART2_USR_REG: UART_RFNE (Bit 3)                      */
#define UART2_UART2_USR_REG_UART_RFNE_Msk     (0x8UL)                   /*!< UART2 UART2_USR_REG: UART_RFNE (Bitfield-Mask: 0x01)        */
#define UART2_UART2_USR_REG_UART_RFF_Pos      (4UL)                     /*!< UART2 UART2_USR_REG: UART_RFF (Bit 4)                       */
#define UART2_UART2_USR_REG_UART_RFF_Msk      (0x10UL)                  /*!< UART2 UART2_USR_REG: UART_RFF (Bitfield-Mask: 0x01)         */

/* -----------------------------  UART2_UART2_TFL_REG  ---------------------------- */
#define UART2_UART2_TFL_REG_UART_TRANSMIT_FIFO_LEVEL_Pos (0UL)          /*!< UART2 UART2_TFL_REG: UART_TRANSMIT_FIFO_LEVEL (Bit 0)       */
#define UART2_UART2_TFL_REG_UART_TRANSMIT_FIFO_LEVEL_Msk (0xffffUL)     /*!< UART2 UART2_TFL_REG: UART_TRANSMIT_FIFO_LEVEL (Bitfield-Mask: 0xffff) */

/* -----------------------------  UART2_UART2_RFL_REG  ---------------------------- */
#define UART2_UART2_RFL_REG_UART_RECEIVE_FIFO_LEVEL_Pos (0UL)           /*!< UART2 UART2_RFL_REG: UART_RECEIVE_FIFO_LEVEL (Bit 0)        */
#define UART2_UART2_RFL_REG_UART_RECEIVE_FIFO_LEVEL_Msk (0xffffUL)      /*!< UART2 UART2_RFL_REG: UART_RECEIVE_FIFO_LEVEL (Bitfield-Mask: 0xffff) */

/* -----------------------------  UART2_UART2_SRR_REG  ---------------------------- */
#define UART2_UART2_SRR_REG_UART_UR_Pos       (0UL)                     /*!< UART2 UART2_SRR_REG: UART_UR (Bit 0)                        */
#define UART2_UART2_SRR_REG_UART_UR_Msk       (0x1UL)                   /*!< UART2 UART2_SRR_REG: UART_UR (Bitfield-Mask: 0x01)          */
#define UART2_UART2_SRR_REG_UART_RFR_Pos      (1UL)                     /*!< UART2 UART2_SRR_REG: UART_RFR (Bit 1)                       */
#define UART2_UART2_SRR_REG_UART_RFR_Msk      (0x2UL)                   /*!< UART2 UART2_SRR_REG: UART_RFR (Bitfield-Mask: 0x01)         */
#define UART2_UART2_SRR_REG_UART_XFR_Pos      (2UL)                     /*!< UART2 UART2_SRR_REG: UART_XFR (Bit 2)                       */
#define UART2_UART2_SRR_REG_UART_XFR_Msk      (0x4UL)                   /*!< UART2 UART2_SRR_REG: UART_XFR (Bitfield-Mask: 0x01)         */

/* ----------------------------  UART2_UART2_SRTS_REG  ---------------------------- */
#define UART2_UART2_SRTS_REG_UART_SHADOW_REQUEST_TO_SEND_Pos (0UL)      /*!< UART2 UART2_SRTS_REG: UART_SHADOW_REQUEST_TO_SEND (Bit 0)   */
#define UART2_UART2_SRTS_REG_UART_SHADOW_REQUEST_TO_SEND_Msk (0x1UL)    /*!< UART2 UART2_SRTS_REG: UART_SHADOW_REQUEST_TO_SEND (Bitfield-Mask: 0x01) */

/* ----------------------------  UART2_UART2_SBCR_REG  ---------------------------- */
#define UART2_UART2_SBCR_REG_UART_SHADOW_BREAK_CONTROL_Pos (0UL)        /*!< UART2 UART2_SBCR_REG: UART_SHADOW_BREAK_CONTROL (Bit 0)     */
#define UART2_UART2_SBCR_REG_UART_SHADOW_BREAK_CONTROL_Msk (0x1UL)      /*!< UART2 UART2_SBCR_REG: UART_SHADOW_BREAK_CONTROL (Bitfield-Mask: 0x01) */

